//
//  Macros.h
//  dqxRecipe
//
//  Created by HANSHAOWEN on 16/11/23.
//  Copyright © 2016年 mengyoutu.cn. All rights reserved.
//

#ifndef Macros_h
#define Macros_h

#pragma mark - UI / 屏幕、控件尺寸

#define kKeyWindow [UIApplication sharedApplication].keyWindow

#define isRetina                  ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(640, 960), [[UIScreen mainScreen] currentMode].size) : NO)
#define isPad                     (UI_USER_INTERFACE_IDIOM() == UIUserInterfaceIdiomPad)
#define BottomEdgeYOfView(view)   view.frame.origin.y + view.frame.size.height
// 屏幕高度
#define SCREEN_HEIGHT             [[UIScreen mainScreen] bounds].size.height
// 屏幕宽度
#define SCREEN_WIDTH              [[UIScreen mainScreen] bounds].size.width
#define FULL_WIDTH                SCREEN_WIDTH
#define FULL_HEIGHT               (SCREEN_HEIGHT - ((SYSTEM_VERSION >= 7) ? 0 : STATUSBAR_HEIGHT))
#define CONTENT_HEIGHT            (FULL_HEIGHT - NAVBAR_HEIGHT)

#define Device_Is_iPhone5         ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(640, 1136), [[UIScreen mainScreen] currentMode].size) : NO)
#define Device_Is_iPhone6         ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(750, 1334), [[UIScreen mainScreen] currentMode].size) : NO)
#define Device_Is_iPhone6Plus     ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(1242, 2208), [[UIScreen mainScreen] currentMode].size) : NO)

#define DEVICE_UUID               [[[UIDevice currentDevice] identifierForVendor] UUIDString]

#define KEYBOARD_HEIGHT           216

// 字体
#pragma mark - font
#define FontWithNameSize(name, size)    [UIFont fontWithName:name size:size]
#define FontWithSize(size)              [UIFont systemFontOfSize:size]
#define ScoreFontWithSize(fontSize)     [UIFont fontWithName:@"Bradley Hand" size:fontSize]
#define BoldFontWithSize(size)          [UIFont boldSystemFontOfSize:size]
#define BoldSystemFont(size)            [UIFont boldSystemFontOfSize:size]
#define systemFont(size)                [UIFont systemFontOfSize:size]

#pragma mark - GCD
// 单例
#define DISPATCH_ONCE_BLOCK(onceBlock); static dispatch_once_t onceToken; dispatch_once(&onceToken, onceBlock);

// 是否为中文
#define IS_CH_SYMBOL(chr)               ((int)(chr)>127)
#define StringByTrimWhiteSpace(text)    [text stringByTrimmingCharactersInSet:[NSCharacterSet whitespaceAndNewlineCharacterSet]]
#define IsStringEmpty(string)           (!string || [@"" isEqualToString:string])
#define IsStringNotEmpty(string)        (string && ![@"" isEqualToString:string])

//详细的数据
//武器锻造－武器配方
#define RECIPT_SECTION1_1               @[@"单手剑", @"双手剑", @"短剑", @"矛", @"斧", @"爪", @"鞭", @"锤", @"回旋镖"]
#define RECIPT_SECTION1_1_SUB           @[@[@"青铜剑", @"细剑", @"铁剑", @"占山军刀", @"银制细剑", @"钢铁之剑", @"七夕之剑", @"手半剑", @"西部细剑", @"战士之剑", @"破邪之剑", @"隼之剑", @"白金剑", @"魔剑士细剑", @"斩尸剑", @"奇迹之剑", @"斩龙剑", @"火焰剑", @"金属史莱姆之剑", @"缟玛瑙魔剑", @"星尘之剑", @"圣王之剑", @"雷霆之剑", @"名刀 斩铁丸", @"天命之剑"],\
                                        @[@"青铜大剑", @"巨刃", @"铁制大剑", @"巨刃Ⅱ", @"夜影大剑", @"钢铁大剑", @"繁星大剑", @"巨剪", @"退魔太刀", @"血腥之刃", @"新月大剑", @"斩夜太刀", @"白金大剑", @"恶魔大剑", @"灭龙剑", @"君王大剑", @"大狱剑", @"金属史莱姆大剑", @"天马大剑", @"源力大剑", @"圣王之大剑", @"帝国大剑", @"混沌大剑", @"翠石大剑"],\
                                        @[@"神圣短刀", @"毒蛾短刀", @"响马短刀", @"刺客匕首", @"银制短剑", @"小恶魔短刀", @"毒针", @"鹰之匕首", @"夜蝶短剑", @"破剑之刃", @"穿刺耳环", @"冰刃", @"古斗士短剑", @"血针", @"沙罗曼蛇", @"王家短刀", @"猎鹰匕首", @"寒风匕首", @"千刺匕首", @"圣王之短刀", @"雷霆匕首", @"剧毒鳞刃", @"水晶之刃"],\
                                        @[@"青铜矛", @"长矛", @"铁矛", @"近卫兵矛", @"神圣之矛", @"钢铁之矛", @"战叉", @"闪电之矛", @"游击之矛", @"沙尘之矛", @"古拉柯斯之矛", @"白金矛", @"雷神之矛", @"恶魔之矛", @"海洋之叉", @"英雄之矛", @"金属史莱姆之矛", @"圣骑士之矛", @"鬼神魔枪", @"圣王之矛", @"炽天使之矛", @"血腥之矛", @"雅典娜圣枪"],\
                                        @[@"青铜斧", @"占山斧", @"铁斧", @"轻斧", @"银之斧", @"钢铁之斧", @"战斧", @"卡尔萨多拉之斧", @"月之斧", @"达人之斧", @"君王之斧", @"日蚀之斧", @"萨满之斧", @"风雪之斧", @"凯撒之斧", @"毁灭者", @"霸者之斧", @"巨斧", @"粉碎砍刀", @"圣王之斧", @"阿波罗之斧", @"公爵之斧", @"雪崩之斧"],\
                                        @[@"青铜爪", @"猫爪", @"铁爪", @"驱魔之爪", @"白银爪", @"钢铁之爪", @"小恶魔之爪", @"黑豹之爪", @"隼爪", @"火焰之爪", @"冰爪", @"白金爪", @"恶魔之爪", @"龙爪", @"古武道之爪", @"魔兽之爪", @"猎鹰之爪", @"冥兽之爪", @"龙王之爪", @"圣王之爪", @"水晶爪", @"船长钩爪", @"苍炎之爪"],\
                                        @[@"战斗缎带", @"铁鞭", @"蛇皮鞭", @"蔷薇鞭", @"钢铁之鞭", @"星球鞭", @"锦蛇鞭", @"魅惑缎带", @"野兽鞭", @"响尾蛇鞭", @"蝎尾鞭", @"爆裂之鞭", @"龙尾鞭", @"恶魔之鞭", @"卡尔贝罗鞭", @"海蛇之鞭", @"女王之鞭", @"魔神之鞭", @"圣王之鞭", @"三叉戟鞭", @"冰封之鞭", @"锚鞭"],\
                                        @[@"青铜槌", @"铁棒", @"大槌", @"银槌", @"钢铁之槌", @"战锤", @"战斗圆头锤", @"鬼棒", @"碎骨锤", @"魔法锤", @"白金锤", @"冰原之锤", @"火山锤", @"巨锤", @"巨人锤", @"哥顿锤", @"百万吨重锤", @"魔神之槌", @"圣王之锤", @"天崩地裂", @"巴雷特锤", @"天使铁锤"],\
                                        @[@"青铜回旋镖", @"利刃回旋镖", @"铁翼回旋镖", @"十字回旋镖", @"白银回旋镖", @"钢铁回旋镖", @"翼之刃", @"风之回旋镖", @"忍者回旋镖", @"魔法回旋镖", @"双翼回旋镖", @"白金回旋镖", @"寒冰回旋镖", @"火焰回旋镖", @"黑鹰回旋镖", @"南十字星", @"金属之翼", @"五芒星", @"流星之刃", @"圣王之回旋镖", @"蓝色猎鹰", @"三尖回旋镖", @"暗黑之星"]]
#define RECIPT_SECTION1_1_SUB_IMAGE     @[@[@"青铜剑", @"Icon-细剑", @"Icon-铁剑", @"Icon-占山军刀", @"Icon-银制细剑", @"Icon-钢铁之剑", @"Icon-七夕之剑", @"Icon-手半剑", @"Icon-西部细剑", @"Icon-战士之剑", @"Icon-破邪之剑", @"Icon-隼之剑", @"Icon-白金剑", @"Icon-魔剑士细剑", @"Icon-斩尸剑", @"Icon-奇迹之剑", @"Icon-斩龙剑", @"Icon-火焰剑", @"Icon-金属史莱姆之剑", @"Icon-缟玛瑙魔剑", @"Icon-星尘之剑", @"Icon-圣王之剑", @"Icon-雷霆之剑", @"Icon-名刀 斩铁丸", @"Icon-天命之剑"],\
                                        @[@"青铜大剑", @"Icon-巨刃", @"Icon-铁制大剑", @"Icon-巨刃Ⅱ", @"Icon-夜影大剑", @"Icon-钢铁大剑", @"Icon-繁星大剑", @"Icon-巨剪", @"Icon-退魔太刀", @"Icon-血腥之刃", @"Icon-新月大剑", @"Icon-斩夜太刀", @"Icon-白金大剑", @"Icon-恶魔大剑", @"Icon-灭龙剑", @"Icon-君王大剑", @"Icon-大狱剑", @"Icon-金属史莱姆大剑", @"Icon-天马大剑", @"Icon-源力大剑", @"Icon-圣王之大剑", @"Icon-帝国大剑", @"Icon-混沌大剑", @"Icon-翠石大剑"],\
                                        @[@"神圣短刀", @"Icon-毒蛾短刀", @"Icon-响马短刀", @"Icon-刺客匕首", @"Icon-银制短剑", @"Icon-小恶魔短刀", @"Icon-毒针", @"Icon-鹰之匕首", @"Icon-夜蝶短剑", @"Icon-破剑之刃", @"Icon-穿刺耳环", @"Icon-冰刃", @"Icon-古斗士短剑", @"Icon-血针", @"Icon-沙罗曼蛇", @"Icon-王家短刀", @"Icon-猎鹰匕首", @"Icon-寒风匕首", @"Icon-千刺匕首", @"Icon-圣王之短刀", @"Icon-雷霆匕首", @"Icon-剧毒鳞刃", @"Icon-水晶之刃"],\
                                        @[@"青铜矛", @"Icon-长矛", @"Icon-铁矛", @"Icon-近卫兵矛", @"Icon-神圣之矛", @"Icon-钢铁之矛", @"Icon-战叉", @"Icon-闪电之矛", @"Icon-游击之矛", @"Icon-沙尘之矛", @"Icon-古拉柯斯之矛", @"Icon-白金矛", @"Icon-雷神之矛", @"Icon-恶魔之矛", @"Icon-海洋之叉", @"Icon-英雄之矛", @"Icon-金属史莱姆之矛", @"Icon-圣骑士之矛", @"Icon-鬼神魔枪", @"Icon-圣王之矛", @"Icon-炽天使之矛", @"Icon-血腥之矛", @"Icon-雅典娜圣枪"],\
                                        @[@"青铜斧", @"Icon-占山斧", @"Icon-铁斧", @"Icon-轻斧", @"Icon-银之斧", @"Icon-钢铁之斧", @"Icon-战斧", @"Icon-卡尔萨多拉之斧", @"Icon-月之斧", @"Icon-达人之斧", @"Icon-君王之斧", @"Icon-日蚀之斧", @"Icon-萨满之斧", @"Icon-风雪之斧", @"Icon-凯撒之斧", @"Icon-毁灭者", @"Icon-霸者之斧", @"Icon-巨斧", @"Icon-粉碎砍刀", @"Icon-圣王之斧", @"Icon-阿波罗之斧", @"Icon-公爵之斧", @"Icon-雪崩之斧"],\
                                        @[@"青铜爪", @"Icon-猫爪", @"Icon-铁爪", @"Icon-驱魔之爪", @"Icon-白银爪", @"Icon-钢铁之爪", @"Icon-小恶魔之爪", @"Icon-黑豹之爪", @"Icon-隼爪", @"Icon-火焰之爪", @"Icon-冰爪", @"Icon-白金爪", @"Icon-恶魔之爪", @"Icon-龙爪", @"Icon-古武道之爪", @"Icon-魔兽之爪", @"Icon-猎鹰之爪", @"Icon-冥兽之爪", @"Icon-龙王之爪", @"Icon-圣王之爪", @"Icon-水晶爪", @"Icon-船长钩爪", @"Icon-苍炎之爪"],\
                                        @[@"战斗缎带", @"Icon-铁鞭", @"Icon-蛇皮鞭", @"Icon-蔷薇鞭", @"Icon-钢铁之鞭", @"Icon-星球鞭", @"Icon-锦蛇鞭", @"Icon-魅惑缎带", @"Icon-野兽鞭", @"Icon-响尾蛇鞭", @"Icon-蝎尾鞭", @"Icon-爆裂之鞭", @"Icon-龙尾鞭", @"Icon-恶魔之鞭", @"Icon-卡尔贝罗鞭", @"Icon-海蛇之鞭", @"Icon-女王之鞭", @"Icon-魔神之鞭", @"Icon-圣王之鞭", @"Icon-三叉戟鞭", @"Icon-冰封之鞭", @"Icon-锚鞭"],\
                                        @[@"青铜槌", @"Icon-铁棒", @"Icon-大槌", @"Icon-银槌", @"Icon-钢铁之槌", @"Icon-战锤", @"Icon-战斗圆头锤", @"Icon-鬼棒", @"Icon-碎骨锤", @"Icon-魔法锤", @"Icon-白金锤", @"Icon-冰原之锤", @"Icon-火山锤", @"Icon-巨锤", @"Icon-巨人锤", @"Icon-哥顿锤", @"Icon-百万吨重锤", @"Icon-魔神之槌", @"Icon-圣王之锤", @"Icon-天崩地裂", @"Icon-巴雷特锤", @"Icon-天使铁锤"],\
                                        @[@"青铜回旋镖", @"Icon-利刃回旋镖", @"Icon-铁翼回旋镖", @"Icon-十字回旋镖", @"Icon-白银回旋镖", @"Icon-钢铁回旋镖", @"Icon-翼之刃", @"Icon-风之回旋镖", @"Icon-忍者回旋镖", @"Icon-魔法回旋镖", @"Icon-双翼回旋镖", @"Icon-白金回旋镖", @"Icon-寒冰回旋镖", @"Icon-火焰回旋镖", @"Icon-黑鹰回旋镖", @"Icon-南十字星", @"Icon-金属之翼", @"Icon-五芒星", @"Icon-流星之刃", @"Icon-圣王之回旋镖", @"Icon-蓝色猎鹰", @"Icon-三尖回旋镖", @"Icon-暗黑之星"]]
//武器锻造－家具配方
#define RECIPT_SECTION1_2               @[@"家具配方"]
#define RECIPT_SECTION1_2_SUB			@[@[@"天文望远镜·茶", @"怀旧电风扇"]]
#define RECIPT_SECTION1_2_SUB_IMAGE     @[@[@"", @""]]
//武器锻造－庭具配方
#define RECIPT_SECTION1_3               @[@"庭具配方"]
#define RECIPT_SECTION1_3_SUB			@[@[@"天文仪·银", @"银河风铃·白"]]
#define RECIPT_SECTION1_3_SUB_IMAGE     @[@[@"", @""]]
//防具锻造－防具锻造配方
#define RECIPT_SECTION2_1               @[@"盾", @"鳞铠", @"铁制铠甲", @"锁链甲", @"银制防具", @"新兵配发防具", @"钢制防具", @"魔法护甲", @"占山铠甲", @"黑钢铠甲", @"白金套装", @"玄武", @"古强者", @"沉重铠甲", @"亡灵", @"刀刃铠甲", @"战斗衣服", @"哥特防具", @"师团长", @"僧兵", @"贵族", @"野蛮", @"突刺", @"假面舞会", @"飞龙", @"圣骑士", @"神兵", @"伟大", @"流浪", @"王军师", @"机械", @"血红", @"凯歌", @"毒蛇"]
#define RECIPT_SECTION2_1_SUB			@[@[@"轻圆盾", @"铁制大盾", @"白银托盘", @"纯白圆盾", @"钢铁大盾", @"史莱姆托盘", @"小鬼圆盾", @"史莱姆贝斯托盘", @"魔法盾", @"鸢盾", @"封魔盾", @"战士大盾", @"白金托盘", @"鬼蜘蛛盾", @"露夫盾", @"白金盾", @"龙盾", @"水镜之盾", @"符文圆盾", @"金属史莱姆之盾", @"头领大盾", @"圣骑士的大盾", @"巨魔盾", @"邪眼大盾", @"圣王之大盾", @"圣王之盾", @"圣女之盾", @"乌尔贝阿大盾", @"天青石大盾"],\
										@[@"鳞盔", @"鳞护手", @"鳞长靴", @"鳞铠上装", @"鳞铠下装"],\
										@[@"铁制护额", @"铁制护腕", @"铁制护腿", @"铁制胸铠", @"铁制甲裙", @"铁制头盔", @"铁制护手", @"铁制长靴", @"铁制铠甲下装", @"铁制铠甲上装"],\
										@[@"锁链护额", @"锁链护臂", @"锁链靴", @"锁链甲上装", @"锁链甲下装"],\
										@[@"银制护额", @"银制护手", @"银制长靴", @"银制胸铠", @"银制甲裙"],\
										@[@"新兵头盔", @"新兵手套", @"新兵长靴", @"新兵胸铠", @"新兵甲裙"],\
										@[@"钢制头盔", @"钢制护手", @"钢制长靴", @"钢制铠甲上装", @"钢制铠甲下装"],\
										@[@"魔法之冠", @"魔法护手", @"魔法长靴", @"魔法铠甲上装", @"魔法铠甲下装"],\
										@[@"占山头带", @"占山手套", @"占山长靴", @"占山链甲", @"占山裤子"],\
										@[@"黑钢护额", @"黑钢护手", @"黑钢长靴", @"黑钢铠甲上装", @"黑钢铠甲下装"],\
										@[@"白金头盔", @"白金护手", @"白金长靴", @"白金铠甲上装", @"白金铠甲下装"],\
										@[@"玄武头盔", @"玄武腕带", @"玄武鞋", @"玄武道衣上装", @"玄武道衣下装"],\
										@[@"古强者头盔", @"古强者护手", @"古强者长靴", @"古强者铠甲下装", @"古强者铠甲上装"],\
										@[@"沉重头盔", @"沉重手套", @"沉重长靴", @"沉重护甲下装", @"沉重护甲上装"],\
										@[@"亡灵头巾", @"亡灵护臂", @"亡灵长靴", @"亡灵披风"],\
										@[@"刀刃护额", @"刀刃铠甲上装", @"刀刃铠甲下装", @"刀刃护手", @"刀刃长靴"],\
										@[@"战斗头冠", @"战斗护手", @"战斗衣服上装", @"战斗衣服下装", @"战斗长靴"],\
										@[@"哥特礼帽", @"哥特帽", @"哥特手套", @"哥特护手", @"哥特长筒袜", @"哥特长靴", @"哥特裙", @"哥特外衣上装", @"哥特胸衣", @"哥特外衣下装"],\
										@[@"师团长头盔", @"师团长护手", @"师团长长靴", @"师团长铠甲上装", @"师团长铠甲下装"],\
										@[@"僧兵之冠", @"僧兵衣服上装", @"僧兵衣服下装", @"僧兵手套", @"僧兵鞋"],\
										@[@"贵族帽", @"贵族外衣上装", @"贵族外衣下装", @"贵族手套", @"贵族长靴"],\
										@[@"野蛮贝雷帽", @"野蛮上衣", @"野蛮下装", @"野蛮手镯", @"野蛮鞋"],\
										@[@"突刺头盔", @"突刺铠甲上装", @"突刺铠甲下装", @"突刺手套", @"突刺长靴"],\
										@[@"假面舞会头盔", @"假面舞会礼服", @"假面舞会手套", @"假面舞会长靴"],\
										@[@"飞龙头盔", @"飞龙上衣", @"飞龙长裤", @"飞龙手套", @"飞龙长靴"],\
										@[@"圣骑士头盔", @"圣骑士铠甲上装", @"圣骑士铠甲下装", @"圣骑士护手", @"圣骑士长靴"],\
										@[@"神兵头盔", @"神兵铠甲上装", @"神兵铠甲下装", @"神兵护手", @"神兵长靴"],\
										@[@"伟大头盔", @"伟大披风", @"伟大手套", @"伟大长靴"],\
										@[@"流浪帽", @"流浪外衣上装", @"流浪外衣下装", @"流浪护臂", @"流浪鞋"],\
										@[@"王军师头盔", @"王军师手套", @"王军师铠甲", @"王军师长靴"],\
										@[@"机械兜帽", @"机械衣服上装", @"机械衣服下装", @"机械护手", @"机械靴"],\
										@[@"血红头盔", @"血红铠甲上装", @"血红铠甲下装", @"血红手套", @"血红长靴"],\
										@[@"凯歌头盔", @"凯歌铠甲上装", @"凯歌铠甲下装", @"凯歌护手", @"凯歌长靴"],\
										@[@"毒蛇帽", @"毒蛇外衣", @"毒蛇手套", @"毒蛇长靴"]]
										
#define RECIPT_SECTION2_1_SUB_IMAGE		@[@[@"Icon-轻圆盾", @"Icon-铁制大盾", @"Icon-白银托盘", @"Icon-纯白圆盾", @"Icon-钢铁大盾", @"Icon-史莱姆托盘", @"Icon-小鬼圆盾", @"Icon-史莱姆贝斯托盘", @"Icon-魔法盾", @"Icon-鸢盾", @"Icon-封魔盾", @"Icon-战士大盾", @"Icon-白金托盘", @"Icon-鬼蜘蛛盾", @"Icon-露夫盾", @"Icon-白金盾", @"Icon-龙盾", @"Icon-水镜之盾", @"Icon-符文圆盾", @"Icon-金属史莱姆之盾", @"Icon-头领大盾", @"Icon-圣骑士的大盾", @"Icon-巨魔盾", @"Icon-邪眼大盾", @"Icon-圣王之大盾", @"Icon-圣王之盾", @"Icon-圣女之盾", @"Icon-乌尔贝阿大盾", @"Icon-天青石大盾"],\
										@[@"Icon-鳞盔", @"Icon-鳞护手", @"Icon-鳞长靴", @"Icon-鳞铠上装", @"Icon-鳞铠下装"],\
										@[@"Icon-铁制护额", @"Icon-铁制护腕", @"Icon-铁制护腿", @"Icon-铁制胸铠", @"Icon-铁制甲裙", @"Icon-铁制头盔", @"Icon-铁制护手", @"Icon-铁制长靴", @"Icon-铁制铠甲下装", @"Icon-铁制铠甲上装"],\
										@[@"Icon-锁链护额", @"Icon-锁链护臂", @"Icon-锁链靴", @"Icon-锁链甲上装", @"Icon-锁链甲下装"],\
										@[@"Icon-银制护额", @"Icon-银制护手", @"Icon-银制长靴", @"Icon-银制胸铠", @"Icon-银制甲裙"],\
										@[@"Icon-新兵头盔", @"Icon-新兵手套", @"Icon-新兵长靴", @"Icon-新兵胸铠", @"Icon-新兵甲裙"],\
										@[@"Icon-钢制头盔", @"Icon-钢制护手", @"Icon-钢制长靴", @"Icon-钢制铠甲上装", @"Icon-钢制铠甲下装"],\
										@[@"Icon-魔法之冠", @"Icon-魔法护手", @"Icon-魔法长靴", @"Icon-魔法铠甲上装", @"Icon-魔法铠甲下装"],\
										@[@"Icon-占山头带", @"Icon-占山手套", @"Icon-占山长靴", @"Icon-占山链甲", @"Icon-占山裤子"],\
										@[@"Icon-黑钢护额", @"Icon-黑钢护手", @"Icon-黑钢长靴", @"Icon-黑钢铠甲上装", @"Icon-黑钢铠甲下装"],\
										@[@"Icon-白金头盔", @"Icon-白金护手", @"Icon-白金长靴", @"Icon-白金铠甲上装", @"Icon-白金铠甲下装"],\
										@[@"Icon-玄武头盔", @"Icon-玄武腕带", @"Icon-玄武鞋", @"Icon-玄武道衣上装", @"Icon-玄武道衣下装"],\
										@[@"Icon-古强者头盔", @"Icon-古强者护手", @"Icon-古强者长靴", @"Icon-古强者铠甲下装", @"Icon-古强者铠甲上装"],\
										@[@"Icon-沉重头盔", @"Icon-沉重手套", @"Icon-沉重长靴", @"Icon-沉重护甲下装", @"Icon-沉重护甲上装"],\
										@[@"Icon-亡灵头巾", @"Icon-亡灵护臂", @"Icon-亡灵长靴", @"Icon-亡灵披风"],\
										@[@"Icon-刀刃护额", @"Icon-刀刃铠甲上装", @"Icon-刀刃铠甲下装", @"Icon-刀刃护手", @"Icon-刀刃长靴"],\
										@[@"Icon-战斗头冠", @"Icon-战斗护手", @"Icon-战斗衣服上装", @"Icon-战斗衣服下装", @"Icon-战斗长靴"],\
										@[@"Icon-哥特礼帽", @"Icon-哥特帽", @"Icon-哥特手套", @"Icon-哥特护手", @"Icon-哥特长筒袜", @"Icon-哥特长靴", @"Icon-哥特裙", @"Icon-哥特外衣上装", @"Icon-哥特胸衣", @"Icon-哥特外衣下装"],\
										@[@"Icon-师团长头盔", @"Icon-师团长护手", @"Icon-师团长长靴", @"Icon-师团长铠甲上装", @"Icon-师团长铠甲下装"],\
										@[@"Icon-僧兵之冠", @"Icon-僧兵衣服上装", @"Icon-僧兵衣服下装", @"Icon-僧兵手套", @"Icon-僧兵鞋"],\
										@[@"Icon-贵族帽", @"Icon-贵族外衣上装", @"Icon-贵族外衣下装", @"Icon-贵族手套", @"Icon-贵族长靴"],\
										@[@"Icon-野蛮贝雷帽", @"Icon-野蛮上衣", @"Icon-野蛮下装", @"Icon-野蛮手镯", @"Icon-野蛮鞋"],\
										@[@"Icon-突刺头盔", @"Icon-突刺铠甲上装", @"Icon-突刺铠甲下装", @"Icon-突刺手套", @"Icon-突刺长靴"],\
										@[@"Icon-假面舞会头盔", @"Icon-假面舞会礼服", @"Icon-假面舞会手套", @"Icon-假面舞会长靴"],\
										@[@"Icon-飞龙头盔", @"Icon-飞龙上衣", @"Icon-飞龙长裤", @"Icon-飞龙手套", @"Icon-飞龙长靴"],\
										@[@"Icon-圣骑士头盔", @"Icon-圣骑士铠甲上装", @"Icon-圣骑士铠甲下装", @"Icon-圣骑士护手", @"Icon-圣骑士长靴"],\
										@[@"Icon-神兵头盔", @"Icon-神兵铠甲上装", @"Icon-神兵铠甲下装", @"Icon-神兵护手", @"Icon-神兵长靴"],\
										@[@"Icon-伟大头盔", @"Icon-伟大披风", @"Icon-伟大手套", @"Icon-伟大长靴"],\
										@[@"Icon-流浪帽", @"Icon-流浪外衣上装", @"Icon-流浪外衣下装", @"Icon-流浪护臂", @"Icon-流浪鞋"],\
										@[@"Icon-王军师头盔", @"Icon-王军师手套", @"Icon-王军师铠甲", @"Icon-王军师长靴"],\
										@[@"Icon-机械兜帽", @"Icon-机械衣服上装", @"Icon-机械衣服下装", @"Icon-机械护手", @"Icon-机械靴"],\
										@[@"Icon-血红头盔", @"Icon-血红铠甲上装", @"Icon-血红铠甲下装", @"Icon-血红手套", @"Icon-血红长靴"],\
										@[@"Icon-凯歌头盔", @"Icon-凯歌铠甲上装", @"Icon-凯歌铠甲下装", @"Icon-凯歌护手", @"Icon-凯歌长靴"],\
										@[@"Icon-毒蛇帽", @"Icon-毒蛇外衣", @"Icon-毒蛇手套", @"Icon-毒蛇长靴"]]
//道具锻造－道具配方
#define RECIPT_SECTION3_1               @[@"锻造锤", @"裁缝针", @"木工刀", @"炼金油灯", @"炼金壶", @"平底锅"]
#define RECIPT_SECTION3_1_SUB			@[@[@"铜制锻造锤", @"铁制锻造锤", @"七夕锻造锤", @"星之锻造锤", @"银制锻造锤", @"银制小锻造锤", @"白金锻造锤", @"白金小锻造锤", @"超级小锻造锤", @"超级锻造锤", @"奇迹锻造锤", @"奇迹小锻造锤"],\
										@[@"铜制木工刀", @"铁制木工刀", @"七夕木工刀", @"星之木工刀", @"银制木工刀", @"银制小木工刀", @"白金木工刀", @"白金小木工刀", @"超级小木工刀", @"超级木工刀", @"奇迹木工刀", @"奇迹小木工刀"],\
										@[@"铜制裁缝针", @"铁制裁缝针", @"七夕裁缝针", @"星之裁缝针", @"银制裁缝针", @"银制小裁缝针", @"白金裁缝针", @"白金小裁缝针", @"超级小裁缝针", @"超级裁缝针", @"奇迹裁缝针", @"奇迹小裁缝针"],\
										@[@"铜制炼金油灯", @"铁制炼金油灯", @"七夕炼金油灯", @"星之炼金油灯", @"银制炼金油灯", @"银制小炼金油灯", @"白金炼金油灯", @"白金小炼金油灯", @"超级小炼金油灯", @"超级炼金油灯", @"奇迹炼金油灯", @"奇迹小炼金油灯"],\
										@[@"铜制炼金壶", @"铁制炼金壶", @"七夕炼金壶", @"星之炼金壶", @"银制炼金壶", @"银制小炼金壶", @"白金炼金壶", @"白金小炼金壶", @"超级小炼金壶", @"超级炼金壶", @"奇迹炼金壶", @"奇迹小炼金壶"],\
										@[@"星之煎锅", @"铁制平底锅", @"铜制平底锅", @"银制平底锅", @"银制小平底锅", @"白金小平底锅", @"白金平底锅", @"超级小平底锅", @"超级平底锅", @"奇迹平底锅", @"奇迹小平底锅"]]
#define RECIPT_SECTION3_1_SUB_IMAGE		@[@[@"Icon-铜制锻造锤", @"Icon-铁制锻造锤", @"Icon-七夕锻造锤", @"Icon-星之锻造锤", @"Icon-银制锻造锤", @"Icon-银制小锻造锤", @"Icon-白金锻造锤", @"Icon-白金小锻造锤", @"Icon-超级小锻造锤", @"Icon-超级锻造锤", @"Icon-奇迹锻造锤", @"Icon-奇迹小锻造锤"],\
										@[@"Icon-铜制木工刀", @"Icon-铁制木工刀", @"Icon-七夕木工刀", @"Icon-星之木工刀", @"Icon-银制木工刀", @"Icon-银制小木工刀", @"Icon-白金木工刀", @"Icon-白金小木工刀", @"Icon-超级小木工刀", @"Icon-超级木工刀", @"Icon-奇迹木工刀", @"Icon-奇迹小木工刀"],\
										@[@"Icon-铜制裁缝针", @"Icon-铁制裁缝针", @"Icon-七夕裁缝针", @"Icon-星之裁缝针", @"Icon-银制裁缝针", @"Icon-银制小裁缝针", @"Icon-白金裁缝针", @"Icon-白金小裁缝针", @"Icon-超级小裁缝针", @"Icon-超级裁缝针", @"Icon-奇迹裁缝针", @"Icon-奇迹小裁缝针"],\
										@[@"Icon-铜制炼金油灯", @"Icon-铁制炼金油灯", @"Icon-七夕炼金油灯", @"Icon-星之炼金油灯", @"Icon-银制炼金油灯", @"Icon-银制小炼金油灯", @"Icon-白金炼金油灯", @"Icon-白金小炼金油灯", @"Icon-超级小炼金油灯", @"Icon-超级炼金油灯", @"Icon-奇迹炼金油灯", @"Icon-奇迹小炼金油灯"],\
										@[@"Icon-铜制炼金壶", @"Icon-铁制炼金壶", @"Icon-七夕炼金壶", @"Icon-星之炼金壶", @"Icon-银制炼金壶", @"Icon-银制小炼金壶", @"Icon-白金炼金壶", @"Icon-白金小炼金壶", @"Icon-超级小炼金壶", @"Icon-超级炼金壶", @"Icon-奇迹炼金壶", @"Icon-奇迹小炼金壶"],\
										@[@"Icon-星之煎锅", @"Icon-铁制平底锅", @"Icon-铜制平底锅", @"Icon-银制平底锅", @"Icon-银制小平底锅", @"Icon-白金小平底锅", @"Icon-白金平底锅", @"Icon-超级小平底锅", @"Icon-超级平底锅", @"Icon-奇迹平底锅", @"Icon-奇迹小平底锅"]]
//道具锻造－家具配方
#define RECIPT_SECTION3_2               @[@"家具配方"]
#define RECIPT_SECTION3_2_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION3_2_SUB_IMAGE		@[@[@""]]
//道具锻造－庭具配方
#define RECIPT_SECTION3_3               @[@"庭具配方"]
#define RECIPT_SECTION3_3_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION3_3_SUB_IMAGE		@[@[@""]]
//道具锻造－素材配方
#define RECIPT_SECTION3_4               @[@"素材配方"]
#define RECIPT_SECTION3_4_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION3_4_SUB_IMAGE		@[@[@""]]
//木工－武器配方
#define RECIPT_SECTION4_1               @[@"短杖", @"双手杖", @"棍", @"扇", @"弓"]
#define RECIPT_SECTION4_1_SUB			@[@[@"别针短杖", @"鲜花短杖", @"史莱姆短杖", @"闪耀之杖", @"魔萌短杖", @"爱心短杖", @"繁星之杖", @"羽翼短杖", @"史莱姆塔杖", @"魔笛短杖", @"魔力短杖", @"马波雷纳杖", @"棒棒糖杖", @"阳伞短杖", @"龙之短杖", @"天使杖", @"世界树之杖", @"恶魔杖", @"哥特阳伞", @"泰塔尼亚杖", @"圣王之短杖", @"光之杖", @"梦想短杖", @"圣人之泪"],\
										@[@"魔导士法杖", @"制裁法杖", @"雨云法杖", @"封魔法杖", @"海鸣法杖", @"雷鸣法杖", @"妖精法杖", @"比奥拉法杖", @"符文法杖", @"岩浆法杖", @"精灵法杖", @"魔眼法杖", @"冰之法杖", @"塞壬法杖", @"弧形法杖", @"福音法杖", @"贤者法杖", @"神法杖", @"龙之法杖", @"圣王之法杖", @"光之法杖", @"彩虹法杖", @"不死者魔杖"],\
										@[@"天秤棍", @"橡木棍", @"行者之棍", @"六角棍", @"演武之棍", @"突刺棍", @"仪式棍", @"浅眠之棍", @"碾压之棍", @"落雨棍", @"罗刹之棍", @"狼牙棒", @"夜叉之棍", @"龙棍", @"日轮之棍", @"悲叹之棍", @"白蛇之棍", @"修罗之棍", @"神龙棍", @"圣王之棍", @"阴阳道之棍", @"恶魔棍", @"默示棍"],\
										@[@"羽扇", @"战斗扇", @"铁扇", @"龟之扇", @"鸟之扇", @"猫猫扇", @"七夕扇", @"七星扇", @"孔雀之扇", @"蛇之扇", @"星之扇", @"魔法扇", @"魔性扇", @"月之扇", @"彩虹之扇", @"太阳之扇", @"芭蕉扇", @"天下太平", @"必杀之扇", @"风林火山", @"圣王之扇", @"万花视界", @"青岚之扇", @"春紫菀"],\
										@[@"古木之弓", @"新木弓", @"爱神之弓", @"猎人之弓", @"紫檀弓", @"长弓", @"青竹弓", @"小恶魔之弓", @"风斩之弓", @"诱惑之弓", @"白鸟弓", @"月光之弓", @"无限弓", @"暗夜狙击手", @"朱雀弓", @"喀戎之弓", @"阿尔忒弥斯之弓", @"翼蜥之弓", @"地狱之弓", @"天使之弓", @"圣王之弓", @"奥丁之弓", @"双头蛇", @"俄耳甫斯之弓"]]
#define RECIPT_SECTION4_1_SUB_IMAGE		@[@[@"Icon-别针短杖", @"Icon-鲜花短杖", @"Icon-史莱姆短杖", @"Icon-闪耀之杖", @"Icon-魔萌短杖", @"Icon-爱心短杖", @"Icon-繁星之杖", @"Icon-羽翼短杖", @"Icon-史莱姆塔杖", @"Icon-魔笛短杖", @"Icon-魔力短杖", @"Icon-马波雷纳杖", @"Icon-棒棒糖杖", @"Icon-阳伞短杖", @"Icon-龙之短杖", @"Icon-天使杖", @"Icon-世界树之杖", @"Icon-恶魔杖", @"Icon-哥特阳伞", @"Icon-泰塔尼亚杖", @"Icon-圣王之短杖", @"Icon-光之杖", @"Icon-梦想短杖", @"Icon-圣人之泪"],\
										@[@"Icon-魔导士法杖", @"Icon-制裁法杖", @"Icon-雨云法杖", @"Icon-封魔法杖", @"Icon-海鸣法杖", @"Icon-雷鸣法杖", @"Icon-妖精法杖", @"Icon-比奥拉法杖", @"Icon-符文法杖", @"Icon-岩浆法杖", @"Icon-精灵法杖", @"Icon-魔眼法杖", @"Icon-冰之法杖", @"Icon-塞壬法杖", @"Icon-弧形法杖", @"Icon-福音法杖", @"Icon-贤者法杖", @"Icon-神法杖", @"Icon-龙之法杖", @"Icon-圣王之法杖", @"Icon-光之法杖", @"Icon-彩虹法杖", @"Icon-不死者魔杖"],\
										@[@"Icon-天秤棍", @"Icon-橡木棍", @"Icon-行者之棍", @"Icon-六角棍", @"Icon-演武之棍", @"Icon-突刺棍", @"Icon-仪式棍", @"Icon-浅眠之棍", @"Icon-碾压之棍", @"Icon-落雨棍", @"Icon-罗刹之棍", @"Icon-狼牙棒", @"Icon-夜叉之棍", @"Icon-龙棍", @"Icon-日轮之棍", @"Icon-悲叹之棍", @"Icon-白蛇之棍", @"Icon-修罗之棍", @"Icon-神龙棍", @"Icon-圣王之棍", @"Icon-阴阳道之棍", @"Icon-恶魔棍", @"Icon-默示棍"],\
										@[@"Icon-羽扇", @"Icon-战斗扇", @"Icon-铁扇", @"Icon-龟之扇", @"Icon-鸟之扇", @"Icon-猫猫扇", @"Icon-七夕扇", @"Icon-七星扇", @"Icon-孔雀之扇", @"Icon-蛇之扇", @"Icon-星之扇", @"Icon-魔法扇", @"Icon-魔性扇", @"Icon-月之扇", @"Icon-彩虹之扇", @"Icon-太阳之扇", @"Icon-芭蕉扇", @"Icon-天下太平", @"Icon-必杀之扇", @"Icon-风林火山", @"Icon-圣王之扇", @"Icon-万花视界", @"Icon-青岚之扇", @"Icon-春紫菀"],\
										@[@"Icon-古木之弓", @"Icon-新木弓", @"Icon-爱神之弓", @"Icon-猎人之弓", @"Icon-紫檀弓", @"Icon-长弓", @"Icon-青竹弓", @"Icon-小恶魔之弓", @"Icon-风斩之弓", @"Icon-诱惑之弓", @"Icon-白鸟弓", @"Icon-月光之弓", @"Icon-无限弓", @"Icon-暗夜狙击手", @"Icon-朱雀弓", @"Icon-喀戎之弓", @"Icon-阿尔忒弥斯之弓", @"Icon-翼蜥之弓", @"Icon-地狱之弓", @"Icon-天使之弓", @"Icon-圣王之弓", @"Icon-奥丁之弓", @"Icon-双头蛇", @"Icon-俄耳甫斯之弓"]]
//木工－家具配方
#define RECIPT_SECTION4_2               @[@"椅子", @"桌子", @"柜台", @"柜子", @"收纳柜", @"床", @"厨台", @"烤炉", @"浴盆", @"暖炉", @"架子", @"隔断", @"其他"]
#define RECIPT_SECTION4_2_SUB			@[@[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"]]
#define RECIPT_SECTION4_2_SUB_IMAGE		@[@[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""]]
//木工－庭具配方
#define RECIPT_SECTION4_3               @[@"庭具配方"]
#define RECIPT_SECTION4_3_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION4_3_SUB_IMAGE		@[@[@""]]
//木工－钓竿配方
#define RECIPT_SECTION4_4               @[@"钓竿配方"]
#define RECIPT_SECTION4_4_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION4_4_SUB_IMAGE		@[@[@""]]
//裁缝－防具配方
#define RECIPT_SECTION5_1               @[@"裁缝入门", @"暖场艺人", @"新手艺人", @"剪柳", @"治愈", @"射手", @"丝织", @"藏红花", @"药师", @"初级魔法战士", @"修炼", @"舞者", @"闪避", @"学者", @"疾风", @"魔术师", @"功夫", @"树叶", @"斗牛士", @"咒术师", @"守护", @"西部", @"神官", @"森人", @"拳法", @"讲述者", @"魔导士", @"祭司", @"神圣", @"水之羽衣", @"击剑士", @"奇术师", @"混混", @"占星术士", @"圣者", @"真理", @"知识", @"大师", @"财宝", @"月之长袍", @"原始兽", @"拳圣", @"摩登兔", @"王宫魔术师", @"小丑", @"古代魔术", @"奇迹", @"古武道", @"大魔导", @"大贤者", @"追击者", @"偶像", @"求道者", @"作曲家", @"领悟", @"台风", @"羊之衣", @"舞台", @"暗鸦", @"退魔", @"古代王族", @"圣贤者", @"黄龙"]
#define RECIPT_SECTION5_1_SUB			@[@[@"皮帽", @"亚麻短裤", @"亚麻帽", @"皮手套", @"皮铠", @"亚麻手套", @"亚麻衣服", @"皮鞋", @"皮裤", @"亚麻鞋"],\
										@[@"暖场艺人方头巾", @"暖场艺人手环", @"暖场艺人衣服", @"暖场艺人长靴", @"暖场艺人长裤"],\
										@[@"新手艺人方头巾", @"新手艺人长靴", @"新手艺人长裤", @"新手艺人手套", @"新手艺人的衣服"],\
										@[@"剪柳头巾", @"剪柳鞋", @"剪柳紧身裤", @"剪柳手环", @"剪柳衣服"],\
										@[@"治愈帽", @"治愈长靴", @"治愈长裤", @"治愈衣服"],\
										@[@"射手帽", @"射手鞋", @"射手紧身裤", @"射手手套", @"射手衣服"],\
										@[@"丝织帽", @"丝织凉鞋", @"丝织长袍下装", @"丝织长袍上装"],\
										@[@"藏红花帽", @"藏红花长靴", @"藏红花长袍下装", @"藏红花手套", @"藏红花长袍上装"],\
										@[@"药师帽", @"药师鞋", @"药师长袍下装", @"药师长袍上装"],\
										@[@"初级魔法战士贝雷帽", @"初级魔法战士鞋", @"初级魔法战士紧身裤", @"初级魔法战士手套", @"初级魔法战士服"],\
										@[@"修炼头带", @"修炼长靴", @"修炼服下装", @"修炼护腕", @"修炼服上装"],\
										@[@"舞者头带", @"舞者鞋", @"舞者喇叭裤", @"舞者护腕", @"舞者衬衫"],\
										@[@"闪避帽", @"闪避之靴", @"闪避之衣下装", @"闪避之衣上装"],\
										@[@"学者帽", @"学者脚带", @"学者衣服下装", @"学者衣服上装"],\
										@[@"疾风头巾", @"疾风手套", @"疾风背心", @"疾风长靴", @"疾风马裤"],\
										@[@"魔术师头带", @"魔术师短靴", @"魔术师紧身裤", @"魔术师手套", @"魔术师衣服"],\
										@[@"功夫小帽", @"功夫鞋", @"功夫长裤", @"功夫护腕", @"功夫上衣"],\
										@[@"树叶帽", @"树叶长靴", @"树叶铠甲下装", @"树叶手环", @"树叶铠甲上装"],\
										@[@"斗牛士头带", @"斗牛士鞋", @"斗牛士衣服下装", @"斗牛士衣服上装", @"斗牛士手套"],\
										@[@"咒术师长头巾", @"咒术师鞋", @"咒术师长袍下装", @"咒术师长袍上装"],\
										@[@"守护帽", @"守护鞋", @"守护长袍"],\
										@[@"西部帽", @"西部长靴", @"西部短裤", @"西部手套", @"西部衬衫"],\
										@[@"神官帽", @"神官鞋", @"神官法衣下装", @"神官手套", @"神官法衣上装"],\
										@[@"森人帽", @"森人长靴", @"森人围裙", @"森人手套", @"森人背心"],\
										@[@"拳法脚带", @"拳法衣服下装", @"拳法腕带", @"拳法衣服上装"],\
										@[@"讲述者帽", @"讲述者长靴", @"讲述者衣服下装", @"讲述者手套", @"讲述者衣服上装"],\
										@[@"魔导士帽", @"魔导士鞋", @"魔导士衣服下装", @"魔导士衣服上装"],\
										@[@"祭司帽", @"祭司长靴", @"祭司手套", @"祭司法衣"],\
										@[@"神圣帽", @"神圣长靴", @"神圣长袍下装", @"神圣长袍上装"],\
										@[@"水之冠", @"水之脚带", @"水之羽衣下装", @"水之羽衣上装"],\
										@[@"击剑士帽", @"击剑士长靴", @"击剑士手环", @"击剑士披风"],\
										@[@"奇术师帽", @"奇术师长靴", @"奇术师裤子", @"奇术师手套", @"奇术师衣服"],\
										@[@"混混方头巾", @"混混背心", @"混混裤子", @"混混手环", @"混混长靴"],\
										@[@"占星术士长头巾", @"占星术士长靴", @"占星术士长袍下装", @"占星术士长袍上装"],\
										@[@"圣者帽", @"圣者手套", @"圣者长靴", @"圣者法衣"],\
										@[@"真理帽", @"真理长袍上装", @"真理长袍下装", @"真理鞋"],\
										@[@"知识帽子", @"知识凉鞋", @"知识长袍下装", @"知识长袍上装"],\
										@[@"大师帽", @"大师马甲", @"大师长裤", @"大师护腕", @"大师鞋"],\
										@[@"财宝帽", @"财宝手套", @"财宝长靴", @"财宝外衣下装", @"财宝外衣上装"],\
										@[@"月之冠", @"月之鞋", @"月之长袍上装", @"月之长袍下装"],\
										@[@"原始兽毛皮帽", @"原始兽长靴", @"原始兽外衣上装", @"原始兽外衣下装", @"原始兽手套"],\
										@[@"拳圣长头巾", @"拳圣鞋", @"拳圣道衣上装", @"拳圣道衣下装", @"拳圣手环"],\
										@[@"摩登兔发饰", @"摩登兔鞋", @"摩登兔上衣", @"摩登兔紧身裤", @"摩登兔荷叶裙", @"摩登兔手镯"],\
										@[@"王宫魔术师帽", @"王宫魔术师长袍上装", @"王宫魔术师长袍下装", @"王宫魔术师鞋"],\
										@[@"小丑帽", @"小丑背心", @"小丑长裤", @"小丑手套", @"小丑鞋"],\
										@[@"古代魔术帽", @"古代魔术手环", @"古代魔术法衣上装", @"古代魔术法衣下装", @"古代魔术长靴"],\
										@[@"奇迹帽", @"奇迹外衣上装", @"奇迹外衣下装", @"奇迹手套", @"奇迹靴子"],\
										@[@"古武道头巾", @"古武道衣服上装", @"古武道衣服下装", @"古武道手环", @"古武道长靴"],\
										@[@"大魔导帽", @"大魔导长袍上装", @"大魔导长袍下装", @"大魔导手环", @"大魔导鞋"],\
										@[@"大贤者僧帽", @"大贤者法衣", @"大贤者手套", @"大贤者鞋"],\
										@[@"追击者头带", @"追击者皮衣上装", @"追击者皮衣下装", @"追击者护手", @"追击者长靴"],\
										@[@"偶像头带", @"偶像衣服上装", @"偶像衣服下装", @"偶像手镯", @"偶像长靴"],\
										@[@"求道者头带", @"求道者道衣上装", @"求道者道衣下装", @"求道者手套", @"求道者长靴"],\
										@[@"作曲家头带", @"作曲家衣服上装", @"作曲家衣服下装", @"作曲家手镯", @"作曲家脚带"],\
										@[@"领悟头冠", @"领悟衣服", @"领悟手套", @"领悟长靴"],\
										@[@"台风护目镜", @"台风皮衣上装", @"台风皮衣下装", @"台风手套", @"台风长靴"],\
										@[@"羊之兜帽", @"羊之衣上装", @"羊之衣下装", @"羊之手套", @"羊之鞋"],\
										@[@"舞台头带", @"舞台芭蕾裙下装", @"舞台缎带", @"舞台护腕", @"舞台上衣", @"舞台护臂", @"舞台芭蕾裙上装", @"舞台鞋", @"舞台短裤", @"舞台长靴"],\
										@[@"暗鸦帽", @"暗鸦战衣", @"暗鸦护手", @"暗鸦靴"],\
										@[@"退魔帽", @"退魔法衣上装", @"退魔法衣下装", @"退魔手环", @"退魔鞋"],\
										@[@"古代王族长头巾", @"古代王族背心", @"古代王族裤子", @"古代王族护臂", @"古代王族靴"],\
										@[@"圣贤者僧帽", @"圣贤者长袍上装", @"圣贤者长袍下装", @"圣贤者护臂", @"圣贤者鞋"],\
										@[@"黄龙头带", @"黄龙手环", @"黄龙道衣", @"黄龙鞋"]]
#define RECIPT_SECTION5_1_SUB_IMAGE		@[@[@"Icon-皮帽", @"Icon-亚麻短裤", @"Icon-亚麻帽", @"Icon-皮手套", @"Icon-皮铠", @"Icon-亚麻手套", @"Icon-亚麻衣服", @"Icon-皮鞋", @"Icon-皮裤", @"Icon-亚麻鞋"],\
										@[@"Icon-暖场艺人方头巾", @"Icon-暖场艺人手环", @"Icon-暖场艺人衣服", @"Icon-暖场艺人长靴", @"Icon-暖场艺人长裤"],\
										@[@"Icon-新手艺人方头巾", @"Icon-新手艺人长靴", @"Icon-新手艺人长裤", @"Icon-新手艺人手套", @"Icon-新手艺人的衣服"],\
										@[@"Icon-剪柳头巾", @"Icon-剪柳鞋", @"Icon-剪柳紧身裤", @"Icon-剪柳手环", @"Icon-剪柳衣服"],\
										@[@"Icon-治愈帽", @"Icon-治愈长靴", @"Icon-治愈长裤", @"Icon-治愈衣服"],\
										@[@"Icon-射手帽", @"Icon-射手鞋", @"Icon-射手紧身裤", @"Icon-射手手套", @"Icon-射手衣服"],\
										@[@"Icon-丝织帽", @"Icon-丝织凉鞋", @"Icon-丝织长袍下装", @"Icon-丝织长袍上装"],\
										@[@"Icon-藏红花帽", @"Icon-藏红花长靴", @"Icon-藏红花长袍下装", @"Icon-藏红花手套", @"Icon-藏红花长袍上装"],\
										@[@"Icon-药师帽", @"Icon-药师鞋", @"Icon-药师长袍下装", @"Icon-药师长袍上装"],\
										@[@"Icon-初级魔法战士贝雷帽", @"Icon-初级魔法战士鞋", @"Icon-初级魔法战士紧身裤", @"Icon-初级魔法战士手套", @"Icon-初级魔法战士服"],\
										@[@"Icon-修炼头带", @"Icon-修炼长靴", @"Icon-修炼服下装", @"Icon-修炼护腕", @"Icon-修炼服上装"],\
										@[@"Icon-舞者头带", @"Icon-舞者鞋", @"Icon-舞者喇叭裤", @"Icon-舞者护腕", @"Icon-舞者衬衫"],\
										@[@"Icon-闪避帽", @"Icon-闪避之靴", @"Icon-闪避之衣下装", @"Icon-闪避之衣上装"],\
										@[@"Icon-学者帽", @"Icon-学者脚带", @"Icon-学者衣服下装", @"Icon-学者衣服上装"],\
										@[@"Icon-疾风头巾", @"Icon-疾风手套", @"Icon-疾风背心", @"Icon-疾风长靴", @"Icon-疾风马裤"],\
										@[@"Icon-魔术师头带", @"Icon-魔术师短靴", @"Icon-魔术师紧身裤", @"Icon-魔术师手套", @"Icon-魔术师衣服"],\
										@[@"Icon-功夫小帽", @"Icon-功夫鞋", @"Icon-功夫长裤", @"Icon-功夫护腕", @"Icon-功夫上衣"],\
										@[@"Icon-树叶帽", @"Icon-树叶长靴", @"Icon-树叶铠甲下装", @"Icon-树叶手环", @"Icon-树叶铠甲上装"],\
										@[@"Icon-斗牛士头带", @"Icon-斗牛士鞋", @"Icon-斗牛士衣服下装", @"Icon-斗牛士衣服上装", @"Icon-斗牛士手套"],\
										@[@"Icon-咒术师长头巾", @"Icon-咒术师鞋", @"Icon-咒术师长袍下装", @"Icon-咒术师长袍上装"],\
										@[@"Icon-守护帽", @"Icon-守护鞋", @"Icon-守护长袍"],\
										@[@"Icon-西部帽", @"Icon-西部长靴", @"Icon-西部短裤", @"Icon-西部手套", @"Icon-西部衬衫"],\
										@[@"Icon-神官帽", @"Icon-神官鞋", @"Icon-神官法衣下装", @"Icon-神官手套", @"Icon-神官法衣上装"],\
										@[@"Icon-森人帽", @"Icon-森人长靴", @"Icon-森人围裙", @"Icon-森人手套", @"Icon-森人背心"],\
										@[@"Icon-拳法脚带", @"Icon-拳法衣服下装", @"Icon-拳法腕带", @"Icon-拳法衣服上装"],\
										@[@"Icon-讲述者帽", @"Icon-讲述者长靴", @"Icon-讲述者衣服下装", @"Icon-讲述者手套", @"Icon-讲述者衣服上装"],\
										@[@"Icon-魔导士帽", @"Icon-魔导士鞋", @"Icon-魔导士衣服下装", @"Icon-魔导士衣服上装"],\
										@[@"Icon-祭司帽", @"Icon-祭司长靴", @"Icon-祭司手套", @"Icon-祭司法衣"],\
										@[@"Icon-神圣帽", @"Icon-神圣长靴", @"Icon-神圣长袍下装", @"Icon-神圣长袍上装"],\
										@[@"Icon-水之冠", @"Icon-水之脚带", @"Icon-水之羽衣下装", @"Icon-水之羽衣上装"],\
										@[@"Icon-击剑士帽", @"Icon-击剑士长靴", @"Icon-击剑士手环", @"Icon-击剑士披风"],\
										@[@"Icon-奇术师帽", @"Icon-奇术师长靴", @"Icon-奇术师裤子", @"Icon-奇术师手套", @"Icon-奇术师衣服"],\
										@[@"Icon-混混方头巾", @"Icon-混混背心", @"Icon-混混裤子", @"Icon-混混手环", @"Icon-混混长靴"],\
										@[@"Icon-占星术士长头巾", @"Icon-占星术士长靴", @"Icon-占星术士长袍下装", @"Icon-占星术士长袍上装"],\
										@[@"Icon-圣者帽", @"Icon-圣者手套", @"Icon-圣者长靴", @"Icon-圣者法衣"],\
										@[@"Icon-真理帽", @"Icon-真理长袍上装", @"Icon-真理长袍下装", @"Icon-真理鞋"],\
										@[@"Icon-知识帽子", @"Icon-知识凉鞋", @"Icon-知识长袍下装", @"Icon-知识长袍上装"],\
										@[@"Icon-大师帽", @"Icon-大师马甲", @"Icon-大师长裤", @"Icon-大师护腕", @"Icon-大师鞋"],\
										@[@"Icon-财宝帽", @"Icon-财宝手套", @"Icon-财宝长靴", @"Icon-财宝外衣下装", @"Icon-财宝外衣上装"],\
										@[@"Icon-月之冠", @"Icon-月之鞋", @"Icon-月之长袍上装", @"Icon-月之长袍下装"],\
										@[@"Icon-原始兽毛皮帽", @"Icon-原始兽长靴", @"Icon-原始兽外衣上装", @"Icon-原始兽外衣下装", @"Icon-原始兽手套"],\
										@[@"Icon-拳圣长头巾", @"Icon-拳圣鞋", @"Icon-拳圣道衣上装", @"Icon-拳圣道衣下装", @"Icon-拳圣手环"],\
										@[@"Icon-摩登兔发饰", @"Icon-摩登兔鞋", @"Icon-摩登兔上衣", @"Icon-摩登兔紧身裤", @"Icon-摩登兔荷叶裙", @"Icon-摩登兔手镯"],\
										@[@"Icon-王宫魔术师帽", @"Icon-王宫魔术师长袍上装", @"Icon-王宫魔术师长袍下装", @"Icon-王宫魔术师鞋"],\
										@[@"Icon-小丑帽", @"Icon-小丑背心", @"Icon-小丑长裤", @"Icon-小丑手套", @"Icon-小丑鞋"],\
										@[@"Icon-古代魔术帽", @"Icon-古代魔术手环", @"Icon-古代魔术法衣上装", @"Icon-古代魔术法衣下装", @"Icon-古代魔术长靴"],\
										@[@"Icon-奇迹帽", @"Icon-奇迹外衣上装", @"Icon-奇迹外衣下装", @"Icon-奇迹手套", @"Icon-奇迹靴子"],\
										@[@"Icon-古武道头巾", @"Icon-古武道衣服上装", @"Icon-古武道衣服下装", @"Icon-古武道手环", @"Icon-古武道长靴"],\
										@[@"Icon-大魔导帽", @"Icon-大魔导长袍上装", @"Icon-大魔导长袍下装", @"Icon-大魔导手环", @"Icon-大魔导鞋"],\
										@[@"Icon-大贤者僧帽", @"Icon-大贤者法衣", @"Icon-大贤者手套", @"Icon-大贤者鞋"],\
										@[@"Icon-追击者头带", @"Icon-追击者皮衣上装", @"Icon-追击者皮衣下装", @"Icon-追击者护手", @"Icon-追击者长靴"],\
										@[@"Icon-偶像头带", @"Icon-偶像衣服上装", @"Icon-偶像衣服下装", @"Icon-偶像手镯", @"Icon-偶像长靴"],\
										@[@"Icon-求道者头带", @"Icon-求道者道衣上装", @"Icon-求道者道衣下装", @"Icon-求道者手套", @"Icon-求道者长靴"],\
										@[@"Icon-作曲家头带", @"Icon-作曲家衣服上装", @"Icon-作曲家衣服下装", @"Icon-作曲家手镯", @"Icon-作曲家脚带"],\
										@[@"Icon-领悟头冠", @"Icon-领悟衣服", @"Icon-领悟手套", @"Icon-领悟长靴"],\
										@[@"Icon-台风护目镜", @"Icon-台风皮衣上装", @"Icon-台风皮衣下装", @"Icon-台风手套", @"Icon-台风长靴"],\
										@[@"Icon-羊之兜帽", @"Icon-羊之衣上装", @"Icon-羊之衣下装", @"Icon-羊之手套", @"Icon-羊之鞋"],\
										@[@"Icon-舞台头带", @"Icon-舞台芭蕾裙下装", @"Icon-舞台缎带", @"Icon-舞台护腕", @"Icon-舞台上衣", @"Icon-舞台护臂", @"Icon-舞台芭蕾裙上装", @"Icon-舞台鞋", @"Icon-舞台短裤", @"Icon-舞台长靴"],\
										@[@"Icon-暗鸦帽", @"Icon-暗鸦战衣", @"Icon-暗鸦护手", @"Icon-暗鸦靴"],\
										@[@"Icon-退魔帽", @"Icon-退魔法衣上装", @"Icon-退魔法衣下装", @"Icon-退魔手环", @"Icon-退魔鞋"],\
										@[@"Icon-古代王族长头巾", @"Icon-古代王族背心", @"Icon-古代王族裤子", @"Icon-古代王族护臂", @"Icon-古代王族靴"],\
										@[@"Icon-圣贤者僧帽", @"Icon-圣贤者长袍上装", @"Icon-圣贤者长袍下装", @"Icon-圣贤者护臂", @"Icon-圣贤者鞋"],\
										@[@"Icon-黄龙头带", @"Icon-黄龙手环", @"Icon-黄龙道衣", @"Icon-黄龙鞋"]]
//裁缝－家具配方
#define RECIPT_SECTION5_2               @[@"家具配方"]
#define RECIPT_SECTION5_2_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION5_2_SUB_IMAGE		@[@[@""]]
//烹饪－肉料理配方
#define RECIPT_SECTION6_1               @[@"肉料理配方"]
#define RECIPT_SECTION6_1_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION6_1_SUB_IMAGE		@[@[@""]]
//烹饪－鱼料理配方
#define RECIPT_SECTION6_2               @[@"鱼料理配方"]
#define RECIPT_SECTION6_2_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION6_2_SUB_IMAGE		@[@[@""]]
//烹饪－意面和米饭配方
#define RECIPT_SECTION6_3               @[@"意面和米饭配方"]
#define RECIPT_SECTION6_3_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION6_3_SUB_IMAGE		@[@[@""]]
//烹饪－甜点配方
#define RECIPT_SECTION6_4               @[@"甜点配方"]
#define RECIPT_SECTION6_4_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION6_4_SUB_IMAGE		@[@[@""]]

#endif /* Macros_h */
