//
//  Macros.h
//  dqxRecipe
//
//  Created by HANSHAOWEN on 16/11/23.
//  Copyright © 2016年 mengyoutu.cn. All rights reserved.
//

#ifndef Macros_h
#define Macros_h

#pragma mark - UI / 屏幕、控件尺寸

#define kKeyWindow [UIApplication sharedApplication].keyWindow

#define isRetina                  ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(640, 960), [[UIScreen mainScreen] currentMode].size) : NO)
#define isPad                     (UI_USER_INTERFACE_IDIOM() == UIUserInterfaceIdiomPad)
#define BottomEdgeYOfView(view)   view.frame.origin.y + view.frame.size.height
// 屏幕高度
#define SCREEN_HEIGHT             [[UIScreen mainScreen] bounds].size.height
// 屏幕宽度
#define SCREEN_WIDTH              [[UIScreen mainScreen] bounds].size.width
#define FULL_WIDTH                SCREEN_WIDTH
#define FULL_HEIGHT               (SCREEN_HEIGHT - ((SYSTEM_VERSION >= 7) ? 0 : STATUSBAR_HEIGHT))
#define CONTENT_HEIGHT            (FULL_HEIGHT - NAVBAR_HEIGHT)

#define Device_Is_iPhone5         ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(640, 1136), [[UIScreen mainScreen] currentMode].size) : NO)
#define Device_Is_iPhone6         ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(750, 1334), [[UIScreen mainScreen] currentMode].size) : NO)
#define Device_Is_iPhone6Plus     ([UIScreen instancesRespondToSelector:@selector(currentMode)] ? CGSizeEqualToSize(CGSizeMake(1242, 2208), [[UIScreen mainScreen] currentMode].size) : NO)

#define DEVICE_UUID               [[[UIDevice currentDevice] identifierForVendor] UUIDString]

#define KEYBOARD_HEIGHT           216

// 字体
#pragma mark - font
#define FontWithNameSize(name, size)    [UIFont fontWithName:name size:size]
#define FontWithSize(size)              [UIFont systemFontOfSize:size]
#define ScoreFontWithSize(fontSize)     [UIFont fontWithName:@"Bradley Hand" size:fontSize]
#define BoldFontWithSize(size)          [UIFont boldSystemFontOfSize:size]
#define BoldSystemFont(size)            [UIFont boldSystemFontOfSize:size]
#define systemFont(size)                [UIFont systemFontOfSize:size]

#pragma mark - GCD
// 单例
#define DISPATCH_ONCE_BLOCK(onceBlock); static dispatch_once_t onceToken; dispatch_once(&onceToken, onceBlock);

// 是否为中文
#define IS_CH_SYMBOL(chr)               ((int)(chr)>127)
#define StringByTrimWhiteSpace(text)    [text stringByTrimmingCharactersInSet:[NSCharacterSet whitespaceAndNewlineCharacterSet]]
#define IsStringEmpty(string)           (!string || [@"" isEqualToString:string])
#define IsStringNotEmpty(string)        (string && ![@"" isEqualToString:string])

#define ISNULL(x) (x?((id)x==(id)[NSNull null]):true)

//详细的数据
//武器锻造－武器配方
#define RECIPT_SECTION1_1               @[@"单手剑", @"双手剑", @"短剑", @"矛", @"斧", @"爪", @"鞭", @"锤", @"回旋镖"]
#define RECIPT_SECTION1_1_SUB           @[@[@"铜剑", @"青铜剑", @"细剑", @"铁剑", @"占山军刀", @"银制细剑", @"钢铁之剑", @"七夕之剑", @"手半剑", @"西部细剑", @"战士之剑", @"破邪之剑", @"隼之剑", @"白金剑", @"魔剑士细剑", @"斩尸剑", @"奇迹之剑", @"斩龙剑", @"火焰剑", @"金属史莱姆之剑", @"缟玛瑙魔剑", @"星尘之剑", @"圣王之剑", @"雷霆之剑", @"名刀斩铁丸", @"天命之剑"],\
                                        @[@"铜制大剑", @"青铜大剑", @"巨刃", @"铁制大剑", @"巨刃Ⅱ", @"夜影大剑", @"钢铁大剑", @"繁星大剑", @"巨剪", @"退魔太刀", @"血腥之刃", @"新月大剑", @"斩夜太刀", @"白金大剑", @"恶魔大剑", @"灭龙剑", @"君王大剑", @"大狱剑", @"金属史莱姆大剑", @"天马大剑", @"源力大剑", @"圣王之大剑", @"帝国大剑", @"混沌大剑", @"翠石大剑"],\
                                        @[@"青铜短刀", @"神圣短刀", @"毒蛾短刀", @"响马短刀", @"刺客匕首", @"银制短剑", @"小恶魔短刀", @"毒针", @"鹰之匕首", @"夜蝶短剑", @"破剑之刃", @"穿刺耳环", @"冰刃", @"古斗士短剑", @"血针", @"沙罗曼蛇", @"王家短刀", @"猎鹰匕首", @"寒风匕首", @"千刺匕首", @"圣王之短刀", @"雷霆匕首", @"剧毒鳞刃", @"水晶之刃"],\
                                        @[@"青铜矛", @"长矛", @"铁矛", @"近卫兵矛", @"神圣之矛", @"钢铁之矛", @"战叉", @"闪电之矛", @"游击之矛", @"沙尘之矛", @"古拉柯斯之矛", @"白金矛", @"雷神之矛", @"恶魔之矛", @"海洋之叉", @"英雄之矛", @"金属史莱姆之矛", @"圣骑士之矛", @"鬼神魔枪", @"圣王之矛", @"炽天使之矛", @"血腥之矛", @"雅典娜圣枪"],\
                                        @[@"铜斧", @"青铜斧", @"占山斧", @"铁斧", @"轻斧", @"银之斧", @"钢铁之斧", @"战斧", @"卡尔萨多拉之斧", @"月之斧", @"达人之斧", @"君王之斧", @"日蚀之斧", @"萨满之斧", @"风雪之斧", @"凯撒之斧", @"毁灭者", @"霸者之斧", @"巨斧", @"粉碎砍刀", @"圣王之斧", @"阿波罗之斧", @"公爵之斧", @"雪崩之斧"],\
                                        @[@"铜爪", @"青铜爪", @"猫爪", @"铁爪", @"驱魔之爪", @"白银爪", @"钢铁之爪", @"小恶魔之爪", @"黑豹之爪", @"隼爪", @"火焰之爪", @"冰爪", @"白金爪", @"恶魔之爪", @"龙爪", @"古武道之爪", @"魔兽之爪", @"猎鹰之爪", @"冥兽之爪", @"龙王之爪", @"圣王之爪", @"水晶爪", @"船长钩爪", @"苍炎之爪"],\
                                        @[@"战斗缎带", @"铁鞭", @"蛇皮鞭", @"蔷薇鞭", @"钢铁之鞭", @"星球鞭", @"锦蛇鞭", @"魅惑缎带", @"野兽鞭", @"响尾蛇鞭", @"蝎尾鞭", @"爆裂之鞭", @"龙尾鞭", @"恶魔之鞭", @"卡尔贝罗鞭", @"海蛇之鞭", @"女王之鞭", @"魔神之鞭", @"圣王之鞭", @"三叉戟鞭", @"冰封之鞭", @"锚鞭"],\
                                        @[@"青铜槌", @"铁棒", @"大槌", @"银槌", @"钢铁之槌", @"战锤", @"战斗圆头锤", @"鬼棒", @"碎骨锤", @"魔法锤", @"白金锤", @"冰原之锤", @"火山锤", @"巨锤", @"巨人锤", @"哥顿锤", @"百万吨重锤", @"魔神之槌", @"圣王之锤", @"天崩地裂", @"巴雷特锤", @"天使铁锤"],\
                                        @[@"青铜回旋镖", @"利刃回旋镖", @"铁翼回旋镖", @"十字回旋镖", @"白银回旋镖", @"钢铁回旋镖", @"翼之刃", @"风之回旋镖", @"忍者回旋镖", @"魔法回旋镖", @"双翼回旋镖", @"白金回旋镖", @"寒冰回旋镖", @"火焰回旋镖", @"黑鹰回旋镖", @"南十字星", @"金属之翼", @"五芒星", @"流星之刃", @"圣王之回旋镖", @"蓝色猎鹰", @"三尖回旋镖", @"暗黑之星"]]
#define RECIPT_SECTION1_1_SUB_IMAGE     @[@[@"Icon-铜剑", @"Icon-青铜剑", @"Icon-细剑", @"Icon-铁剑", @"Icon-占山军刀", @"Icon-银制细剑", @"Icon-钢铁之剑", @"Icon-七夕之剑", @"Icon-手半剑", @"Icon-西部细剑", @"Icon-战士之剑", @"Icon-破邪之剑", @"Icon-隼之剑", @"Icon-白金剑", @"Icon-魔剑士细剑", @"Icon-斩尸剑", @"Icon-奇迹之剑", @"Icon-斩龙剑", @"Icon-火焰剑", @"Icon-金属史莱姆之剑", @"Icon-缟玛瑙魔剑", @"Icon-星尘之剑", @"Icon-圣王之剑", @"Icon-雷霆之剑", @"Icon-名刀斩铁丸", @"Icon-天命之剑"],\
                                        @[@"Icon-铜制大剑", @"Icon-青铜大剑", @"Icon-巨刃", @"Icon-铁制大剑", @"Icon-巨刃Ⅱ", @"Icon-夜影大剑", @"Icon-钢铁大剑", @"Icon-繁星大剑", @"Icon-巨剪", @"Icon-退魔太刀", @"Icon-血腥之刃", @"Icon-新月大剑", @"Icon-斩夜太刀", @"Icon-白金大剑", @"Icon-恶魔大剑", @"Icon-灭龙剑", @"Icon-君王大剑", @"Icon-大狱剑", @"Icon-金属史莱姆大剑", @"Icon-天马大剑", @"Icon-源力大剑", @"Icon-圣王之大剑", @"Icon-帝国大剑", @"Icon-混沌大剑", @"Icon-翠石大剑"],\
                                        @[@"Icon-青铜短刀", @"Icon-神圣短刀", @"Icon-毒蛾短刀", @"Icon-响马短刀", @"Icon-刺客匕首", @"Icon-银制短剑", @"Icon-小恶魔短刀", @"Icon-毒针", @"Icon-鹰之匕首", @"Icon-夜蝶短剑", @"Icon-破剑之刃", @"Icon-穿刺耳环", @"Icon-冰刃", @"Icon-古斗士短剑", @"Icon-血针", @"Icon-沙罗曼蛇", @"Icon-王家短刀", @"Icon-猎鹰匕首", @"Icon-寒风匕首", @"Icon-千刺匕首", @"Icon-圣王之短刀", @"Icon-雷霆匕首", @"Icon-剧毒鳞刃", @"Icon-水晶之刃"],\
                                        @[@"Icon-青铜矛", @"Icon-长矛", @"Icon-铁矛", @"Icon-近卫兵矛", @"Icon-神圣之矛", @"Icon-钢铁之矛", @"Icon-战叉", @"Icon-闪电之矛", @"Icon-游击之矛", @"Icon-沙尘之矛", @"Icon-古拉柯斯之矛", @"Icon-白金矛", @"Icon-雷神之矛", @"Icon-恶魔之矛", @"Icon-海洋之叉", @"Icon-英雄之矛", @"Icon-金属史莱姆之矛", @"Icon-圣骑士之矛", @"Icon-鬼神魔枪", @"Icon-圣王之矛", @"Icon-炽天使之矛", @"Icon-血腥之矛", @"Icon-雅典娜圣枪"],\
                                        @[@"Icon-铜斧", @"Icon-青铜斧", @"Icon-占山斧", @"Icon-铁斧", @"Icon-轻斧", @"Icon-银之斧", @"Icon-钢铁之斧", @"Icon-战斧", @"Icon-卡尔萨多拉之斧", @"Icon-月之斧", @"Icon-达人之斧", @"Icon-君王之斧", @"Icon-日蚀之斧", @"Icon-萨满之斧", @"Icon-风雪之斧", @"Icon-凯撒之斧", @"Icon-毁灭者", @"Icon-霸者之斧", @"Icon-巨斧", @"Icon-粉碎砍刀", @"Icon-圣王之斧", @"Icon-阿波罗之斧", @"Icon-公爵之斧", @"Icon-雪崩之斧"],\
                                        @[@"Icon-铜爪", @"Icon-青铜爪", @"Icon-猫爪", @"Icon-铁爪", @"Icon-驱魔之爪", @"Icon-白银爪", @"Icon-钢铁之爪", @"Icon-小恶魔之爪", @"Icon-黑豹之爪", @"Icon-隼爪", @"Icon-火焰之爪", @"Icon-冰爪", @"Icon-白金爪", @"Icon-恶魔之爪", @"Icon-龙爪", @"Icon-古武道之爪", @"Icon-魔兽之爪", @"Icon-猎鹰之爪", @"Icon-冥兽之爪", @"Icon-龙王之爪", @"Icon-圣王之爪", @"Icon-水晶爪", @"Icon-船长钩爪", @"Icon-苍炎之爪"],\
                                        @[@"Icon-战斗缎带", @"Icon-铁鞭", @"Icon-蛇皮鞭", @"Icon-蔷薇鞭", @"Icon-钢铁之鞭", @"Icon-星球鞭", @"Icon-锦蛇鞭", @"Icon-魅惑缎带", @"Icon-野兽鞭", @"Icon-响尾蛇鞭", @"Icon-蝎尾鞭", @"Icon-爆裂之鞭", @"Icon-龙尾鞭", @"Icon-恶魔之鞭", @"Icon-卡尔贝罗鞭", @"Icon-海蛇之鞭", @"Icon-女王之鞭", @"Icon-魔神之鞭", @"Icon-圣王之鞭", @"Icon-三叉戟鞭", @"Icon-冰封之鞭", @"Icon-锚鞭"],\
                                        @[@"Icon-青铜槌", @"Icon-铁棒", @"Icon-大槌", @"Icon-银槌", @"Icon-钢铁之槌", @"Icon-战锤", @"Icon-战斗圆头锤", @"Icon-鬼棒", @"Icon-碎骨锤", @"Icon-魔法锤", @"Icon-白金锤", @"Icon-冰原之锤", @"Icon-火山锤", @"Icon-巨锤", @"Icon-巨人锤", @"Icon-哥顿锤", @"Icon-百万吨重锤", @"Icon-魔神之槌", @"Icon-圣王之锤", @"Icon-天崩地裂", @"Icon-巴雷特锤", @"Icon-天使铁锤"],\
                                        @[@"Icon-青铜回旋镖", @"Icon-利刃回旋镖", @"Icon-铁翼回旋镖", @"Icon-十字回旋镖", @"Icon-白银回旋镖", @"Icon-钢铁回旋镖", @"Icon-翼之刃", @"Icon-风之回旋镖", @"Icon-忍者回旋镖", @"Icon-魔法回旋镖", @"Icon-双翼回旋镖", @"Icon-白金回旋镖", @"Icon-寒冰回旋镖", @"Icon-火焰回旋镖", @"Icon-黑鹰回旋镖", @"Icon-南十字星", @"Icon-金属之翼", @"Icon-五芒星", @"Icon-流星之刃", @"Icon-圣王之回旋镖", @"Icon-蓝色猎鹰", @"Icon-三尖回旋镖", @"Icon-暗黑之星"]]
//武器锻造－家具配方
#define RECIPT_SECTION1_2               @[@"家具配方"]
#define RECIPT_SECTION1_2_SUB			@[@[@"天文望远镜·茶", @"怀旧电风扇"]]
#define RECIPT_SECTION1_2_SUB_IMAGE     @[@[@"Icon-天文望远镜·茶", @"Icon-怀旧电风扇"]]
//武器锻造－庭具配方
#define RECIPT_SECTION1_3               @[@"庭具配方"]
#define RECIPT_SECTION1_3_SUB			@[@[@"天文仪·银", @"银河风铃·白"]]
#define RECIPT_SECTION1_3_SUB_IMAGE     @[@[@"Icon-天文仪·银", @"Icon-银河风铃·白"]]
//防具锻造－防具锻造配方
#define RECIPT_SECTION2_1               @[@"盾", @"鳞铠", @"铁制铠甲", @"锁链甲", @"银制防具", @"新兵配发防具", @"钢制防具", @"魔法护甲", @"占山铠甲", @"黑钢铠甲", @"白金套装", @"玄武", @"古强者", @"沉重铠甲", @"亡灵", @"刀刃铠甲", @"战斗衣服", @"哥特防具", @"师团长", @"僧兵", @"贵族", @"野蛮", @"突刺", @"假面舞会", @"飞龙", @"圣骑士", @"神兵", @"伟大", @"流浪", @"王军师", @"机械", @"血红", @"凯歌", @"毒蛇"]
#define RECIPT_SECTION2_1_SUB			@[@[@"轻圆盾", @"铁制大盾", @"白银托盘", @"纯白圆盾", @"钢铁大盾", @"史莱姆托盘", @"小鬼圆盾", @"史莱姆贝斯托盘", @"魔法盾", @"鸢盾", @"封魔盾", @"战士大盾", @"白金托盘", @"鬼蜘蛛盾", @"露夫盾", @"白金盾", @"龙盾", @"水镜之盾", @"符文圆盾", @"金属史莱姆之盾", @"头领大盾", @"圣骑士的大盾", @"巨魔盾", @"邪眼大盾", @"圣王之大盾", @"圣王之盾", @"圣女之盾", @"乌尔贝阿大盾", @"天青石大盾"],\
										@[@"鳞盔", @"鳞护手", @"鳞长靴", @"鳞铠上装", @"鳞铠下装"],\
										@[@"铁制护额", @"铁制护腕", @"铁制护腿", @"铁制胸铠", @"铁制甲裙", @"铁制头盔", @"铁制护手", @"铁制长靴", @"铁制铠甲下装", @"铁制铠甲上装"],\
										@[@"锁链护额", @"锁链护臂", @"锁链靴", @"锁链甲上装", @"锁链甲下装"],\
										@[@"银制护额", @"银制护手", @"银制长靴", @"银制胸铠", @"银制甲裙"],\
										@[@"新兵头盔", @"新兵手套", @"新兵长靴", @"新兵胸铠", @"新兵甲裙"],\
										@[@"钢制头盔", @"钢制护手", @"钢制长靴", @"钢制铠甲上装", @"钢制铠甲下装"],\
										@[@"魔法之冠", @"魔法护手", @"魔法长靴", @"魔法铠甲上装", @"魔法铠甲下装"],\
										@[@"占山头带", @"占山手套", @"占山长靴", @"占山链甲", @"占山裤子"],\
										@[@"黑钢护额", @"黑钢护手", @"黑钢长靴", @"黑钢铠甲上装", @"黑钢铠甲下装"],\
										@[@"白金头盔", @"白金护手", @"白金长靴", @"白金铠甲上装", @"白金铠甲下装"],\
										@[@"玄武头盔", @"玄武腕带", @"玄武鞋", @"玄武道衣上装", @"玄武道衣下装"],\
										@[@"古强者头盔", @"古强者护手", @"古强者长靴", @"古强者铠甲下装", @"古强者铠甲上装"],\
										@[@"沉重头盔", @"沉重手套", @"沉重长靴", @"沉重护甲下装", @"沉重护甲上装"],\
										@[@"亡灵头巾", @"亡灵护臂", @"亡灵长靴", @"亡灵披风"],\
										@[@"刀刃护额", @"刀刃铠甲上装", @"刀刃铠甲下装", @"刀刃护手", @"刀刃长靴"],\
										@[@"战斗头冠", @"战斗护手", @"战斗衣服上装", @"战斗衣服下装", @"战斗长靴"],\
										@[@"哥特礼帽", @"哥特帽", @"哥特手套", @"哥特护手", @"哥特长筒袜", @"哥特长靴", @"哥特裙", @"哥特外衣上装", @"哥特胸衣", @"哥特外衣下装"],\
										@[@"师团长头盔", @"师团长护手", @"师团长长靴", @"师团长铠甲上装", @"师团长铠甲下装"],\
										@[@"僧兵之冠", @"僧兵衣服上装", @"僧兵衣服下装", @"僧兵手套", @"僧兵鞋"],\
										@[@"贵族帽", @"贵族外衣上装", @"贵族外衣下装", @"贵族手套", @"贵族长靴"],\
										@[@"野蛮贝雷帽", @"野蛮上衣", @"野蛮下装", @"野蛮手镯", @"野蛮鞋"],\
										@[@"突刺头盔", @"突刺铠甲上装", @"突刺铠甲下装", @"突刺手套", @"突刺长靴"],\
										@[@"假面舞会头盔", @"假面舞会礼服", @"假面舞会手套", @"假面舞会长靴"],\
										@[@"飞龙头盔", @"飞龙上衣", @"飞龙长裤", @"飞龙手套", @"飞龙长靴"],\
										@[@"圣骑士头盔", @"圣骑士铠甲上装", @"圣骑士铠甲下装", @"圣骑士护手", @"圣骑士长靴"],\
										@[@"神兵头盔", @"神兵铠甲上装", @"神兵铠甲下装", @"神兵护手", @"神兵长靴"],\
										@[@"伟大头盔", @"伟大披风", @"伟大手套", @"伟大长靴"],\
										@[@"流浪帽", @"流浪外衣上装", @"流浪外衣下装", @"流浪护臂", @"流浪鞋"],\
										@[@"王军师头盔", @"王军师手套", @"王军师铠甲", @"王军师长靴"],\
										@[@"机械兜帽", @"机械衣服上装", @"机械衣服下装", @"机械护手", @"机械靴"],\
										@[@"血红头盔", @"血红铠甲上装", @"血红铠甲下装", @"血红手套", @"血红长靴"],\
										@[@"凯歌头盔", @"凯歌铠甲上装", @"凯歌铠甲下装", @"凯歌护手", @"凯歌长靴"],\
										@[@"毒蛇帽", @"毒蛇外衣", @"毒蛇手套", @"毒蛇长靴"]]
										
#define RECIPT_SECTION2_1_SUB_IMAGE		@[@[@"Icon-轻圆盾", @"Icon-铁制大盾", @"Icon-白银托盘", @"Icon-纯白圆盾", @"Icon-钢铁大盾", @"Icon-史莱姆托盘", @"Icon-小鬼圆盾", @"Icon-史莱姆贝斯托盘", @"Icon-魔法盾", @"Icon-鸢盾", @"Icon-封魔盾", @"Icon-战士大盾", @"Icon-白金托盘", @"Icon-鬼蜘蛛盾", @"Icon-露夫盾", @"Icon-白金盾", @"Icon-龙盾", @"Icon-水镜之盾", @"Icon-符文圆盾", @"Icon-金属史莱姆之盾", @"Icon-头领大盾", @"Icon-圣骑士的大盾", @"Icon-巨魔盾", @"Icon-邪眼大盾", @"Icon-圣王之大盾", @"Icon-圣王之盾", @"Icon-圣女之盾", @"Icon-乌尔贝阿大盾", @"Icon-天青石大盾"],\
										@[@"Icon-鳞盔", @"Icon-鳞护手", @"Icon-鳞长靴", @"Icon-鳞铠上装", @"Icon-鳞铠下装"],\
										@[@"Icon-铁制护额", @"Icon-铁制护腕", @"Icon-铁制护腿", @"Icon-铁制胸铠", @"Icon-铁制甲裙", @"Icon-铁制头盔", @"Icon-铁制护手", @"Icon-铁制长靴", @"Icon-铁制铠甲下装", @"Icon-铁制铠甲上装"],\
										@[@"Icon-锁链护额", @"Icon-锁链护臂", @"Icon-锁链靴", @"Icon-锁链甲上装", @"Icon-锁链甲下装"],\
										@[@"Icon-银制护额", @"Icon-银制护手", @"Icon-银制长靴", @"Icon-银制胸铠", @"Icon-银制甲裙"],\
										@[@"Icon-新兵头盔", @"Icon-新兵手套", @"Icon-新兵长靴", @"Icon-新兵胸铠", @"Icon-新兵甲裙"],\
										@[@"Icon-钢制头盔", @"Icon-钢制护手", @"Icon-钢制长靴", @"Icon-钢制铠甲上装", @"Icon-钢制铠甲下装"],\
										@[@"Icon-魔法之冠", @"Icon-魔法护手", @"Icon-魔法长靴", @"Icon-魔法铠甲上装", @"Icon-魔法铠甲下装"],\
										@[@"Icon-占山头带", @"Icon-占山手套", @"Icon-占山长靴", @"Icon-占山链甲", @"Icon-占山裤子"],\
										@[@"Icon-黑钢护额", @"Icon-黑钢护手", @"Icon-黑钢长靴", @"Icon-黑钢铠甲上装", @"Icon-黑钢铠甲下装"],\
										@[@"Icon-白金头盔", @"Icon-白金护手", @"Icon-白金长靴", @"Icon-白金铠甲上装", @"Icon-白金铠甲下装"],\
										@[@"Icon-玄武头盔", @"Icon-玄武腕带", @"Icon-玄武鞋", @"Icon-玄武道衣上装", @"Icon-玄武道衣下装"],\
										@[@"Icon-古强者头盔", @"Icon-古强者护手", @"Icon-古强者长靴", @"Icon-古强者铠甲下装", @"Icon-古强者铠甲上装"],\
										@[@"Icon-沉重头盔", @"Icon-沉重手套", @"Icon-沉重长靴", @"Icon-沉重护甲下装", @"Icon-沉重护甲上装"],\
										@[@"Icon-亡灵头巾", @"Icon-亡灵护臂", @"Icon-亡灵长靴", @"Icon-亡灵披风"],\
										@[@"Icon-刀刃护额", @"Icon-刀刃铠甲上装", @"Icon-刀刃铠甲下装", @"Icon-刀刃护手", @"Icon-刀刃长靴"],\
										@[@"Icon-战斗头冠", @"Icon-战斗护手", @"Icon-战斗衣服上装", @"Icon-战斗衣服下装", @"Icon-战斗长靴"],\
										@[@"Icon-哥特礼帽", @"Icon-哥特帽", @"Icon-哥特手套", @"Icon-哥特护手", @"Icon-哥特长筒袜", @"Icon-哥特长靴", @"Icon-哥特裙", @"Icon-哥特外衣上装", @"Icon-哥特胸衣", @"Icon-哥特外衣下装"],\
										@[@"Icon-师团长头盔", @"Icon-师团长护手", @"Icon-师团长长靴", @"Icon-师团长铠甲上装", @"Icon-师团长铠甲下装"],\
										@[@"Icon-僧兵之冠", @"Icon-僧兵衣服上装", @"Icon-僧兵衣服下装", @"Icon-僧兵手套", @"Icon-僧兵鞋"],\
										@[@"Icon-贵族帽", @"Icon-贵族外衣上装", @"Icon-贵族外衣下装", @"Icon-贵族手套", @"Icon-贵族长靴"],\
										@[@"Icon-野蛮贝雷帽", @"Icon-野蛮上衣", @"Icon-野蛮下装", @"Icon-野蛮手镯", @"Icon-野蛮鞋"],\
										@[@"Icon-突刺头盔", @"Icon-突刺铠甲上装", @"Icon-突刺铠甲下装", @"Icon-突刺手套", @"Icon-突刺长靴"],\
										@[@"Icon-假面舞会头盔", @"Icon-假面舞会礼服", @"Icon-假面舞会手套", @"Icon-假面舞会长靴"],\
										@[@"Icon-飞龙头盔", @"Icon-飞龙上衣", @"Icon-飞龙长裤", @"Icon-飞龙手套", @"Icon-飞龙长靴"],\
										@[@"Icon-圣骑士头盔", @"Icon-圣骑士铠甲上装", @"Icon-圣骑士铠甲下装", @"Icon-圣骑士护手", @"Icon-圣骑士长靴"],\
										@[@"Icon-神兵头盔", @"Icon-神兵铠甲上装", @"Icon-神兵铠甲下装", @"Icon-神兵护手", @"Icon-神兵长靴"],\
										@[@"Icon-伟大头盔", @"Icon-伟大披风", @"Icon-伟大手套", @"Icon-伟大长靴"],\
										@[@"Icon-流浪帽", @"Icon-流浪外衣上装", @"Icon-流浪外衣下装", @"Icon-流浪护臂", @"Icon-流浪鞋"],\
										@[@"Icon-王军师头盔", @"Icon-王军师手套", @"Icon-王军师铠甲", @"Icon-王军师长靴"],\
										@[@"Icon-机械兜帽", @"Icon-机械衣服上装", @"Icon-机械衣服下装", @"Icon-机械护手", @"Icon-机械靴"],\
										@[@"Icon-血红头盔", @"Icon-血红铠甲上装", @"Icon-血红铠甲下装", @"Icon-血红手套", @"Icon-血红长靴"],\
										@[@"Icon-凯歌头盔", @"Icon-凯歌铠甲上装", @"Icon-凯歌铠甲下装", @"Icon-凯歌护手", @"Icon-凯歌长靴"],\
										@[@"Icon-毒蛇帽", @"Icon-毒蛇外衣", @"Icon-毒蛇手套", @"Icon-毒蛇长靴"]]
//道具锻造－道具配方
#define RECIPT_SECTION3_1               @[@"锻造锤", @"裁缝针", @"木工刀", @"炼金油灯", @"炼金壶", @"平底锅"]
#define RECIPT_SECTION3_1_SUB			@[@[@"铜制锻造锤", @"铁制锻造锤", @"七夕锻造锤", @"星之锻造锤", @"银制锻造锤", @"银制小锻造锤", @"白金锻造锤", @"白金小锻造锤", @"超级小锻造锤", @"超级锻造锤", @"奇迹锻造锤", @"奇迹小锻造锤"],\
										@[@"铜制木工刀", @"铁制木工刀", @"七夕木工刀", @"星之木工刀", @"银制木工刀", @"银制小木工刀", @"白金木工刀", @"白金小木工刀", @"超级小木工刀", @"超级木工刀", @"奇迹木工刀", @"奇迹小木工刀"],\
										@[@"铜制裁缝针", @"铁制裁缝针", @"七夕裁缝针", @"星之裁缝针", @"银制裁缝针", @"银制小裁缝针", @"白金裁缝针", @"白金小裁缝针", @"超级小裁缝针", @"超级裁缝针", @"奇迹裁缝针", @"奇迹小裁缝针"],\
										@[@"铜制炼金油灯", @"铁制炼金油灯", @"七夕炼金油灯", @"星之炼金油灯", @"银制炼金油灯", @"银制小炼金油灯", @"白金炼金油灯", @"白金小炼金油灯", @"超级小炼金油灯", @"超级炼金油灯", @"奇迹炼金油灯", @"奇迹小炼金油灯"],\
										@[@"铜制炼金壶", @"铁制炼金壶", @"七夕炼金壶", @"星之炼金壶", @"银制炼金壶", @"银制小炼金壶", @"白金炼金壶", @"白金小炼金壶", @"超级小炼金壶", @"超级炼金壶", @"奇迹炼金壶", @"奇迹小炼金壶"],\
										@[@"星之煎锅", @"铁制平底锅", @"铜制平底锅", @"银制平底锅", @"银制小平底锅", @"白金小平底锅", @"白金平底锅", @"超级小平底锅", @"超级平底锅", @"奇迹平底锅", @"奇迹小平底锅"]]
#define RECIPT_SECTION3_1_SUB_IMAGE		@[@[@"Icon-铜制锻造锤", @"Icon-铁制锻造锤", @"Icon-七夕锻造锤", @"Icon-星之锻造锤", @"Icon-银制锻造锤", @"Icon-银制小锻造锤", @"Icon-白金锻造锤", @"Icon-白金小锻造锤", @"Icon-超级小锻造锤", @"Icon-超级锻造锤", @"Icon-奇迹锻造锤", @"Icon-奇迹小锻造锤"],\
										@[@"Icon-铜制木工刀", @"Icon-铁制木工刀", @"Icon-七夕木工刀", @"Icon-星之木工刀", @"Icon-银制木工刀", @"Icon-银制小木工刀", @"Icon-白金木工刀", @"Icon-白金小木工刀", @"Icon-超级小木工刀", @"Icon-超级木工刀", @"Icon-奇迹木工刀", @"Icon-奇迹小木工刀"],\
										@[@"Icon-铜制裁缝针", @"Icon-铁制裁缝针", @"Icon-七夕裁缝针", @"Icon-星之裁缝针", @"Icon-银制裁缝针", @"Icon-银制小裁缝针", @"Icon-白金裁缝针", @"Icon-白金小裁缝针", @"Icon-超级小裁缝针", @"Icon-超级裁缝针", @"Icon-奇迹裁缝针", @"Icon-奇迹小裁缝针"],\
										@[@"Icon-铜制炼金油灯", @"Icon-铁制炼金油灯", @"Icon-七夕炼金油灯", @"Icon-星之炼金油灯", @"Icon-银制炼金油灯", @"Icon-银制小炼金油灯", @"Icon-白金炼金油灯", @"Icon-白金小炼金油灯", @"Icon-超级小炼金油灯", @"Icon-超级炼金油灯", @"Icon-奇迹炼金油灯", @"Icon-奇迹小炼金油灯"],\
										@[@"Icon-铜制炼金壶", @"Icon-铁制炼金壶", @"Icon-七夕炼金壶", @"Icon-星之炼金壶", @"Icon-银制炼金壶", @"Icon-银制小炼金壶", @"Icon-白金炼金壶", @"Icon-白金小炼金壶", @"Icon-超级小炼金壶", @"Icon-超级炼金壶", @"Icon-奇迹炼金壶", @"Icon-奇迹小炼金壶"],\
										@[@"Icon-星之煎锅", @"Icon-铁制平底锅", @"Icon-铜制平底锅", @"Icon-银制平底锅", @"Icon-银制小平底锅", @"Icon-白金小平底锅", @"Icon-白金平底锅", @"Icon-超级小平底锅", @"Icon-超级平底锅", @"Icon-奇迹平底锅", @"Icon-奇迹小平底锅"]]
//道具锻造－家具配方
#define RECIPT_SECTION3_2               @[@"家具配方"]
#define RECIPT_SECTION3_2_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION3_2_SUB_IMAGE		@[@[@""]]
//道具锻造－庭具配方
#define RECIPT_SECTION3_3               @[@"庭具配方"]
#define RECIPT_SECTION3_3_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION3_3_SUB_IMAGE		@[@[@""]]
//道具锻造－素材配方
#define RECIPT_SECTION3_4               @[@"素材配方"]
#define RECIPT_SECTION3_4_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION3_4_SUB_IMAGE		@[@[@""]]
//木工－武器配方
#define RECIPT_SECTION4_1               @[@"短杖", @"双手杖", @"棍", @"扇", @"弓"]
#define RECIPT_SECTION4_1_SUB			@[@[@"别针短杖", @"鲜花短杖", @"史莱姆短杖", @"闪耀之杖", @"魔萌短杖", @"爱心短杖", @"繁星之杖", @"羽翼短杖", @"史莱姆塔杖", @"魔笛短杖", @"魔力短杖", @"马波雷纳杖", @"棒棒糖杖", @"阳伞短杖", @"龙之短杖", @"天使杖", @"世界树之杖", @"恶魔杖", @"哥特阳伞", @"泰塔尼亚杖", @"圣王之短杖", @"光之杖", @"梦想短杖", @"圣人之泪"],\
										@[@"魔导士法杖", @"制裁法杖", @"雨云法杖", @"封魔法杖", @"海鸣法杖", @"雷鸣法杖", @"妖精法杖", @"比奥拉法杖", @"符文法杖", @"岩浆法杖", @"精灵法杖", @"魔眼法杖", @"冰之法杖", @"塞壬法杖", @"弧形法杖", @"福音法杖", @"贤者法杖", @"女神法杖", @"龙之法杖", @"圣王之法杖", @"光之法杖", @"彩虹法杖", @"不死者魔杖"],\
										@[@"天秤棍", @"橡木棍", @"行者之棍", @"六角棍", @"演武之棍", @"突刺棍", @"仪式棍", @"浅眠之棍", @"碾压之棍", @"落雨棍", @"罗刹之棍", @"狼牙棒", @"夜叉之棍", @"龙棍", @"日轮之棍", @"悲叹之棍", @"白蛇之棍", @"修罗之棍", @"神龙棍", @"圣王之棍", @"阴阳道之棍", @"恶魔棍", @"默示棍"],\
										@[@"羽扇", @"战斗扇", @"铁扇", @"龟之扇", @"鸟之扇", @"猫猫扇", @"七夕扇", @"七星扇", @"孔雀之扇", @"蛇之扇", @"星之扇", @"魔法扇", @"魔性扇", @"月之扇", @"彩虹之扇", @"太阳之扇", @"芭蕉扇", @"天下太平", @"必杀之扇", @"风林火山", @"圣王之扇", @"万花视界", @"青岚之扇", @"春紫菀"],\
										@[@"古木之弓", @"新木弓", @"爱神之弓", @"猎人之弓", @"紫檀弓", @"长弓", @"青竹弓", @"小恶魔之弓", @"风斩之弓", @"诱惑之弓", @"白鸟弓", @"月光之弓", @"无限弓", @"暗夜狙击手", @"朱雀弓", @"喀戎之弓", @"阿尔忒弥斯之弓", @"翼蜥之弓", @"地狱之弓", @"天使之弓", @"圣王之弓", @"奥丁之弓", @"双头蛇", @"俄耳甫斯之弓"]]
#define RECIPT_SECTION4_1_SUB_IMAGE		@[@[@"Icon-别针短杖", @"Icon-鲜花短杖", @"Icon-史莱姆短杖", @"Icon-闪耀之杖", @"Icon-魔萌短杖", @"Icon-爱心短杖", @"Icon-繁星之杖", @"Icon-羽翼短杖", @"Icon-史莱姆塔杖", @"Icon-魔笛短杖", @"Icon-魔力短杖", @"Icon-马波雷纳杖", @"Icon-棒棒糖杖", @"Icon-阳伞短杖", @"Icon-龙之短杖", @"Icon-天使杖", @"Icon-世界树之杖", @"Icon-恶魔杖", @"Icon-哥特阳伞", @"Icon-泰塔尼亚杖", @"Icon-圣王之短杖", @"Icon-光之杖", @"Icon-梦想短杖", @"Icon-圣人之泪"],\
										@[@"Icon-魔导士法杖", @"Icon-制裁法杖", @"Icon-雨云法杖", @"Icon-封魔法杖", @"Icon-海鸣法杖", @"Icon-雷鸣法杖", @"Icon-妖精法杖", @"Icon-比奥拉法杖", @"Icon-符文法杖", @"Icon-岩浆法杖", @"Icon-精灵法杖", @"Icon-魔眼法杖", @"Icon-冰之法杖", @"Icon-塞壬法杖", @"Icon-弧形法杖", @"Icon-福音法杖", @"Icon-贤者法杖", @"Icon-女神法杖", @"Icon-龙之法杖", @"Icon-圣王之法杖", @"Icon-光之法杖", @"Icon-彩虹法杖", @"Icon-不死者魔杖"],\
										@[@"Icon-天秤棍", @"Icon-橡木棍", @"Icon-行者之棍", @"Icon-六角棍", @"Icon-演武之棍", @"Icon-突刺棍", @"Icon-仪式棍", @"Icon-浅眠之棍", @"Icon-碾压之棍", @"Icon-落雨棍", @"Icon-罗刹之棍", @"Icon-狼牙棒", @"Icon-夜叉之棍", @"Icon-龙棍", @"Icon-日轮之棍", @"Icon-悲叹之棍", @"Icon-白蛇之棍", @"Icon-修罗之棍", @"Icon-神龙棍", @"Icon-圣王之棍", @"Icon-阴阳道之棍", @"Icon-恶魔棍", @"Icon-默示棍"],\
										@[@"Icon-羽扇", @"Icon-战斗扇", @"Icon-铁扇", @"Icon-龟之扇", @"Icon-鸟之扇", @"Icon-猫猫扇", @"Icon-七夕扇", @"Icon-七星扇", @"Icon-孔雀之扇", @"Icon-蛇之扇", @"Icon-星之扇", @"Icon-魔法扇", @"Icon-魔性扇", @"Icon-月之扇", @"Icon-彩虹之扇", @"Icon-太阳之扇", @"Icon-芭蕉扇", @"Icon-天下太平", @"Icon-必杀之扇", @"Icon-风林火山", @"Icon-圣王之扇", @"Icon-万花视界", @"Icon-青岚之扇", @"Icon-春紫菀"],\
										@[@"Icon-古木之弓", @"Icon-新木弓", @"Icon-爱神之弓", @"Icon-猎人之弓", @"Icon-紫檀弓", @"Icon-长弓", @"Icon-青竹弓", @"Icon-小恶魔之弓", @"Icon-风斩之弓", @"Icon-诱惑之弓", @"Icon-白鸟弓", @"Icon-月光之弓", @"Icon-无限弓", @"Icon-暗夜狙击手", @"Icon-朱雀弓", @"Icon-喀戎之弓", @"Icon-阿尔忒弥斯之弓", @"Icon-翼蜥之弓", @"Icon-地狱之弓", @"Icon-天使之弓", @"Icon-圣王之弓", @"Icon-奥丁之弓", @"Icon-双头蛇", @"Icon-俄耳甫斯之弓"]]
//木工－家具配方
#define RECIPT_SECTION4_2               @[@"椅子", @"桌子", @"柜台", @"柜子", @"收纳柜", @"床", @"厨台", @"烤炉", @"浴盆", @"暖炉", @"架子", @"隔断", @"其他"]
#define RECIPT_SECTION4_2_SUB			@[@[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"], @[@"暂无数据"]]
#define RECIPT_SECTION4_2_SUB_IMAGE		@[@[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""], @[@""]]
//木工－庭具配方
#define RECIPT_SECTION4_3               @[@"庭具配方"]
#define RECIPT_SECTION4_3_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION4_3_SUB_IMAGE		@[@[@""]]
//木工－钓竿配方
#define RECIPT_SECTION4_4               @[@"钓竿配方"]
#define RECIPT_SECTION4_4_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION4_4_SUB_IMAGE		@[@[@""]]
//裁缝－防具配方
#define RECIPT_SECTION5_1               @[@"裁缝入门", @"暖场艺人", @"新手艺人", @"剪柳", @"治愈", @"射手", @"丝织", @"藏红花", @"药师", @"初级魔法战士", @"修炼", @"舞者", @"闪避", @"学者", @"疾风", @"魔术师", @"功夫", @"树叶", @"斗牛士", @"咒术师", @"守护", @"西部", @"神官", @"森人", @"拳法", @"讲述者", @"魔导士", @"祭司", @"神圣", @"水之羽衣", @"击剑士", @"奇术师", @"混混", @"占星术士", @"圣者", @"真理", @"知识", @"大师", @"财宝", @"月之长袍", @"原始兽", @"拳圣", @"摩登兔", @"王宫魔术师", @"小丑", @"古代魔术", @"奇迹", @"古武道", @"大魔导", @"大贤者", @"追击者", @"偶像", @"求道者", @"作曲家", @"领悟", @"台风", @"羊之衣", @"舞台", @"暗鸦", @"退魔", @"古代王族", @"圣贤者", @"黄龙"]
#define RECIPT_SECTION5_1_SUB			@[@[@"皮帽", @"亚麻短裤", @"亚麻帽", @"皮手套", @"皮铠", @"亚麻手套", @"亚麻衣服", @"皮鞋", @"皮裤", @"亚麻鞋"],\
										@[@"暖场艺人方头巾", @"暖场艺人手环", @"暖场艺人衣服", @"暖场艺人长靴", @"暖场艺人长裤"],\
										@[@"新手艺人方头巾", @"新手艺人长靴", @"新手艺人长裤", @"新手艺人手套", @"新手艺人的衣服"],\
										@[@"剪柳头巾", @"剪柳鞋", @"剪柳紧身裤", @"剪柳手环", @"剪柳衣服"],\
										@[@"治愈帽", @"治愈长靴", @"治愈长裤", @"治愈衣服"],\
										@[@"射手帽", @"射手鞋", @"射手紧身裤", @"射手手套", @"射手衣服"],\
										@[@"丝织帽", @"丝织凉鞋", @"丝织长袍下装", @"丝织长袍上装"],\
										@[@"藏红花帽", @"藏红花长靴", @"藏红花长袍下装", @"藏红花手套", @"藏红花长袍上装"],\
										@[@"药师帽", @"药师鞋", @"药师长袍下装", @"药师长袍上装"],\
										@[@"初级魔法战士贝雷帽", @"初级魔法战士鞋", @"初级魔法战士紧身裤", @"初级魔法战士手套", @"初级魔法战士服"],\
										@[@"修炼头带", @"修炼长靴", @"修炼服下装", @"修炼护腕", @"修炼服上装"],\
										@[@"舞者头带", @"舞者鞋", @"舞者喇叭裤", @"舞者护腕", @"舞者衬衫"],\
										@[@"闪避帽", @"闪避之靴", @"闪避之衣下装", @"闪避之衣上装"],\
										@[@"学者帽", @"学者脚带", @"学者衣服下装", @"学者衣服上装"],\
										@[@"疾风头巾", @"疾风手套", @"疾风背心", @"疾风长靴", @"疾风马裤"],\
										@[@"魔术师头带", @"魔术师短靴", @"魔术师紧身裤", @"魔术师手套", @"魔术师衣服"],\
										@[@"功夫小帽", @"功夫鞋", @"功夫长裤", @"功夫护腕", @"功夫上衣"],\
										@[@"树叶帽", @"树叶长靴", @"树叶铠甲下装", @"树叶手环", @"树叶铠甲上装"],\
										@[@"斗牛士头带", @"斗牛士鞋", @"斗牛士衣服下装", @"斗牛士衣服上装", @"斗牛士手套"],\
										@[@"咒术师长头巾", @"咒术师鞋", @"咒术师长袍下装", @"咒术师长袍上装"],\
										@[@"守护帽", @"守护鞋", @"守护长袍"],\
										@[@"西部帽", @"西部长靴", @"西部短裤", @"西部手套", @"西部衬衫"],\
										@[@"神官帽", @"神官鞋", @"神官法衣下装", @"神官手套", @"神官法衣上装"],\
										@[@"森人帽", @"森人长靴", @"森人围裙", @"森人手套", @"森人背心"],\
										@[@"拳法脚带", @"拳法衣服下装", @"拳法腕带", @"拳法衣服上装"],\
										@[@"讲述者帽", @"讲述者长靴", @"讲述者衣服下装", @"讲述者手套", @"讲述者衣服上装"],\
										@[@"魔导士帽", @"魔导士鞋", @"魔导士衣服下装", @"魔导士衣服上装"],\
										@[@"祭司帽", @"祭司长靴", @"祭司手套", @"祭司法衣"],\
										@[@"神圣帽", @"神圣长靴", @"神圣长袍下装", @"神圣长袍上装"],\
										@[@"水之冠", @"水之脚带", @"水之羽衣下装", @"水之羽衣上装"],\
										@[@"击剑士帽", @"击剑士长靴", @"击剑士手环", @"击剑士披风"],\
										@[@"奇术师帽", @"奇术师长靴", @"奇术师裤子", @"奇术师手套", @"奇术师衣服"],\
										@[@"混混方头巾", @"混混背心", @"混混裤子", @"混混手环", @"混混长靴"],\
										@[@"占星术士长头巾", @"占星术士长靴", @"占星术士长袍下装", @"占星术士长袍上装"],\
										@[@"圣者帽", @"圣者手套", @"圣者长靴", @"圣者法衣"],\
										@[@"真理帽", @"真理长袍上装", @"真理长袍下装", @"真理鞋"],\
										@[@"知识帽子", @"知识凉鞋", @"知识长袍下装", @"知识长袍上装"],\
										@[@"大师帽", @"大师马甲", @"大师长裤", @"大师护腕", @"大师鞋"],\
										@[@"财宝帽", @"财宝手套", @"财宝长靴", @"财宝外衣下装", @"财宝外衣上装"],\
										@[@"月之冠", @"月之鞋", @"月之长袍上装", @"月之长袍下装"],\
										@[@"原始兽毛皮帽", @"原始兽长靴", @"原始兽外衣上装", @"原始兽外衣下装", @"原始兽手套"],\
										@[@"拳圣长头巾", @"拳圣鞋", @"拳圣道衣上装", @"拳圣道衣下装", @"拳圣手环"],\
										@[@"摩登兔发饰", @"摩登兔鞋", @"摩登兔上衣", @"摩登兔紧身裤", @"摩登兔荷叶裙", @"摩登兔手镯"],\
										@[@"王宫魔术师帽", @"王宫魔术师长袍上装", @"王宫魔术师长袍下装", @"王宫魔术师鞋"],\
										@[@"小丑帽", @"小丑背心", @"小丑长裤", @"小丑手套", @"小丑鞋"],\
										@[@"古代魔术帽", @"古代魔术手环", @"古代魔术法衣上装", @"古代魔术法衣下装", @"古代魔术长靴"],\
										@[@"奇迹帽", @"奇迹外衣上装", @"奇迹外衣下装", @"奇迹手套", @"奇迹靴子"],\
										@[@"古武道头巾", @"古武道衣服上装", @"古武道衣服下装", @"古武道手环", @"古武道长靴"],\
										@[@"大魔导帽", @"大魔导长袍上装", @"大魔导长袍下装", @"大魔导手环", @"大魔导鞋"],\
										@[@"大贤者僧帽", @"大贤者法衣", @"大贤者手套", @"大贤者鞋"],\
										@[@"追击者头带", @"追击者皮衣上装", @"追击者皮衣下装", @"追击者护手", @"追击者长靴"],\
										@[@"偶像头带", @"偶像衣服上装", @"偶像衣服下装", @"偶像手镯", @"偶像长靴"],\
										@[@"求道者头带", @"求道者道衣上装", @"求道者道衣下装", @"求道者手套", @"求道者长靴"],\
										@[@"作曲家头带", @"作曲家衣服上装", @"作曲家衣服下装", @"作曲家手镯", @"作曲家脚带"],\
										@[@"领悟头冠", @"领悟衣服", @"领悟手套", @"领悟长靴"],\
										@[@"台风护目镜", @"台风皮衣上装", @"台风皮衣下装", @"台风手套", @"台风长靴"],\
										@[@"羊之兜帽", @"羊之衣上装", @"羊之衣下装", @"羊之手套", @"羊之鞋"],\
										@[@"舞台头带", @"舞台芭蕾裙下装", @"舞台缎带", @"舞台护腕", @"舞台上衣", @"舞台护臂", @"舞台芭蕾裙上装", @"舞台鞋", @"舞台短裤", @"舞台长靴"],\
										@[@"暗鸦帽", @"暗鸦战衣", @"暗鸦护手", @"暗鸦靴"],\
										@[@"退魔帽", @"退魔法衣上装", @"退魔法衣下装", @"退魔手环", @"退魔鞋"],\
										@[@"古代王族长头巾", @"古代王族背心", @"古代王族裤子", @"古代王族护臂", @"古代王族靴"],\
										@[@"圣贤者僧帽", @"圣贤者长袍上装", @"圣贤者长袍下装", @"圣贤者护臂", @"圣贤者鞋"],\
										@[@"黄龙头带", @"黄龙手环", @"黄龙道衣", @"黄龙鞋"]]
#define RECIPT_SECTION5_1_SUB_IMAGE		@[@[@"Icon-皮帽", @"Icon-亚麻短裤", @"Icon-亚麻帽", @"Icon-皮手套", @"Icon-皮铠", @"Icon-亚麻手套", @"Icon-亚麻衣服", @"Icon-皮鞋", @"Icon-皮裤", @"Icon-亚麻鞋"],\
										@[@"Icon-暖场艺人方头巾", @"Icon-暖场艺人手环", @"Icon-暖场艺人衣服", @"Icon-暖场艺人长靴", @"Icon-暖场艺人长裤"],\
										@[@"Icon-新手艺人方头巾", @"Icon-新手艺人长靴", @"Icon-新手艺人长裤", @"Icon-新手艺人手套", @"Icon-新手艺人的衣服"],\
										@[@"Icon-剪柳头巾", @"Icon-剪柳鞋", @"Icon-剪柳紧身裤", @"Icon-剪柳手环", @"Icon-剪柳衣服"],\
										@[@"Icon-治愈帽", @"Icon-治愈长靴", @"Icon-治愈长裤", @"Icon-治愈衣服"],\
										@[@"Icon-射手帽", @"Icon-射手鞋", @"Icon-射手紧身裤", @"Icon-射手手套", @"Icon-射手衣服"],\
										@[@"Icon-丝织帽", @"Icon-丝织凉鞋", @"Icon-丝织长袍下装", @"Icon-丝织长袍上装"],\
										@[@"Icon-藏红花帽", @"Icon-藏红花长靴", @"Icon-藏红花长袍下装", @"Icon-藏红花手套", @"Icon-藏红花长袍上装"],\
										@[@"Icon-药师帽", @"Icon-药师鞋", @"Icon-药师长袍下装", @"Icon-药师长袍上装"],\
										@[@"Icon-初级魔法战士贝雷帽", @"Icon-初级魔法战士鞋", @"Icon-初级魔法战士紧身裤", @"Icon-初级魔法战士手套", @"Icon-初级魔法战士服"],\
										@[@"Icon-修炼头带", @"Icon-修炼长靴", @"Icon-修炼服下装", @"Icon-修炼护腕", @"Icon-修炼服上装"],\
										@[@"Icon-舞者头带", @"Icon-舞者鞋", @"Icon-舞者喇叭裤", @"Icon-舞者护腕", @"Icon-舞者衬衫"],\
										@[@"Icon-闪避帽", @"Icon-闪避之靴", @"Icon-闪避之衣下装", @"Icon-闪避之衣上装"],\
										@[@"Icon-学者帽", @"Icon-学者脚带", @"Icon-学者衣服下装", @"Icon-学者衣服上装"],\
										@[@"Icon-疾风头巾", @"Icon-疾风手套", @"Icon-疾风背心", @"Icon-疾风长靴", @"Icon-疾风马裤"],\
										@[@"Icon-魔术师头带", @"Icon-魔术师短靴", @"Icon-魔术师紧身裤", @"Icon-魔术师手套", @"Icon-魔术师衣服"],\
										@[@"Icon-功夫小帽", @"Icon-功夫鞋", @"Icon-功夫长裤", @"Icon-功夫护腕", @"Icon-功夫上衣"],\
										@[@"Icon-树叶帽", @"Icon-树叶长靴", @"Icon-树叶铠甲下装", @"Icon-树叶手环", @"Icon-树叶铠甲上装"],\
										@[@"Icon-斗牛士头带", @"Icon-斗牛士鞋", @"Icon-斗牛士衣服下装", @"Icon-斗牛士衣服上装", @"Icon-斗牛士手套"],\
										@[@"Icon-咒术师长头巾", @"Icon-咒术师鞋", @"Icon-咒术师长袍下装", @"Icon-咒术师长袍上装"],\
										@[@"Icon-守护帽", @"Icon-守护鞋", @"Icon-守护长袍"],\
										@[@"Icon-西部帽", @"Icon-西部长靴", @"Icon-西部短裤", @"Icon-西部手套", @"Icon-西部衬衫"],\
										@[@"Icon-神官帽", @"Icon-神官鞋", @"Icon-神官法衣下装", @"Icon-神官手套", @"Icon-神官法衣上装"],\
										@[@"Icon-森人帽", @"Icon-森人长靴", @"Icon-森人围裙", @"Icon-森人手套", @"Icon-森人背心"],\
										@[@"Icon-拳法脚带", @"Icon-拳法衣服下装", @"Icon-拳法腕带", @"Icon-拳法衣服上装"],\
										@[@"Icon-讲述者帽", @"Icon-讲述者长靴", @"Icon-讲述者衣服下装", @"Icon-讲述者手套", @"Icon-讲述者衣服上装"],\
										@[@"Icon-魔导士帽", @"Icon-魔导士鞋", @"Icon-魔导士衣服下装", @"Icon-魔导士衣服上装"],\
										@[@"Icon-祭司帽", @"Icon-祭司长靴", @"Icon-祭司手套", @"Icon-祭司法衣"],\
										@[@"Icon-神圣帽", @"Icon-神圣长靴", @"Icon-神圣长袍下装", @"Icon-神圣长袍上装"],\
										@[@"Icon-水之冠", @"Icon-水之脚带", @"Icon-水之羽衣下装", @"Icon-水之羽衣上装"],\
										@[@"Icon-击剑士帽", @"Icon-击剑士长靴", @"Icon-击剑士手环", @"Icon-击剑士披风"],\
										@[@"Icon-奇术师帽", @"Icon-奇术师长靴", @"Icon-奇术师裤子", @"Icon-奇术师手套", @"Icon-奇术师衣服"],\
										@[@"Icon-混混方头巾", @"Icon-混混背心", @"Icon-混混裤子", @"Icon-混混手环", @"Icon-混混长靴"],\
										@[@"Icon-占星术士长头巾", @"Icon-占星术士长靴", @"Icon-占星术士长袍下装", @"Icon-占星术士长袍上装"],\
										@[@"Icon-圣者帽", @"Icon-圣者手套", @"Icon-圣者长靴", @"Icon-圣者法衣"],\
										@[@"Icon-真理帽", @"Icon-真理长袍上装", @"Icon-真理长袍下装", @"Icon-真理鞋"],\
										@[@"Icon-知识帽子", @"Icon-知识凉鞋", @"Icon-知识长袍下装", @"Icon-知识长袍上装"],\
										@[@"Icon-大师帽", @"Icon-大师马甲", @"Icon-大师长裤", @"Icon-大师护腕", @"Icon-大师鞋"],\
										@[@"Icon-财宝帽", @"Icon-财宝手套", @"Icon-财宝长靴", @"Icon-财宝外衣下装", @"Icon-财宝外衣上装"],\
										@[@"Icon-月之冠", @"Icon-月之鞋", @"Icon-月之长袍上装", @"Icon-月之长袍下装"],\
										@[@"Icon-原始兽毛皮帽", @"Icon-原始兽长靴", @"Icon-原始兽外衣上装", @"Icon-原始兽外衣下装", @"Icon-原始兽手套"],\
										@[@"Icon-拳圣长头巾", @"Icon-拳圣鞋", @"Icon-拳圣道衣上装", @"Icon-拳圣道衣下装", @"Icon-拳圣手环"],\
										@[@"Icon-摩登兔发饰", @"Icon-摩登兔鞋", @"Icon-摩登兔上衣", @"Icon-摩登兔紧身裤", @"Icon-摩登兔荷叶裙", @"Icon-摩登兔手镯"],\
										@[@"Icon-王宫魔术师帽", @"Icon-王宫魔术师长袍上装", @"Icon-王宫魔术师长袍下装", @"Icon-王宫魔术师鞋"],\
										@[@"Icon-小丑帽", @"Icon-小丑背心", @"Icon-小丑长裤", @"Icon-小丑手套", @"Icon-小丑鞋"],\
										@[@"Icon-古代魔术帽", @"Icon-古代魔术手环", @"Icon-古代魔术法衣上装", @"Icon-古代魔术法衣下装", @"Icon-古代魔术长靴"],\
										@[@"Icon-奇迹帽", @"Icon-奇迹外衣上装", @"Icon-奇迹外衣下装", @"Icon-奇迹手套", @"Icon-奇迹靴子"],\
										@[@"Icon-古武道头巾", @"Icon-古武道衣服上装", @"Icon-古武道衣服下装", @"Icon-古武道手环", @"Icon-古武道长靴"],\
										@[@"Icon-大魔导帽", @"Icon-大魔导长袍上装", @"Icon-大魔导长袍下装", @"Icon-大魔导手环", @"Icon-大魔导鞋"],\
										@[@"Icon-大贤者僧帽", @"Icon-大贤者法衣", @"Icon-大贤者手套", @"Icon-大贤者鞋"],\
										@[@"Icon-追击者头带", @"Icon-追击者皮衣上装", @"Icon-追击者皮衣下装", @"Icon-追击者护手", @"Icon-追击者长靴"],\
										@[@"Icon-偶像头带", @"Icon-偶像衣服上装", @"Icon-偶像衣服下装", @"Icon-偶像手镯", @"Icon-偶像长靴"],\
										@[@"Icon-求道者头带", @"Icon-求道者道衣上装", @"Icon-求道者道衣下装", @"Icon-求道者手套", @"Icon-求道者长靴"],\
										@[@"Icon-作曲家头带", @"Icon-作曲家衣服上装", @"Icon-作曲家衣服下装", @"Icon-作曲家手镯", @"Icon-作曲家脚带"],\
										@[@"Icon-领悟头冠", @"Icon-领悟衣服", @"Icon-领悟手套", @"Icon-领悟长靴"],\
										@[@"Icon-台风护目镜", @"Icon-台风皮衣上装", @"Icon-台风皮衣下装", @"Icon-台风手套", @"Icon-台风长靴"],\
										@[@"Icon-羊之兜帽", @"Icon-羊之衣上装", @"Icon-羊之衣下装", @"Icon-羊之手套", @"Icon-羊之鞋"],\
										@[@"Icon-舞台头带", @"Icon-舞台芭蕾裙下装", @"Icon-舞台缎带", @"Icon-舞台护腕", @"Icon-舞台上衣", @"Icon-舞台护臂", @"Icon-舞台芭蕾裙上装", @"Icon-舞台鞋", @"Icon-舞台短裤", @"Icon-舞台长靴"],\
										@[@"Icon-暗鸦帽", @"Icon-暗鸦战衣", @"Icon-暗鸦护手", @"Icon-暗鸦靴"],\
										@[@"Icon-退魔帽", @"Icon-退魔法衣上装", @"Icon-退魔法衣下装", @"Icon-退魔手环", @"Icon-退魔鞋"],\
										@[@"Icon-古代王族长头巾", @"Icon-古代王族背心", @"Icon-古代王族裤子", @"Icon-古代王族护臂", @"Icon-古代王族靴"],\
										@[@"Icon-圣贤者僧帽", @"Icon-圣贤者长袍上装", @"Icon-圣贤者长袍下装", @"Icon-圣贤者护臂", @"Icon-圣贤者鞋"],\
										@[@"Icon-黄龙头带", @"Icon-黄龙手环", @"Icon-黄龙道衣", @"Icon-黄龙鞋"]]
//裁缝－家具配方
#define RECIPT_SECTION5_2               @[@"家具配方"]
#define RECIPT_SECTION5_2_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION5_2_SUB_IMAGE		@[@[@""]]
//烹饪－肉料理配方
#define RECIPT_SECTION6_1               @[@"肉料理配方"]
#define RECIPT_SECTION6_1_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION6_1_SUB_IMAGE		@[@[@""]]
//烹饪－鱼料理配方
#define RECIPT_SECTION6_2               @[@"鱼料理配方"]
#define RECIPT_SECTION6_2_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION6_2_SUB_IMAGE		@[@[@""]]
//烹饪－意面和米饭配方
#define RECIPT_SECTION6_3               @[@"意面和米饭配方"]
#define RECIPT_SECTION6_3_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION6_3_SUB_IMAGE		@[@[@""]]
//烹饪－甜点配方
#define RECIPT_SECTION6_4               @[@"甜点配方"]
#define RECIPT_SECTION6_4_SUB			@[@[@"暂无数据"]]
#define RECIPT_SECTION6_4_SUB_IMAGE		@[@[@""]]


//配方详细数据
#define RECIPT_DETAIL @"铜矿石,3,0,0,0,0,0,0,0,0",@"铜剑",\
@"铜矿石,3,铁矿石,1,0,0,0,0,0,0",@"青铜剑",\
@"铁矿石,3,斩风羽,1,0,0,0,0,0,0",@"细剑",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"铁剑",\
@"铁矿石,4,野兽原皮,2,0,0,0,0,0,0",@"占山军刀",\
@"银矿石,3,铁矿石,2,0,0,0,0,0,0",@"银制细剑",\
@"银矿石,4,红色宝石,1,0,0,0,0,0,0",@"手半剑",\
@"银矿石,4,铜矿石,3,蓝色宝石,1,0,0,0,0",@"钢铁之剑",\
@"银矿石,5,铁矿石,2,研磨砂,5,0,0,0,0",@"西部细剑",\
@"银矿石,6,铁矿石,4,魔兽原角,1,0,0,0,0",@"战士之剑",\
@"银矿石,6,热乎乎的石头,3,红色宝石,1,妖精的火种,2,0,0",@"破邪之剑",\
@"银矿石,6,时之水晶,1,金属碎片,1,妖精的火种,3,0,0",@"隼之剑",\
@"白金矿石,4,魔兽原骨,1,红浆果,3,妖精的火种,4,0,0",@"白金剑",\
@"白金矿石,5,妖异草,2,暗黑树木,2,妖精的火种,5,0,0",@"魔剑士细剑",\
@"白金矿石,6,圣者之灰,1,黄色之眼,1,妖精的火种,6,0,0",@"斩尸剑",\
@"白金矿石,8,龙的原骨,2,红色之眼,4,妖精的火种,8,0,0",@"斩龙剑",\
@"白金矿石,20,熔岩碎片,60,红色宝珠,3,妖精的火种,16,0,0",@"火焰剑",\
@"白金矿石,25,净化之水,60,蓝色宝珠,3,妖精的火种,16,0,0",@"奇迹之剑",\
@"光之石,30,龙的原角,5,汗与泪的结晶,20,金属碎片,3,妖精的火种,20",@"金属史莱姆之剑",\
@"幻魔石,6,脏绷带,60,汗与泪的结晶,20,紫色宝珠,6,妖精的火种,20",@"缟玛瑙魔剑",\
@"星之碎片,40,冰的结晶,40,汗与泪的结晶,30,绿色宝珠,10,妖精的火种,24",@"星尘之剑",\
@"幻兽原骨,5,黄金装饰单手剑,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之剑",\
@"赤光结晶,50,金属碎片,5,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"雷霆之剑",\
@"镜之石,50,重金属,30,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"名刀斩铁丸",\
@"赤光结晶,50,圣者之灰,10,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"天命之剑",\
@"光之石,4,祈晴竹叶,12,0,0,0,0,0,0",@"七夕之剑",\
@"铜矿石,3,0,0,0,0,0,0,0,0",@"铜制大剑",\
@"铜矿石,3,铁矿石,1,0,0,0,0,0,0",@"青铜大剑",\
@"铜矿石,3,大甲壳,1,0,0,0,0,0,0",@"巨刃",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"铁制大剑",\
@"铁矿石,4,黑珍珠,1,0,0,0,0,0,0",@"巨刃Ⅱ",\
@"铁矿石,5,研磨砂,2,0,0,0,0,0,0",@"夜影大剑",\
@"铁矿石,6,利爪,4,0,0,0,0,0,0",@"巨剪",\
@"银矿石,4,铜矿石,3,蓝色宝石,1,0,0,0,0",@"钢铁大剑",\
@"银矿石,5,魔兽原骨,2,樱花花瓣,3,0,0,0,0",@"退魔太刀",\
@"银矿石,6,魔力之土,3,红浆果,3,0,0,0,0",@"血腥之刃",\
@"银矿石,6,铜矿石,8,黄色宝石,1,妖精的火种,2,0,0",@"新月大剑",\
@"银矿石,6,夜之幕,2,樱花花瓣,6,妖精的火种,3,0,0",@"斩夜太刀",\
@"白金矿石,4,铁矿石,5,镜之石,2,妖精的火种,4,0,0",@"白金大剑",\
@"白金矿石,6,圣者之灰,1,红色之眼,1,妖精的火种,6,0,0",@"恶魔大剑",\
@"白金矿石,8,龙的原皮,2,绿色之眼,4,妖精的火种,8,0,0",@"灭龙剑",\
@"白金矿石,20,重金属,6,黄色宝珠,3,妖精的火种,16,0,0",@"君王大剑",\
@"白金矿石,25,熔岩碎片,60,绿色宝珠,3,妖精的火种,16,0,0",@"大狱剑",\
@"光之石,30,大贝壳,60,汗与泪的结晶,20,金属碎片,3,妖精的火种,20",@"金属史莱姆大剑",\
@"光之石,35,天使的神酒,3,汗与泪的结晶,20,绿色宝珠,6,妖精的火种,20",@"天马大剑",\
@"光之石,40,武道精华,4,汗与泪的结晶,30,黄色宝珠,10,妖精的火种,24",@"源力大剑",\
@"赤光结晶,40,黄金装饰双手剑,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之大剑",\
@"赤光结晶,50,幻兽原骨,5,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"帝国大剑",\
@"赤光结晶,50,熔岩碎片,80,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"混沌大剑",\
@"赤光结晶,50,精灵石,50,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"翠石大剑",\
@"星之碎片,4,繁星的眼泪,12,0,0,0,0,0,0",@"繁星大剑",\
@"铜矿石,3,0,0,0,0,0,0,0,0",@"青铜短刀",\
@"铜矿石,3,净化之水,1,0,0,0,0,0,0",@"神圣短刀",\
@"铜矿石,3,毒蛾鳞粉,1,0,0,0,0,0,0",@"毒蛾短刀",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"响马短刀",\
@"铁矿石,4,利齿,5,0,0,0,0,0,0",@"刺客匕首",\
@"银矿石,3,铁矿石,2,0,0,0,0,0,0",@"银制短剑",\
@"银矿石,4,毒毒淤泥,5,0,0,0,0,0,0",@"毒针",\
@"银矿石,4,蝙蝠翅膀,2,妖异草,1,0,0,0,0",@"小恶魔短刀",\
@"银矿石,5,铁矿石,3,利爪,6,0,0,0,0",@"鹰之匕首",\
@"银矿石,6,毒蛾鳞粉,2,夜之幕,1,0,0,0,0",@"夜蝶短剑",\
@"银矿石,6,铁矿石,4,重金属,1,妖精的火种,2,0,0",@"破剑之刃",\
@"银矿石,6,时之水晶,1,金属碎片,1,妖精的火种,3,0,0",@"穿刺耳环",\
@"白金矿石,4,冰的结晶,3,蓝色宝石,1,妖精的火种,4,0,0",@"冰刃",\
@"白金矿石,6,红珊瑚,3,黄色之眼,1,妖精的火种,6,0,0",@"古斗士短剑",\
@"白金矿石,8,龙的原骨,1,红色之眼,4,妖精的火种,8,0,0",@"血针",\
@"白金矿石,20,美丽蘑菇,60,红色宝珠,3,妖精的火种,16,0,0",@"王家短刀",\
@"白金矿石,25,热乎乎的石头,60,红色宝珠,3,妖精的火种,16,0,0",@"沙罗曼蛇",\
@"白金矿石,30,斩风羽,5,汗与泪的结晶,20,蓝色宝珠,5,妖精的火种,20",@"猎鹰匕首",\
@"冰的结晶,35,利爪,50,汗与泪的结晶,20,黄色宝珠,6,妖精的火种,20",@"寒风匕首",\
@"镜之石,40,斩风羽,5,汗与泪的结晶,30,绿色宝珠,10,妖精的火种,24",@"千刺匕首",\
@"赤光结晶,40,黄金装饰短剑,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之短刀",\
@"赤光结晶,60,大贝壳,80,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"雷霆匕首",\
@"幻兽原骨,5,毒毒淤泥,80,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"剧毒鳞刃",\
@"赤光结晶,60,研磨砂,80,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"水晶之刃",\
@"铜矿石,2,铁矿石,1,0,0,0,0,0,0",@"青铜矛",\
@"铁矿石,2,利齿,3,0,0,0,0,0,0",@"长矛",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"铁矛",\
@"铁矿石,4,结实的树枝,3,0,0,0,0,0,0",@"近卫兵矛",\
@"铁矿石,5,净化之水,3,0,0,0,0,0,0",@"神圣之矛",\
@"铁矿石,6,草原木头,5,0,0,0,0,0,0",@"战叉",\
@"银矿石,4,铜矿石,3,蓝色宝石,1,0,0,0,0",@"钢铁之矛",\
@"银矿石,5,雷鸣珠,1,魔兽原角,1,0,0,0,0",@"闪电之矛",\
@"银矿石,6,柔韧的树枝,3,利齿,3,0,0,0,0",@"游击之矛",\
@"银矿石,6,研磨砂,4,猫砂,2,妖精的火种,2,0,0",@"沙尘之矛",\
@"银矿石,6,涟漪之露,3,大贝壳,3,妖精的火种,3,0,0",@"古拉柯斯之矛",\
@"白金矿石,4,银矿石,5,蓝色宝石,1,妖精的火种,4,0,0",@"白金矛",\
@"白金矿石,6,雷鸣珠,1,紫色之眼,1,妖精的火种,6,0,0",@"雷神之矛",\
@"白金矿石,8,暗黑树木,3,蓝色之眼,4,妖精的火种,8,0,0",@"恶魔之矛",\
@"白金矿石,20,红珊瑚,60,紫色宝珠,3,妖精的火种,16,0,0",@"海洋之叉",\
@"白金矿石,25,圣者之灰,3,红色宝珠,3,妖精的火种,16,0,0",@"英雄之矛",\
@"光之石,30,研磨砂,60,汗与泪的结晶,20,金属碎片,3,妖精的火种,20",@"金属史莱姆之矛",\
@"精灵石,6,圣者之灰,3,汗与泪的结晶,20,绿色宝珠,6,妖精的火种,20",@"圣骑士之矛",\
@"大贝壳,60,龙的原角,4,汗与泪的结晶,30,蓝色宝珠,10,妖精的火种,24",@"鬼神魔枪",\
@"幻兽原骨,5,黄金装饰矛,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之矛",\
@"赤光结晶,50,天使的神酒,8,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"炽天使之矛",\
@"赤光结晶,50,脏绷带,80,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"血腥之矛",\
@"赤光结晶,50,光之石,80,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"雅典娜圣枪",\
@"铜矿石,3,0,0,0,0,0,0,0,0",@"铜斧",\
@"铜矿石,2,铁矿石,1,0,0,0,0,0,0",@"青铜斧",\
@"铁矿石,3,野兽原皮,1,0,0,0,0,0,0",@"占山斧",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"铁斧",\
@"铁矿石,4,柔韧的树枝,4,0,0,0,0,0,0",@"轻斧",\
@"银矿石,3,铁矿石,2,0,0,0,0,0,0",@"银之斧",\
@"银矿石,4,重金属,2,0,0,0,0,0,0",@"战斧",\
@"银矿石,4,铜矿石,3,红色宝石,1,0,0,0,0",@"钢铁之斧",\
@"银矿石,5,多瓦切卡油,4,绿色宝石,1,0,0,0,0",@"卡尔萨多拉之斧",\
@"银矿石,6,镜之石,3,黄色宝石,1,0,0,0,0",@"月之斧",\
@"银矿石,6,幻魔石,1,利爪,3,妖精的火种,2,0,0",@"达人之斧",\
@"银矿石,6,魔兽原皮,1,幻魔石,1,妖精的火种,3,0,0",@"君王之斧",\
@"白金矿石,4,黑珍珠,1,夜之幕,1,妖精的火种,4,0,0",@"日蚀之斧",\
@"白金矿石,6,幻魔石,1,紫色之眼,1,妖精的火种,6,0,0",@"萨满之斧",\
@"白金矿石,8,冰之树木,3,蓝色之眼,4,妖精的火种,8,0,0",@"风雪之斧",\
@"白金矿石,20,幻魔石,12,绿色宝珠,3,妖精的火种,16,0,0",@"凯撒之斧",\
@"白金矿石,25,红浆果,60,黄色宝珠,3,妖精的火种,16,0,0",@"毁灭者",\
@"幻魔石,5,大块原骨,60,汗与泪的结晶,20,紫色宝珠,5,妖精的火种,20",@"霸者之斧",\
@"星之碎片,35,小鳞片,60,汗与泪的结晶,20,蓝色宝珠,6,妖精的火种,20",@"巨斧",\
@"大甲壳,40,武道精华,4,汗与泪的结晶,30,绿色宝珠,10,妖精的火种,24",@"粉碎砍刀",\
@"赤光结晶,40,黄金装饰斧,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之斧",\
@"赤光结晶,50,熔岩碎片,80,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"阿波罗之斧",\
@"赤光结晶,50,重金属,30,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"公爵之斧",\
@"赤光结晶,50,草原之水,80,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"雪崩之斧",\
@"铜矿石,3,0,0,0,0,0,0,0,0",@"铜爪",\
@"铜矿石,2,铁矿石,1,0,0,0,0,0,0",@"青铜爪",\
@"铁矿石,2,猫砂,1,0,0,0,0,0,0",@"猫爪",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"铁爪",\
@"铁矿石,4,光之石,1,0,0,0,0,0,0",@"驱魔之爪",\
@"银矿石,3,铁矿石,2,0,0,0,0,0,0",@"白银爪",\
@"银矿石,4,蝴蝶翅膀,2,0,0,0,0,0,0",@"小恶魔之爪",\
@"银矿石,4,铜矿石,3,野兽原皮,2,0,0,0,0",@"钢铁之爪",\
@"银矿石,5,利爪,4,猫砂,2,0,0,0,0",@"黑豹之爪",\
@"银矿石,6,斩风羽,2,利爪,4,0,0,0,0",@"隼爪",\
@"银矿石,6,熔岩碎片,2,热乎乎的石头,2,妖精的火种,2,0,0",@"火焰之爪",\
@"银矿石,6,冰的结晶,2,冰之树木,2,妖精的火种,3,0,0",@"冰爪",\
@"白金矿石,4,黄色宝石,1,重金属,1,妖精的火种,4,0,0",@"白金爪",\
@"白金矿石,6,毒毒淤泥,4,紫色之眼,1,妖精的火种,6,0,0",@"恶魔之爪",\
@"白金矿石,8,龙的原角,2,蓝色之眼,4,妖精的火种,8,0,0",@"龙爪",\
@"白金矿石,20,武道精华,12,红色宝珠,3,妖精的火种,16,0,0",@"古武道之爪",\
@"白金矿石,25,魔兽原角,12,黄色宝珠,3,妖精的火种,16,0,0",@"魔兽之爪",\
@"幻魔石,5,蛇蜕,60,汗与泪的结晶,20,红色宝珠,5,妖精的火种,20",@"猎鹰之爪",\
@"幻魔石,6,魔兽原角,12,汗与泪的结晶,20,绿色宝珠,6,妖精的火种,20",@"冥兽之爪",\
@"幻魔石,6,龙的原角,4,汗与泪的结晶,30,红色宝珠,10,妖精的火种,24",@"龙王之爪",\
@"幻兽原骨,5,黄金装饰爪,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之爪",\
@"赤光结晶,50,光之石,80,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"水晶爪",\
@"赤光结晶,50,红珊瑚,80,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"船长钩爪",\
@"赤光结晶,50,精灵石,50,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"苍炎之爪",\
@"铁矿石,2,丝草,1,0,0,0,0,0,0",@"战斗缎带",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"铁鞭",\
@"铁矿石,4,蛇蜕,1,0,0,0,0,0,0",@"蛇皮鞭",\
@"银矿石,3,妖异草,1,0,0,0,0,0,0",@"蔷薇鞭",\
@"银矿石,4,刺海胆,3,0,0,0,0,0,0",@"星球鞭",\
@"银矿石,4,铜矿石,3,野兽原皮,2,0,0,0,0",@"钢铁之鞭",\
@"银矿石,5,蛇蜕,2,毒毒淤泥,2,0,0,0,0",@"锦蛇鞭",\
@"银矿石,6,妖异草,2,七色茧,1,0,0,0,0",@"魅惑缎带",\
@"银矿石,6,野兽原皮,2,魔兽原角,1,妖精的火种,2,0,0",@"野兽鞭",\
@"银矿石,6,蛇蜕,1,利齿,3,妖精的火种,3,0,0",@"响尾蛇鞭",\
@"白金矿石,4,幻魔石,1,毒蛾鳞粉,1,妖精的火种,4,0,0",@"蝎尾鞭",\
@"白金矿石,6,魔兽原皮,3,紫色之眼,1,妖精的火种,6,0,0",@"爆裂之鞭",\
@"白金矿石,8,龙的原角,1,绿色之眼,4,妖精的火种,8,0,0",@"龙尾鞭",\
@"白金矿石,20,脏绷带,60,紫色宝珠,3,妖精的火种,16,0,0",@"恶魔之鞭",\
@"白金矿石,25,魔力之土,60,蓝色宝珠,3,妖精的火种,16,0,0",@"卡尔贝罗鞭",\
@"镜之石,30,冰之树木,60,汗与泪的结晶,20,红色宝珠,5,妖精的火种,20",@"海蛇之鞭",\
@"镜之石,35,妖异草,60,汗与泪的结晶,20,绿色宝珠,6,妖精的火种,20",@"女王之鞭",\
@"幻魔石,6,蛇蜕,60,汗与泪的结晶,30,紫色宝珠,10,妖精的火种,24",@"魔神之鞭",\
@"赤光结晶,40,黄金装饰鞭,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之鞭",\
@"赤光结晶,50,蛇蜕,80,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"三叉戟鞭",\
@"赤光结晶,50,冰的结晶,80,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"冰封之鞭",\
@"赤光结晶,50,重金属,30,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"锚鞭",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"青铜槌",\
@"铁矿石,3,利齿,2,0,0,0,0,0,0",@"铁棒",\
@"铁矿石,4,重金属,1,0,0,0,0,0,0",@"大槌",\
@"银矿石,3,铁矿石,2,0,0,0,0,0,0",@"银槌",\
@"银矿石,4,蓝色宝石,1,0,0,0,0,0,0",@"战锤",\
@"银矿石,4,铜矿石,3,腌菜石,3,0,0,0,0",@"钢铁之槌",\
@"银矿石,5,武道精华,2,魔兽原骨,1,0,0,0,0",@"战斗圆头锤",\
@"银矿石,6,奥古力德化石角,4,利爪,4,0,0,0,0",@"鬼棒",\
@"银矿石,6,魔兽原角,1,利齿,6,妖精的火种,2,0,0",@"碎骨锤",\
@"银矿石,6,魔兽原骨,1,幻魔石,1,妖精的火种,3,0,0",@"魔法锤",\
@"白金矿石,4,大甲壳,2,精灵石,1,妖精的火种,4,0,0",@"白金锤",\
@"白金矿石,6,冰之树木,4,蓝色之眼,1,妖精的火种,6,0,0",@"冰原之锤",\
@"白金矿石,8,熔岩碎片,5,红色之眼,4,妖精的火种,8,0,0",@"火山锤",\
@"白金矿石,20,星之碎片,60,绿色宝珠,3,妖精的火种,16,0,0",@"巨锤",\
@"白金矿石,25,大块原骨,60,蓝色宝珠,3,妖精的火种,16,0,0",@"巨人锤",\
@"热乎乎的石头,30,神奇泥浆,60,汗与泪的结晶,20,红色宝珠,5,妖精的火种,20",@"哥顿锤",\
@"重金属,6,大块原骨,60,汗与泪的结晶,20,紫色宝珠,6,妖精的火种,20",@"百万吨重锤",\
@"精灵石,4,魔兽原角,8,汗与泪的结晶,30,蓝色宝珠,10,妖精的火种,24",@"魔神之槌",\
@"幻兽原骨,5,黄金装饰锤,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之锤",\
@"幻兽原骨,5,小块化石,80,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"天崩地裂",\
@"赤光结晶,50,研磨砂,80,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"巴雷特锤",\
@"赤光结晶,50,天使的神酒,10,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"天使铁锤",\
@"铜矿石,2,铁矿石,1,0,0,0,0,0,0",@"青铜回旋镖",\
@"铁矿石,2,研磨砂,2,0,0,0,0,0,0",@"利刃回旋镖",\
@"铁矿石,3,利爪,1,0,0,0,0,0,0",@"铁翼回旋镖",\
@"铁矿石,4,红浆果,4,0,0,0,0,0,0",@"十字回旋镖",\
@"银矿石,3,镜之石,2,0,0,0,0,0,0",@"白银回旋镖",\
@"银矿石,4,光之石,3,0,0,0,0,0,0",@"翼之刃",\
@"银矿石,4,铜矿石,4,大块原骨,4,0,0,0,0",@"钢铁回旋镖",\
@"银矿石,5,镜之石,3,斩风羽,1,0,0,0,0",@"风之回旋镖",\
@"银矿石,6,蝙蝠翅膀,4,樱花花瓣,4,0,0,0,0",@"忍者回旋镖",\
@"银矿石,6,幻魔石,2,绿色宝石,1,妖精的火种,2,0,0",@"魔法回旋镖",\
@"银矿石,6,重金属,2,斩风羽,2,妖精的火种,3,0,0",@"双翼回旋镖",\
@"白金矿石,4,精灵石,3,大贝壳,3,妖精的火种,4,0,0",@"白金回旋镖",\
@"白金矿石,6,冰的结晶,3,蓝色之眼,1,妖精的火种,6,0,0",@"寒冰回旋镖",\
@"白金矿石,8,熔岩碎片,8,红色之眼,4,妖精的火种,8,0,0",@"火焰回旋镖",\
@"白金矿石,20,斩风羽,12,绿色宝珠,3,妖精的火种,16,0,0",@"黑鹰回旋镖",\
@"白金矿石,25,星之碎片,60,红色宝珠,3,妖精的火种,16,0,0",@"南十字星",\
@"光之石,30,脏绷带,60,汗与泪的结晶,20,金属碎片,3,妖精的火种,20",@"金属之翼",\
@"光之石,35,金块,1,汗与泪的结晶,20,黄色宝珠,6,妖精的火种,20",@"五芒星",\
@"星之碎片,40,斩风羽,5,汗与泪的结晶,30,紫色宝珠,10,妖精的火种,24",@"流星之刃",\
@"赤光结晶,40,黄金装饰回旋镖,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之回旋镖",\
@"金属碎片,6,利爪,80,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,44",@"蓝色猎鹰",\
@"赤光结晶,50,精灵石,30,汗与泪的结晶,90,彩虹宝珠,4,妖精的火种,50",@"三尖回旋镖",\
@"赤光结晶,50,星之碎片,80,汗与泪的结晶,90,彩虹宝珠,6,妖精的火种,50",@"暗黑之星",\
@"星之碎片,4,祈晴竹叶,12,0,0,0,0,0,0",@"天文望远镜·茶",\
@"铜矿石,16,繁星的眼泪,12,0,0,0,0,0,0",@"怀旧电风扇",\
@"银矿石,4,祈晴竹叶,12,0,0,0,0,0,0",@"天文仪·银",\
@"银矿石,4,繁星的眼泪,12,0,0,0,0,0,0",@"银河风铃·白",\
@"铜矿石,3,0,0,0,0,0,0,0,0",@"青铜盾",\
@"铜矿石,3,柔软的树枝,2,0,0,0,0,0,0",@"轻圆盾",\
@"铁矿石,3,史莱姆时尚花,1,0,0,0,0,0,0",@"史莱姆托盘",\
@"铁矿石,3,银矿石,2,0,0,0,0,0,0",@"白银托盘",\
@"铁矿石,4,利齿,4,0,0,0,0,0,0",@"小鬼圆盾",\
@"银矿石,3,大贝壳,2,纯白木头,2,0,0,0,0",@"纯白圆盾",\
@"银矿石,4,史莱姆时尚花,2,史莱姆果冻,1,0,0,0,0",@"史莱姆贝斯托盘",\
@"银矿石,6,魔力之土,3,蓝色宝石,1,0,0,0,0",@"魔法盾",\
@"银矿石,6,大块原骨,3,蓝色宝石,1,妖精的火种,2,0,0",@"鸢盾",\
@"银矿石,6,大块化石,3,绿苔,3,妖精的火种,3,0,0",@"封魔盾",\
@"白金矿石,4,镜之石,3,水之树木,2,妖精的火种,4,0,0",@"白金托盘",\
@"白金矿石,6,花斑蛛丝,5,红色之眼,1,妖精的火种,6,0,0",@"鬼蜘蛛盾",\
@"白金矿石,8,魔兽原皮,3,红色之眼,4,妖精的火种,8,0,0",@"露夫盾",\
@"白金矿石,20,镜之石,30,蓝色宝珠,3,妖精的火种,16,0,0",@"水镜之盾",\
@"白金矿石,25,魔力之土,60,绿色宝珠,3,妖精的火种,16,0,0",@"符文圆盾",\
@"光之石,30,小贝壳,60,汗与泪的结晶,20,金属碎片,3,妖精的火种,20",@"金属史莱姆之盾",\
@"赤光结晶,40,黄金装饰盾,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之盾",\
@"赤光结晶,50,圣者之灰,8,汗与泪的结晶,80,彩虹宝珠,3,妖精的火种,40",@"圣女之盾",\
@"铁矿石,3,铜矿石,2,0,0,0,0,0,0",@"铁制大盾",\
@"银矿石,3,铜矿石,3,研磨砂,2,0,0,0,0",@"钢铁大盾",\
@"银矿石,6,纯白木头,3,红浆果,3,妖精的火种,2,0,0",@"战士大盾",\
@"白金矿石,6,万年雪,4,绿色之眼,1,妖精的火种,6,0,0",@"白金盾",\
@"白金矿石,8,龙的原角,2,黄色之眼,4,妖精的火种,8,0,0",@"龙盾",\
@"白金矿石,25,天籁之蜜,60,黄色宝珠,3,妖精的火种,16,0,0",@"头领大盾",\
@"精灵石,5,研磨砂,60,汗与泪的结晶,20,黄色宝珠,5,妖精的火种,20",@"圣骑士的大盾",\
@"白金矿石,35,魔兽原皮,4,汗与泪的结晶,20,绿色宝珠,6,妖精的火种,20",@"巨魔盾",\
@"幻魔石,6,金属碎片,4,汗与泪的结晶,30,红色宝珠,10,妖精的火种,24",@"邪眼大盾",\
@"赤光结晶,40,黄金装饰盾,1,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,32",@"圣王之大盾",\
@"赤光结晶,50,精灵石,30,汗与泪的结晶,80,彩虹宝珠,3,妖精的火种,40",@"乌尔贝阿大盾",\
@"精灵石,50,万年雪,80,汗与泪的结晶,80,彩虹宝珠,5,妖精的火种,40",@"天青石大盾",\
@"铜矿石,2,铁矿石,1,0,0,0,0,0,0",@"青铜头盔",\
@"铁矿石,1,小鳞片,1,0,0,0,0,0,0",@"鳞盔",\
@"铁矿石,3,小块原骨,2,0,0,0,0,0,0",@"铁制护额",\
@"铁矿石,3,研磨砂,2,0,0,0,0,0,0",@"锁链护额",\
@"铁矿石,4,研磨砂,1,0,0,0,0,0,0",@"铁制头盔",\
@"银矿石,4,小块原骨,2,0,0,0,0,0,0",@"银制护额",\
@"银矿石,4,椰子,3,0,0,0,0,0,0",@"新兵头盔",\
@"银矿石,4,铜矿石,2,研磨砂,2,0,0,0,0",@"钢制头盔",\
@"银矿石,5,小块原骨,2,绿色宝石,1,妖精的火种,2,0,0",@"魔法之冠",\
@"银矿石,5,小甲壳,1,小块原骨,2,妖精的火种,2,0,0",@"占山头带",\
@"白金矿石,6,龙的原皮,1,幻魔石,2,妖精的火种,3,0,0",@"黑钢护额",\
@"白金矿石,6,魔兽原角,1,维纳尔贝壳,1,妖精的火种,3,0,0",@"白金头盔",\
@"白金矿石,6,武道精华,1,樱花花瓣,3,妖精的火种,3,0,0",@"玄武头盔",\
@"白金矿石,12,魔兽原角,8,黄色宝珠,2,妖精的火种,12,0,0",@"刀刃护额",\
@"白金矿石,16,夜之幕,12,紫色宝珠,2,妖精的火种,12,0,0",@"亡灵头巾",\
@"白金矿石,16,闪避草,24,绿色宝珠,2,妖精的火种,12,0,0",@"战斗头冠",\
@"白金矿石,16,坚硬的胡桃,24,红色宝珠,2,妖精的火种,12,0,0",@"古强者头盔",\
@"白金矿石,16,研磨砂,36,蓝色宝珠,2,妖精的火种,12,0,0",@"沉重头盔",\
@"幻魔石,4,脏绷带,40,汗与泪的结晶,15,红色宝珠,3,妖精的火种,16",@"哥特礼帽",\
@"幻魔石,4,脏绷带,40,汗与泪的结晶,15,红色宝珠,3,妖精的火种,16",@"哥特帽",\
@"精灵石,4,研磨砂,40,汗与泪的结晶,15,蓝色宝珠,3,妖精的火种,16",@"师团长头盔",\
@"星之碎片,20,龙的原角,2,汗与泪的结晶,15,蓝色宝珠,3,妖精的火种,16",@"突刺头盔",\
@"绿色之眼,10,绿苔,40,汗与泪的结晶,15,绿色宝珠,3,妖精的火种,16",@"野蛮贝雷帽",\
@"精灵石,4,天使的神酒,3,汗与泪的结晶,15,蓝色宝珠,3,妖精的火种,16",@"僧兵之冠",\
@"红色之眼,10,斩风羽,4,汗与泪的结晶,15,红色宝珠,3,妖精的火种,16",@"贵族帽",\
@"大块化石,30,金属碎片,1,汗与泪的结晶,20,红色宝珠,4,妖精的火种,20",@"飞龙头盔",\
@"光之石,30,金属碎片,1,汗与泪的结晶,20,黄色宝珠,4,妖精的火种,20",@"假面舞会头盔",\
@"光之石,30,精灵石,2,汗与泪的结晶,20,蓝色宝珠,4,妖精的火种,20",@"圣骑士头盔",\
@"赤光结晶,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"神兵头盔",\
@"赤光结晶,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"伟大头盔",\
@"幻兽原皮,3,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"流浪帽",\
@"赤光结晶,36,金属碎片,4,汗与泪的结晶,35,彩虹宝珠,3,妖精的火种,36",@"王军师头盔",\
@"赤光结晶,36,红珊瑚,60,汗与泪的结晶,35,彩虹宝珠,3,妖精的火种,36",@"血红头盔",\
@"赤光结晶,36,蛇蜕,64,汗与泪的结晶,35,彩虹宝珠,3,妖精的火种,36",@"机械兜帽",\
@"赤光结晶,36,魔兽原角,16,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,40",@"凯歌头盔",\
@"赤光结晶,36,蛇蜕,48,汗与泪的结晶,60,彩虹宝珠,4,妖精的火种,40",@"毒蛇帽",\
@"铜矿石,2,麻线,3,0,0,0,0,0,0",@"青铜铠甲上装",\
@"铁矿石,1,小鳞片,1,0,0,0,0,0,0",@"鳞铠上装",\
@"铁矿石,3,野兽原皮,1,0,0,0,0,0,0",@"铁制胸铠",\
@"铁矿石,3,镜之石,1,0,0,0,0,0,0",@"锁链甲上装",\
@"铁矿石,4,野兽原皮,1,0,0,0,0,0,0",@"铁制铠甲上装",\
@"银矿石,4,研磨砂,1,0,0,0,0,0,0",@"银制胸铠",\
@"银矿石,4,研磨砂,4,0,0,0,0,0,0",@"新兵胸铠",\
@"银矿石,5,铜矿石,2,重金属,1,0,0,0,0",@"钢制铠甲上装",\
@"银矿石,5,魔力之土,2,小块化石,1,妖精的火种,3,0,0",@"魔法铠甲上装",\
@"银矿石,5,野兽原皮,2,红浆果,1,妖精的火种,3,0,0",@"占山链甲",\
@"白金矿石,6,紫色之眼,2,重金属,1,妖精的火种,4,0,0",@"黑钢铠甲上装",\
@"白金矿石,6,黄色之眼,2,维纳尔贝壳,1,妖精的火种,4,0,0",@"白金铠甲上装",\
@"白金矿石,6,红色之眼,2,樱花花瓣,3,妖精的火种,4,0,0",@"玄武道衣上装",\
@"白金矿石,16,龙的原角,3,黄色宝珠,3,妖精的火种,16,0,0",@"刀刃铠甲上装",\
@"白金矿石,20,夜之幕,15,紫色宝珠,3,妖精的火种,16,0,0",@"亡灵披风",\
@"白金矿石,20,闪避草,30,绿色宝珠,3,妖精的火种,16,0,0",@"战斗衣服上装",\
@"白金矿石,20,坚硬的胡桃,30,红色宝珠,3,妖精的火种,16,0,0",@"古强者铠甲上装",\
@"白金矿石,20,研磨砂,45,蓝色宝珠,3,妖精的火种,16,0,0",@"沉重护甲上装",\
@"幻魔石,6,蛇蜕,50,汗与泪的结晶,25,红色宝珠,4,妖精的火种,20",@"哥特外衣上装",\
@"幻魔石,6,蛇蜕,50,汗与泪的结晶,25,红色宝珠,4,妖精的火种,20",@"哥特胸衣",\
@"精灵石,6,大贝壳,50,汗与泪的结晶,25,蓝色宝珠,4,妖精的火种,20",@"师团长铠甲上装",\
@"星之碎片,24,魔兽原角,6,汗与泪的结晶,25,蓝色宝珠,4,妖精的火种,20",@"突刺铠甲上装",\
@"绿色之眼,12,野兽原皮,50,汗与泪的结晶,25,绿色宝珠,4,妖精的火种,20",@"野蛮上衣",\
@"精灵石,6,蛤蟆油,50,汗与泪的结晶,25,蓝色宝珠,4,妖精的火种,20",@"僧兵衣服上装",\
@"红色之眼,12,彩虹色的布片,50,汗与泪的结晶,25,红色宝珠,4,妖精的火种,20",@"贵族外衣上装",\
@"大块化石,36,龙的原皮,2,汗与泪的结晶,30,红色宝珠,6,妖精的火种,24",@"飞龙上衣",\
@"光之石,36,魔兽原皮,12,汗与泪的结晶,30,黄色宝珠,6,妖精的火种,24",@"假面舞会礼服",\
@"光之石,36,净化之水,60,汗与泪的结晶,30,蓝色宝珠,6,妖精的火种,24",@"圣骑士铠甲上装",\
@"赤光结晶,40,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,妖精的火种,32",@"神兵铠甲上装",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,妖精的火种,32",@"伟大披风",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,妖精的火种,32",@"流浪外衣上装",\
@"赤光结晶,48,镜之石,40,汗与泪的结晶,45,彩虹宝珠,4,妖精的火种,44",@"王军师铠甲",\
@"赤光结晶,48,龙的原皮,16,汗与泪的结晶,45,彩虹宝珠,4,妖精的火种,44",@"血红铠甲上装",\
@"赤光结晶,48,幻兽原皮,4,汗与泪的结晶,45,彩虹宝珠,4,妖精的火种,44",@"机械衣服上装",\
@"赤光结晶,48,幻兽原骨,4,汗与泪的结晶,70,彩虹宝珠,5,妖精的火种,48",@"凯歌铠甲上装",\
@"赤光结晶,48,龙的原皮,16,汗与泪的结晶,70,彩虹宝珠,5,妖精的火种,48",@"毒蛇外衣",\
@"星之碎片,4,祈晴竹叶,12,0,0,0,0,0,0",@"晴天的装束",\
@"热乎乎的石头,4,繁星的眼泪,12,0,0,0,0,0,0",@"繁星套装",\
@"铜矿石,2,麻线,2,0,0,0,0,0,0",@"青铜铠甲下装",\
@"铜矿石,1,小鳞片,1,0,0,0,0,0,0",@"鳞铠下装",\
@"铁矿石,2,纯白木头,1,0,0,0,0,0,0",@"铁制甲裙",\
@"铁矿石,2,利齿,2,0,0,0,0,0,0",@"锁链甲下装",\
@"铁矿石,3,麻线,2,0,0,0,0,0,0",@"铁制铠甲下装",\
@"银矿石,3,野兽原皮,1,0,0,0,0,0,0",@"银制甲裙",\
@"银矿石,3,绿苔,3,0,0,0,0,0,0",@"新兵甲裙",\
@"银矿石,3,铜矿石,2,小甲壳,1,0,0,0,0",@"钢制铠甲下装",\
@"银矿石,4,魔兽原皮,1,红浆果,1,妖精的火种,1,0,0",@"魔法铠甲下装",\
@"银矿石,4,浓密毛皮,2,草原之水,1,妖精的火种,1,0,0",@"占山裤子",\
@"白金矿石,5,腌菜石,6,重金属,1,妖精的火种,2,0,0",@"黑钢铠甲下装",\
@"白金矿石,5,精灵石,1,维纳尔贝壳,1,妖精的火种,2,0,0",@"白金铠甲下装",\
@"白金矿石,5,涟漪之露,3,樱花花瓣,3,妖精的火种,2,0,0",@"玄武道衣下装",\
@"白金矿石,10,龙的原皮,2,黄色宝珠,2,妖精的火种,10,0,0",@"刀刃铠甲下装",\
@"白金矿石,12,闪避草,18,绿色宝珠,2,妖精的火种,10,0,0",@"战斗衣服下装",\
@"白金矿石,12,坚硬的胡桃,18,红色宝珠,2,妖精的火种,10,0,0",@"古强者铠甲下装",\
@"白金矿石,12,研磨砂,27,蓝色宝珠,2,妖精的火种,10,0,0",@"沉重护甲下装",\
@"幻魔石,4,蛇蜕,30,汗与泪的结晶,10,红色宝珠,3,妖精的火种,12",@"哥特外衣下装",\
@"幻魔石,4,蛇蜕,30,汗与泪的结晶,10,红色宝珠,3,妖精的火种,12",@"哥特裙",\
@"精灵石,4,净化之水,30,汗与泪的结晶,10,蓝色宝珠,3,妖精的火种,12",@"师团长铠甲下装",\
@"星之碎片,16,魔兽原皮,3,汗与泪的结晶,10,蓝色宝珠,3,妖精的火种,12",@"突刺铠甲下装",\
@"绿色之眼,8,野兽原皮,35,汗与泪的结晶,10,绿色宝珠,3,妖精的火种,12",@"野蛮下装",\
@"精灵石,4,净化之水,35,汗与泪的结晶,10,蓝色宝珠,3,妖精的火种,12",@"僧兵衣服下装",\
@"红色之眼,8,涟漪之露,35,汗与泪的结晶,10,红色宝珠,3,妖精的火种,12",@"贵族外衣下装",\
@"大块化石,24,大鳞片,50,汗与泪的结晶,15,红色宝珠,4,妖精的火种,16",@"飞龙长裤",\
@"光之石,24,圣者之灰,2,汗与泪的结晶,15,蓝色宝珠,4,妖精的火种,16",@"圣骑士铠甲下装",\
@"赤光结晶,24,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,妖精的火种,20",@"神兵铠甲下装",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,妖精的火种,20",@"流浪外衣下装",\
@"赤光结晶,32,魔兽原皮,30,汗与泪的结晶,30,彩虹宝珠,3,妖精的火种,28",@"血红铠甲下装",\
@"赤光结晶,32,魔兽原皮,16,汗与泪的结晶,30,彩虹宝珠,3,妖精的火种,28",@"机械衣服下装",\
@"赤光结晶,32,鲨鱼皮,24,汗与泪的结晶,50,彩虹宝珠,4,妖精的火种,32",@"凯歌铠甲下装",\
@"铜矿石,2,木棉草,1,0,0,0,0,0,0",@"青铜护手",\
@"铜矿石,1,小鳞片,1,0,0,0,0,0,0",@"鳞护手",\
@"铁矿石,2,麻线,2,0,0,0,0,0,0",@"铁制护腕",\
@"铁矿石,2,纯白木头,1,0,0,0,0,0,0",@"锁链护臂",\
@"铁矿石,2,坚硬的胡桃,1,0,0,0,0,0,0",@"铁制护手",\
@"银矿石,2,小甲壳,1,0,0,0,0,0,0",@"银制护手",\
@"银矿石,2,野兽原皮,2,0,0,0,0,0,0",@"新兵手套",\
@"银矿石,2,铜矿石,2,浓密毛皮,1,0,0,0,0",@"钢制护手",\
@"银矿石,3,魔力之土,2,神奇海草,1,妖精的火种,1,0,0",@"魔法护手",\
@"银矿石,3,野兽原皮,2,小块原骨,2,妖精的火种,1,0,0",@"占山手套",\
@"白金矿石,4,野兽原皮,6,大贝壳,2,妖精的火种,2,0,0",@"黑钢护手",\
@"白金矿石,4,龙的原皮,1,维纳尔贝壳,1,妖精的火种,2,0,0",@"白金护手",\
@"白金矿石,4,蛇蜕,2,樱花花瓣,3,妖精的火种,2,0,0",@"玄武腕带",\
@"白金矿石,8,利爪,30,黄色宝珠,1,妖精的火种,8,0,0",@"刀刃护手",\
@"白金矿石,10,夜之幕,6,紫色宝珠,1,妖精的火种,8,0,0",@"亡灵护臂",\
@"白金矿石,10,闪避草,12,绿色宝珠,1,妖精的火种,8,0,0",@"战斗护手",\
@"白金矿石,10,坚硬的胡桃,12,红色宝珠,1,妖精的火种,8,0,0",@"古强者护手",\
@"白金矿石,10,研磨砂,18,蓝色宝珠,1,妖精的火种,8,0,0",@"沉重手套",\
@"幻魔石,3,脏绷带,25,汗与泪的结晶,5,红色宝珠,2,妖精的火种,10",@"哥特手套",\
@"幻魔石,3,脏绷带,25,汗与泪的结晶,5,红色宝珠,2,妖精的火种,10",@"哥特护手",\
@"精灵石,3,小贝壳,25,汗与泪的结晶,5,蓝色宝珠,2,妖精的火种,10",@"师团长护手",\
@"星之碎片,12,利齿,30,汗与泪的结晶,5,蓝色宝珠,2,妖精的火种,10",@"突刺手套",\
@"绿色之眼,6,小鳞片,30,汗与泪的结晶,5,绿色宝珠,2,妖精的火种,10",@"野蛮手镯",\
@"精灵石,3,圣者之灰,3,汗与泪的结晶,5,蓝色宝珠,2,妖精的火种,10",@"僧兵手套",\
@"红色之眼,6,魔兽原皮,2,汗与泪的结晶,5,红色宝珠,2,妖精的火种,10",@"贵族手套",\
@"大块化石,18,龙的原皮,2,汗与泪的结晶,10,红色宝珠,3,妖精的火种,12",@"飞龙手套",\
@"光之石,18,海风草,40,汗与泪的结晶,10,黄色宝珠,3,妖精的火种,12",@"假面舞会手套",\
@"光之石,18,天使的神酒,2,汗与泪的结晶,10,蓝色宝珠,3,妖精的火种,12",@"圣骑士护手",\
@"金属碎片,2,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,妖精的火种,16",@"神兵护手",\
@"幻兽原皮,2,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,妖精的火种,16",@"伟大手套",\
@"赤光结晶,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,妖精的火种,16",@"流浪护臂",\
@"赤光结晶,24,魔兽原骨,16,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"王军师手套",\
@"赤光结晶,24,妖异草,60,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"血红手套",\
@"赤光结晶,24,浓密毛皮,60,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"机械护手",\
@"赤光结晶,24,研磨砂,80,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,28",@"凯歌护手",\
@"赤光结晶,24,夜之幕,8,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,28",@"毒蛇手套",\
@"铜矿石,2,铁矿石,1,0,0,0,0,0,0",@"青铜长靴",\
@"铜矿石,1,小鳞片,1,0,0,0,0,0,0",@"鳞长靴",\
@"铁矿石,2,小鳞片,1,0,0,0,0,0,0",@"铁制护腿",\
@"铁矿石,2,利爪,1,0,0,0,0,0,0",@"锁链靴",\
@"铁矿石,2,木棉草,2,0,0,0,0,0,0",@"铁制长靴",\
@"银矿石,2,浓密毛皮,1,0,0,0,0,0,0",@"银制长靴",\
@"银矿石,2,浓密毛皮,2,0,0,0,0,0,0",@"新兵长靴",\
@"银矿石,2,铜矿石,2,大块原骨,1,0,0,0,0",@"钢制长靴",\
@"银矿石,3,大块化石,1,绿苔,1,妖精的火种,1,0,0",@"魔法长靴",\
@"银矿石,3,利爪,2,草原之水,1,妖精的火种,1,0,0",@"占山长靴",\
@"白金矿石,4,熔岩碎片,4,神奇泥浆,4,妖精的火种,2,0,0",@"黑钢长靴",\
@"白金矿石,4,重金属,1,维纳尔贝壳,1,妖精的火种,2,0,0",@"白金长靴",\
@"白金矿石,4,龙的原骨,1,樱花花瓣,3,妖精的火种,2,0,0",@"玄武鞋",\
@"白金矿石,8,利齿,30,黄色宝珠,1,妖精的火种,8,0,0",@"刀刃长靴",\
@"白金矿石,10,夜之幕,6,紫色宝珠,1,妖精的火种,8,0,0",@"亡灵长靴",\
@"白金矿石,10,闪避草,12,绿色宝珠,1,妖精的火种,8,0,0",@"战斗长靴",\
@"白金矿石,10,坚硬的胡桃,12,红色宝珠,1,妖精的火种,8,0,0",@"古强者长靴",\
@"白金矿石,10,研磨砂,18,蓝色宝珠,1,妖精的火种,8,0,0",@"沉重长靴",\
@"幻魔石,3,暗黑树木,25,汗与泪的结晶,5,红色宝珠,2,妖精的火种,10",@"哥特长靴",\
@"幻魔石,3,暗黑树木,25,汗与泪的结晶,5,红色宝珠,2,妖精的火种,10",@"哥特长筒袜",\
@"精灵石,3,研磨砂,25,汗与泪的结晶,5,蓝色宝珠,2,妖精的火种,10",@"师团长长靴",\
@"星之碎片,12,利爪,30,汗与泪的结晶,5,蓝色宝珠,2,妖精的火种,10",@"突刺长靴",\
@"绿色之眼,6,大鳞片,30,汗与泪的结晶,5,绿色宝珠,2,妖精的火种,10",@"野蛮鞋",\
@"精灵石,3,史莱姆果冻,16,汗与泪的结晶,5,蓝色宝珠,2,妖精的火种,10",@"僧兵鞋",\
@"红色之眼,6,野兽原皮,30,汗与泪的结晶,5,红色宝珠,2,妖精的火种,10",@"贵族长靴",\
@"大块化石,18,雷鸣珠,4,汗与泪的结晶,10,红色宝珠,3,妖精的火种,12",@"飞龙长靴",\
@"光之石,18,小贝壳,60,汗与泪的结晶,10,黄色宝珠,3,妖精的火种,12",@"假面舞会长靴",\
@"光之石,18,精灵石,2,汗与泪的结晶,10,蓝色宝珠,3,妖精的火种,12",@"圣骑士长靴",\
@"金属碎片,2,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,妖精的火种,16",@"神兵长靴",\
@"赤光结晶,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,妖精的火种,16",@"伟大长靴",\
@"赤光结晶,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,妖精的火种,16",@"流浪鞋",\
@"赤光结晶,24,金属碎片,2,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"王军师长靴",\
@"赤光结晶,24,魔兽原骨,24,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"血红长靴",\
@"赤光结晶,24,龙的原皮,8,汗与泪的结晶,25,彩虹宝珠,2,妖精的火种,24",@"机械靴",\
@"赤光结晶,24,利齿,80,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,28",@"凯歌长靴",\
@"赤光结晶,24,魔兽原皮,12,汗与泪的结晶,40,彩虹宝珠,3,妖精的火种,28",@"毒蛇长靴",\
@"铜矿石,2,0,0,0,0,0,0,0,0",@"铜制裁缝针",\
@"铁矿石,3,利齿,2,0,0,0,0,0,0",@"铁制裁缝针",\
@"银矿石,4,椰子,2,妖精的火种,1,0,0,0,0",@"银制裁缝针",\
@"白金矿石,5,维纳尔贝壳,4,蓝色之眼,1,妖精的火种,4,0,0",@"白金裁缝针",\
@"白金矿石,16,红珊瑚,40,汗与泪的结晶,8,妖精的火种,8,0,0",@"超级裁缝针",\
@"白金矿石,24,冰之树木,64,汗与泪的结晶,30,妖精的火种,12,0,0",@"奇迹裁缝针",\
@"小贝壳,4,祈晴竹叶,8,0,0,0,0,0,0",@"七夕裁缝针",\
@"利爪,4,繁星的眼泪,8,0,0,0,0,0,0",@"星之裁缝针",\
@"银矿石,1,椰子,1,妖精粉,3,0,0,0,0",@"银制小裁缝针",\
@"白金矿石,2,维纳尔贝壳,1,蓝色之眼,1,妖精的火种,1,0,0",@"白金小裁缝针",\
@"白金矿石,4,红珊瑚,10,汗与泪的结晶,2,妖精的火种,2,0,0",@"超级小裁缝针",\
@"白金矿石,6,冰之树木,16,汗与泪的结晶,8,妖精的火种,3,0,0",@"奇迹小裁缝针",\
@"铜矿石,2,0,0,0,0,0,0,0,0",@"铜制木工刀",\
@"铁矿石,3,利爪,2,0,0,0,0,0,0",@"铁制木工刀",\
@"银矿石,4,结实的树枝,2,妖精的火种,1,0,0,0,0",@"银制木工刀",\
@"白金矿石,5,埃尔托纳水仙,4,绿色之眼,1,妖精的火种,4,0,0",@"白金木工刀",\
@"白金矿石,16,七色茧,40,汗与泪的结晶,8,妖精的火种,8,0,0",@"超级木工刀",\
@"白金矿石,24,大块原骨,64,汗与泪的结晶,30,妖精的火种,12,0,0",@"奇迹木工刀",\
@"小块原骨,4,祈晴竹叶,8,0,0,0,0,0,0",@"七夕木工刀",\
@"小块化石,4,繁星的眼泪,8,0,0,0,0,0,0",@"星之木工刀",\
@"银矿石,1,结实的树枝,1,妖精粉,3,0,0,0,0",@"银制小木工刀",\
@"白金矿石,2,埃尔托纳水仙,1,绿色之眼,1,妖精的火种,1,0,0",@"白金小木工刀",\
@"白金矿石,4,七色茧,10,汗与泪的结晶,2,妖精的火种,2,0,0",@"超级小木工刀",\
@"白金矿石,6,大块原骨,16,汗与泪的结晶,8,妖精的火种,3,0,0",@"奇迹小木工刀",\
@"铜矿石,2,0,0,0,0,0,0,0,0",@"铜制锻造锤",\
@"铁矿石,3,坚硬的胡桃,2,0,0,0,0,0,0",@"铁制锻造锤",\
@"银矿石,4,拳骨菇,2,妖精的火种,1,0,0,0,0",@"银制锻造锤",\
@"白金矿石,5,奥古力德化石角,4,红色之眼,1,妖精的火种,4,0,0",@"白金锻造锤",\
@"白金矿石,16,龙的原骨,8,汗与泪的结晶,8,妖精的火种,8,0,0",@"超级锻造锤",\
@"白金矿石,24,大甲壳,64,汗与泪的结晶,30,妖精的火种,12,0,0",@"奇迹锻造锤",\
@"冰的结晶,4,祈晴竹叶,8,0,0,0,0,0,0",@"七夕锻造锤",\
@"熔岩碎片,4,繁星的眼泪,8,0,0,0,0,0,0",@"星之锻造锤",\
@"银矿石,1,拳骨菇,1,妖精粉,3,0,0,0,0",@"银制小锻造锤",\
@"白金矿石,2,奥古力德化石角,1,红色之眼,1,妖精的火种,1,0,0",@"白金小锻造锤",\
@"白金矿石,4,龙的原骨,2,汗与泪的结晶,2,妖精的火种,2,0,0",@"超级小锻造锤",\
@"白金矿石,6,大甲壳,16,汗与泪的结晶,8,妖精的火种,3,0,0",@"奇迹小锻造锤",\
@"铜矿石,2,0,0,0,0,0,0,0,0",@"铜制炼金油灯",\
@"铁矿石,3,小块化石,2,0,0,0,0,0,0",@"铁制炼金油灯",\
@"银矿石,4,研磨砂,2,妖精的火种,1,0,0,0,0",@"银制炼金油灯",\
@"白金矿石,5,普库兰藏红花,4,紫色之眼,1,妖精的火种,4,0,0",@"白金炼金油灯",\
@"白金矿石,16,蛇蜕,40,汗与泪的结晶,8,妖精的火种,8,0,0",@"超级炼金油灯",\
@"白金矿石,24,蛤蟆油,64,汗与泪的结晶,30,妖精的火种,12,0,0",@"奇迹炼金油灯",\
@"小鳞片,4,祈晴竹叶,8,0,0,0,0,0,0",@"七夕炼金油灯",\
@"小甲壳,4,繁星的眼泪,8,0,0,0,0,0,0",@"星之炼金油灯",\
@"银矿石,1,研磨砂,1,妖精粉,3,0,0,0,0",@"银制小炼金油灯",\
@"白金矿石,2,普库兰藏红花,1,紫色之眼,1,妖精的火种,1,0,0",@"白金小炼金油灯",\
@"白金矿石,4,蛇蜕,10,汗与泪的结晶,2,妖精的火种,2,0,0",@"超级小炼金油灯",\
@"白金矿石,6,蛤蟆油,16,汗与泪的结晶,8,妖精的火种,3,0,0",@"奇迹小炼金油灯",\
@"铜矿石,2,0,0,0,0,0,0,0,0",@"铜制炼金壶",\
@"铁矿石,3,七色茧,1,0,0,0,0,0,0",@"铁制炼金壶",\
@"银矿石,4,热乎乎的石头,2,妖精的火种,1,0,0,0,0",@"银制炼金壶",\
@"白金矿石,5,多瓦切卡油,4,黄色之眼,1,妖精的火种,4,0,0",@"白金炼金壶",\
@"白金矿石,16,脏绷带,40,汗与泪的结晶,8,妖精的火种,8,0,0",@"超级炼金壶",\
@"白金矿石,24,研磨砂,64,汗与泪的结晶,30,妖精的火种,12,0,0",@"奇迹炼金壶",\
@"蛤蟆油,4,祈晴竹叶,8,0,0,0,0,0,0",@"七夕炼金壶",\
@"蛇蜕,4,繁星的眼泪,8,0,0,0,0,0,0",@"星之炼金壶",\
@"银矿石,1,热乎乎的石头,1,妖精粉,3,0,0,0,0",@"银制小炼金壶",\
@"白金矿石,2,多瓦切卡油,1,黄色之眼,1,妖精的火种,1,0,0",@"白金小炼金壶",\
@"白金矿石,4,脏绷带,10,汗与泪的结晶,2,妖精的火种,2,0,0",@"超级小炼金壶",\
@"白金矿石,6,研磨砂,16,汗与泪的结晶,8,妖精的火种,3,0,0",@"奇迹小炼金壶",\
@"铜矿石,2,0,0,0,0,0,0,0,0",@"铜制平底锅",\
@"铁矿石,3,蝙蝠翅膀,2,0,0,0,0,0,0",@"铁制平底锅",\
@"银矿石,4,草原木头,2,妖精的火种,1,0,0,0,0",@"银制平底锅",\
@"白金矿石,5,冷达种子,4,史莱姆果冻,1,妖精的火种,4,0,0",@"白金平底锅",\
@"白金矿石,16,蝴蝶翅膀,40,汗与泪的结晶,8,妖精的火种,8,0,0",@"超级平底锅",\
@"白金矿石,24,大贝壳,64,汗与泪的结晶,30,妖精的火种,12,0,0",@"奇迹平底锅",\
@"坚硬的胡桃,4,繁星的眼泪,8,0,0,0,0,0,0",@"星之煎锅",\
@"银矿石,1,草原木头,1,妖精粉,3,0,0,0,0",@"银制小平底锅",\
@"白金矿石,2,冷达种子,1,史莱姆果冻,1,妖精的火种,1,0,0",@"白金小平底锅",\
@"白金矿石,4,蝴蝶翅膀,10,汗与泪的结晶,2,妖精的火种,2,0,0",@"超级小平底锅",\
@"白金矿石,6,大贝壳,16,汗与泪的结晶,8,妖精的火种,3,0,0",@"奇迹小平底锅",\
@"银矿石,3,浓密毛皮,3,妖精粉,5,0,0,0,0",@"银鱼钩",\
@"白金矿石,5,蝙蝠翅膀,5,汗与泪的结晶,1,妖精的火种,1,0,0",@"白金鱼钩",\
@"赤光结晶,7,彩虹色的布片,7,汗与泪的结晶,2,妖精的火种,2,0,0",@"赤光结晶鱼钩",\
@"金属碎片,1,史莱姆果冻,24,鲨鱼皮,4,汗与泪的结晶,4,妖精的火种,4",@"天使鱼钩",\
@"金属碎片,1,刺海胆,24,鲨鱼皮,4,汗与泪的结晶,4,妖精的火种,4",@"带刺鱼钩",\
@"铁矿石,10,埃尔托纳水仙,2,0,0,0,0,0,0",@"豪华的花瓶·绿",\
@"铁矿石,10,星之碎片,5,0,0,0,0,0,0",@"豪华的瓶·绿",\
@"铁矿石,10,光之石,5,0,0,0,0,0,0",@"豪华的奥伽半身像·绿",\
@"铁矿石,10,铜矿石,5,0,0,0,0,0,0",@"豪华的装饰铠甲·绿",\
@"铁矿石,10,星之碎片,8,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具岩石",\
@"铁矿石,10,光之石,8,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具隧道",\
@"铁矿石,10,涟漪之露,8,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具池子",\
@"铁矿石,10,草原木头,10,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具树",\
@"铁矿石,10,闪避草,10,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具草原",\
@"银矿石,16,野兽原皮,16,妖精的火种,4,汗与泪的结晶,30,0,0",@"玩具帐篷",\
@"银矿石,16,浓密毛皮,16,妖精的火种,4,汗与泪的结晶,30,0,0",@"玩具马戏团",\
@"白金矿石,20,雷鸣珠,2,妖精的火种,5,汗与泪的结晶,40,0,0",@"移动方舟号",\
@"冰的结晶,10,光之石,10,妖精的火种,3,汗与泪的结晶,30,0,0",@"莲花落地灯·绿",\
@"冰的结晶,16,七色茧,8,妖精的火种,3,汗与泪的结晶,30,0,0",@"多彩气球·红黄",\
@"小贝壳,60,白色珍珠,3,妖精的火种,3,汗与泪的结晶,30,0,0",@"白色珍珠盒",\
@"花蜜,16,魔兽原角,2,妖精的火种,3,汗与泪的结晶,20,0,0",@"摇摇牛·白",\
@"美丽蘑菇,20,柔软的羊毛,1,妖精的火种,3,汗与泪的结晶,20,0,0",@"摇摇羊·粉",\
@"光之石,20,神奇泥浆,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具石山",\
@"光之石,20,妖异草,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具花草",\
@"光之石,20,研磨砂,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具圆形房子",\
@"光之石,20,大贝壳,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具方形房子",\
@"光之石,20,热乎乎的石头,20,妖精的火种,3,汗与泪的结晶,20,0,0",@"玩具天空·晴",\
@"星之碎片,30,研磨砂,30,妖精的火种,4,汗与泪的结晶,10,0,0",@"月球仪",\
@"热乎乎的石头,30,脏绷带,30,妖精的火种,5,汗与泪的结晶,30,0,0",@"史莱姆图案被炉",\
@"星之碎片,30,冰的结晶,30,妖精的火种,5,汗与泪的结晶,30,0,0",@"闪闪风铃·银",\
@"光之石,10,小鳞片,10,妖精的火种,2,汗与泪的结晶,6,0,0",@"红色金鱼和鱼缸",\
@"熔岩碎片,4,祈晴竹叶,12,0,0,0,0,0,0",@"蚊香猪摆设·白",\
@"熔岩碎片,25,多瓦切卡油,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"加塔拉站模型",\
@"熔岩碎片,25,奥古力德化石角,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"古莲站模型",\
@"熔岩碎片,25,普库兰藏红花,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"欧鲁非亚站模型",\
@"熔岩碎片,25,维纳尔贝壳,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"玖莱特站模型",\
@"熔岩碎片,25,埃尔托纳水仙,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"安须岚站模型",\
@"冰的结晶,12,史莱姆果冻,12,妖精的火种,5,0,0,0,0",@"水晶座钟",\
@"冰的结晶,12,史莱姆果冻,12,妖精的火种,5,0,0,0,0",@"水晶装饰品",\
@"小贝壳,80,史莱姆果冻,40,妖精的火种,16,汗与泪的结晶,4,0,0",@"史莱姆风铃",\
@"小贝壳,20,蛤蟆油,5,妖精的火种,4,0,0,0,0",@"蓝色落地灯饰",\
@"小贝壳,20,蛤蟆油,5,妖精的火种,4,0,0,0,0",@"红色落地灯饰",\
@"光之石,12,妖异草,10,妖精的火种,2,汗与泪的结晶,10,0,0",@"性感舞台灯",\
@"光之石,12,黄色之眼,5,妖精的火种,2,汗与泪的结晶,20,0,0",@"彩砖落地灯",\
@"粉红珍珠,5,魔力之土,10,0,0,0,0,0,0",@"小猪存钱罐",\
@"热乎乎的石头,20,斩风羽,2,妖精的火种,4,汗与泪的结晶,20,0,0",@"格纹落地灯·红",\
@"星之碎片,4,繁星的眼泪,12,0,0,0,0,0,0",@"星尘灯笼·黄",\
@"银矿石,20,净化之水,10,妖精的火种,4,0,0,0,0",@"云朵立灯",\
@"银矿石,20,研磨砂,20,妖精的火种,4,汗与泪的结晶,20,0,0",@"浮花喷泉·银",\
@"精灵石,1,祈晴竹叶,12,0,0,0,0,0,0",@"西瓜盆·银",\
@"光之石,10,樱花花瓣,15,妖精的火种,4,0,0,0,0",@"花灯·粉",\
@"小贝壳,20,蛤蟆油,5,妖精的火种,4,0,0,0,0",@"蓝色庭用灯饰",\
@"小贝壳,20,蛤蟆油,5,妖精的火种,4,0,0,0,0",@"红色庭用灯饰",\
@"热乎乎的石头,4,繁星的眼泪,12,0,0,0,0,0,0",@"史莱姆灯笼",\
@"白金矿石,30,时之水晶,7,彩虹宝珠,3,妖精的火种,12,0,0",@"彩虹天象仪",\
@"红色宝珠,3,蓝色宝珠,3,黄色宝珠,3,绿色宝珠,3,紫色宝珠,3",@"彩虹宝珠",\
@"野兽原皮,1,麻线,1,0,0,0,0,0,0",@"皮帽",\
@"麻线,3,0,0,0,0,0,0,0,0",@"暖场艺人方头巾",\
@"麻线,3,0,0,0,0,0,0,0,0",@"亚麻帽",\
@"麻线,3,木棉草,2,0,0,0,0,0,0",@"新手艺人方头巾",\
@"麻线,3,丝草,1,0,0,0,0,0,0",@"剪柳头巾",\
@"麻线,3,花蜜,1,0,0,0,0,0,0",@"治愈帽",\
@"丝草,2,木棉草,1,0,0,0,0,0,0",@"丝织帽",\
@"木棉草,3,绿苔,3,0,0,0,0,0,0",@"射手帽",\
@"木棉草,3,麻线,2,0,0,0,0,0,0",@"修炼头带",\
@"木棉草,3,花蜜,1,0,0,0,0,0,0",@"藏红花帽",\
@"木棉草,3,埃尔托纳水仙,1,0,0,0,0,0,0",@"药师帽",\
@"木棉草,3,斩风羽,1,0,0,0,0,0,0",@"初级魔法战士贝雷帽",\
@"木棉草,3,彩虹色的布片,3,0,0,0,0,0,0",@"舞者头带",\
@"木棉草,4,海风草,1,0,0,0,0,0,0",@"疾风头巾",\
@"木棉草,4,普库兰藏红花,1,0,0,0,0,0,0",@"闪避帽",\
@"木棉草,4,小块原骨,2,0,0,0,0,0,0",@"魔术师头带",\
@"木棉草,4,领悟草,4,0,0,0,0,0,0",@"学者帽",\
@"丝草,4,野兽原皮,2,红浆果,1,0,0,0,0",@"功夫小帽",\
@"丝草,4,草原之水,2,小块原骨,2,0,0,0,0",@"斗牛士头带",\
@"丝草,4,沙漠水果,1,领悟草,1,0,0,0,0",@"咒术师长头巾",\
@"丝草,5,坚硬的胡桃,2,花蜜,1,0,0,0,0",@"守护帽",\
@"丝草,4,魔兽原皮,2,野兽原皮,5,0,0,0,0",@"西部帽",\
@"丝草,4,草原木头,2,埃尔托纳水仙,2,0,0,0,0",@"树叶帽",\
@"丝草,5,普库兰藏红花,1,天籁之蜜,2,雨露之丝,2,0,0",@"讲述者帽",\
@"丝草,5,净化之水,3,白色珍珠,1,雨露之丝,2,0,0",@"神官帽",\
@"丝草,5,美丽蘑菇,3,蝴蝶翅膀,2,雨露之丝,2,0,0",@"魔导士帽",\
@"丝草,5,浓密毛皮,4,小块原骨,3,雨露之丝,2,0,0",@"森人帽",\
@"闪光草,6,海风草,3,绿苔,3,雨露之丝,3,0,0",@"击剑士帽",\
@"闪光草,6,蓝色之眼,1,金属碎片,1,雨露之丝,3,0,0",@"水之冠",\
@"闪光草,6,草原之水,2,沙漠水果,1,雨露之丝,3,0,0",@"奇术师帽",\
@"闪光草,6,绿色宝石,1,神奇海草,2,雨露之丝,3,0,0",@"祭司帽",\
@"闪光草,6,红浆果,3,柔软的羊毛,1,雨露之丝,3,0,0",@"神圣帽",\
@"闪光草,12,魔兽原皮,16,蓝色宝珠,2,雨露之丝,12,0,0",@"真理帽",\
@"闪光草,12,蝙蝠翅膀,16,紫色宝珠,2,雨露之丝,12,0,0",@"大师帽",\
@"闪光草,12,海风草,30,黄色宝珠,2,雨露之丝,12,0,0",@"混混方头巾",\
@"闪光草,16,星之碎片,24,紫色宝珠,2,雨露之丝,12,0,0",@"占星术士长头巾",\
@"闪光草,16,光之石,24,绿色宝珠,2,雨露之丝,12,0,0",@"圣者帽",\
@"闪光草,16,蝙蝠翅膀,24,红色宝珠,2,雨露之丝,12,0,0",@"财宝帽",\
@"闪光草,16,七色茧,24,蓝色宝珠,2,雨露之丝,12,0,0",@"知识帽子",\
@"彩虹色的布片,20,满月草,40,汗与泪的结晶,15,紫色宝珠,3,雨露之丝,16",@"月之冠",\
@"闪避草,20,脏绷带,40,汗与泪的结晶,15,黄色宝珠,3,雨露之丝,16",@"拳圣长头巾",\
@"浓密毛皮,20,龙的原皮,1,汗与泪的结晶,15,绿色宝珠,3,雨露之丝,16",@"原始兽毛皮帽",\
@"妖异草,20,柔软的羊毛,4,汗与泪的结晶,15,绿色宝珠,3,雨露之丝,16",@"摩登兔发饰",\
@"脏绷带,20,野兽原皮,40,汗与泪的结晶,15,红色宝珠,3,雨露之丝,16",@"古武道头巾",\
@"妖异草,20,夜之幕,3,汗与泪的结晶,15,黄色宝珠,3,雨露之丝,16",@"王宫魔术师帽",\
@"彩虹色的布片,20,光之石,16,汗与泪的结晶,15,黄色宝珠,3,雨露之丝,16",@"小丑帽",\
@"彩虹色的布片,20,浓密毛皮,40,汗与泪的结晶,15,蓝色宝珠,3,雨露之丝,16",@"奇迹帽",\
@"浓密毛皮,20,小块原骨,40,汗与泪的结晶,15,黄色宝珠,3,雨露之丝,16",@"古代魔术帽",\
@"海风草,30,武道精华,6,汗与泪的结晶,20,绿色宝珠,4,雨露之丝,20",@"求道者头带",\
@"蝙蝠翅膀,30,夜之幕,2,汗与泪的结晶,20,蓝色宝珠,4,雨露之丝,20",@"大魔导帽",\
@"野兽原皮,30,金属碎片,1,汗与泪的结晶,20,黄色宝珠,4,雨露之丝,20",@"追击者头带",\
@"领悟草,30,浓密毛皮,50,汗与泪的结晶,20,蓝色宝珠,4,雨露之丝,20",@"大贤者僧帽",\
@"浓密毛皮,30,金属碎片,1,汗与泪的结晶,20,蓝色宝珠,4,雨露之丝,20",@"偶像头带",\
@"彩虹色的布片,30,斩风羽,5,汗与泪的结晶,20,紫色宝珠,4,雨露之丝,20",@"作曲家头带",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"羊之兜帽",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"领悟头冠",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"舞台头带",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"舞台缎带",\
@"妖精的棉花,32,黄金装饰头盔,1,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"台风护目镜",\
@"妖精的棉花,36,史莱姆时尚花,24,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,36",@"退魔帽",\
@"妖精的棉花,36,蝙蝠翅膀,64,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,36",@"暗鸦帽",\
@"妖精的棉花,36,幻兽原皮,4,汗与泪的结晶,60,彩虹宝珠,4,雨露之丝,40",@"圣贤者僧帽",\
@"妖精的棉花,36,武道精华,12,汗与泪的结晶,60,彩虹宝珠,4,雨露之丝,40",@"黄龙头带",\
@"妖精的棉花,36,斩风羽,12,汗与泪的结晶,60,彩虹宝珠,4,雨露之丝,40",@"古代王族长头巾",\
@"野兽原皮,1,麻线,1,0,0,0,0,0,0",@"皮铠",\
@"野兽原皮,2,0,0,0,0,0,0,0,0",@"暖场艺人衣服",\
@"麻线,3,0,0,0,0,0,0,0,0",@"亚麻衣服",\
@"麻线,3,红浆果,3,0,0,0,0,0,0",@"新手艺人的衣服",\
@"麻线,3,丝草,1,0,0,0,0,0,0",@"剪柳衣服",\
@"麻线,3,净化之水,1,0,0,0,0,0,0",@"治愈衣服",\
@"丝草,2,海风草,1,0,0,0,0,0,0",@"丝织长袍上装",\
@"木棉草,3,美丽蘑菇,4,0,0,0,0,0,0",@"射手衣服",\
@"木棉草,3,净化之水,2,0,0,0,0,0,0",@"修炼服上装",\
@"木棉草,3,草原之水,1,0,0,0,0,0,0",@"藏红花长袍上装",\
@"木棉草,3,埃尔托纳水仙,1,0,0,0,0,0,0",@"药师长袍上装",\
@"木棉草,3,妖异草,3,0,0,0,0,0,0",@"初级魔法战士服",\
@"木棉草,3,红浆果,6,0,0,0,0,0,0",@"舞者衬衫",\
@"木棉草,4,沙漠水果,2,0,0,0,0,0,0",@"疾风背心",\
@"木棉草,4,闪避草,2,0,0,0,0,0,0",@"闪避之衣上装",\
@"木棉草,5,野兽原皮,2,0,0,0,0,0,0",@"魔术师衣服",\
@"木棉草,5,美丽蘑菇,5,0,0,0,0,0,0",@"学者衣服上装",\
@"丝草,5,武道精华,1,绿苔,1,0,0,0,0",@"功夫上衣",\
@"丝草,5,麻线,2,红色宝石,1,0,0,0,0",@"斗牛士衣服上装",\
@"丝草,5,草原之水,2,埃尔托纳水仙,1,0,0,0,0",@"咒术师长袍上装",\
@"丝草,5,坚硬的胡桃,2,净化之水,1,0,0,0,0",@"守护长袍",\
@"丝草,5,绿色之眼,2,绿苔,4,0,0,0,0",@"西部衬衫",\
@"丝草,5,药草,30,绿色宝石,1,0,0,0,0",@"树叶铠甲上装",\
@"丝草,5,武道精华,1,海风草,2,雨露之丝,3,0,0",@"拳法衣服上装",\
@"丝草,5,领悟草,1,天籁之蜜,2,雨露之丝,3,0,0",@"讲述者衣服上装",\
@"丝草,5,净化之水,3,精灵石,1,雨露之丝,3,0,0",@"神官法衣上装",\
@"丝草,5,美丽蘑菇,3,蝙蝠翅膀,2,雨露之丝,3,0,0",@"魔导士衣服上装",\
@"丝草,5,坚硬的胡桃,4,大块原骨,4,雨露之丝,3,0,0",@"森人背心",\
@"闪光草,6,绿色之眼,2,普库兰藏红花,3,雨露之丝,4,0,0",@"击剑士披风",\
@"闪光草,6,时之水晶,1,天使的神酒,1,雨露之丝,4,0,0",@"水之羽衣上装",\
@"闪光草,6,红色之眼,2,沙漠水果,1,雨露之丝,4,0,0",@"奇术师衣服",\
@"闪光草,6,黄色之眼,2,精灵石,1,雨露之丝,4,0,0",@"祭司法衣",\
@"闪光草,6,黄色之眼,2,柔软的羊毛,1,雨露之丝,4,0,0",@"神圣长袍上装",\
@"闪光草,16,柔软的羊毛,40,蓝色宝珠,3,雨露之丝,16,0,0",@"真理长袍上装",\
@"闪光草,16,夜之幕,6,紫色宝珠,3,雨露之丝,16,0,0",@"大师马甲",\
@"闪光草,16,神奇海草,60,黄色宝珠,3,雨露之丝,16,0,0",@"混混背心",\
@"闪光草,20,星之碎片,30,紫色宝珠,3,雨露之丝,16,0,0",@"占星术士长袍上装",\
@"闪光草,20,光之石,30,绿色宝珠,3,雨露之丝,16,0,0",@"圣者法衣",\
@"闪光草,20,蝙蝠翅膀,30,红色宝珠,3,雨露之丝,16,0,0",@"财宝外衣上装",\
@"闪光草,20,七色茧,30,蓝色宝珠,3,雨露之丝,16,0,0",@"知识长袍上装",\
@"彩虹色的布片,24,涟漪之露,50,汗与泪的结晶,25,紫色宝珠,4,雨露之丝,20",@"月之长袍上装",\
@"闪避草,24,天使的神酒,1,汗与泪的结晶,25,黄色宝珠,4,雨露之丝,20",@"拳圣道衣上装",\
@"浓密毛皮,24,大鳞片,50,汗与泪的结晶,25,绿色宝珠,4,雨露之丝,20",@"原始兽外衣上装",\
@"妖异草,24,蝴蝶翅膀,50,汗与泪的结晶,25,绿色宝珠,4,雨露之丝,20",@"摩登兔上衣",\
@"脏绷带,24,武道精华,4,汗与泪的结晶,25,红色宝珠,4,雨露之丝,20",@"古武道衣服上装",\
@"妖异草,24,神奇海草,50,汗与泪的结晶,25,黄色宝珠,4,雨露之丝,20",@"王宫魔术师长袍上装",\
@"彩虹色的布片,24,美丽蘑菇,30,汗与泪的结晶,25,黄色宝珠,4,雨露之丝,20",@"小丑背心",\
@"彩虹色的布片,24,龙的原皮,2,汗与泪的结晶,25,蓝色宝珠,4,雨露之丝,20",@"奇迹外衣上装",\
@"浓密毛皮,24,时之水晶,1,汗与泪的结晶,25,黄色宝珠,4,雨露之丝,20",@"古代魔术法衣上装",\
@"海风草,36,绿苔,60,汗与泪的结晶,30,绿色宝珠,6,雨露之丝,24",@"求道者道衣上装",\
@"蝙蝠翅膀,36,彩虹色的布片,60,汗与泪的结晶,30,蓝色宝珠,6,雨露之丝,24",@"大魔导长袍上装",\
@"野兽原皮,36,魔兽原皮,16,汗与泪的结晶,30,黄色宝珠,6,雨露之丝,24",@"追击者皮衣上装",\
@"领悟草,36,史莱姆果冻,60,汗与泪的结晶,30,蓝色宝珠,6,雨露之丝,24",@"大贤者法衣",\
@"浓密毛皮,36,小贝壳,60,汗与泪的结晶,30,蓝色宝珠,6,雨露之丝,24",@"偶像衣服上装",\
@"彩虹色的布片,36,蛇蜕,50,汗与泪的结晶,30,紫色宝珠,6,雨露之丝,24",@"作曲家衣服上装",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"羊之衣上装",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"领悟衣服",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"舞台上衣",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"舞台芭蕾裙上装",\
@"幻兽原皮,4,黄金装饰铠甲上装,1,汗与泪的结晶,35,彩虹宝珠,3,雨露之丝,32",@"台风皮衣上装",\
@"妖精的棉花,48,闪避草,80,汗与泪的结晶,45,彩虹宝珠,4,雨露之丝,44",@"退魔法衣上装",\
@"妖精的棉花,48,脏绷带,80,汗与泪的结晶,45,彩虹宝珠,4,雨露之丝,44",@"暗鸦战衣",\
@"妖精的棉花,48,圣者之灰,16,汗与泪的结晶,70,彩虹宝珠,5,雨露之丝,48",@"圣贤者长袍上装",\
@"妖精的棉花,48,龙的原骨,8,汗与泪的结晶,70,彩虹宝珠,5,雨露之丝,48",@"黄龙道衣",\
@"妖精的棉花,48,妖异草,80,汗与泪的结晶,70,彩虹宝珠,5,雨露之丝,48",@"古代王族背心",\
@"丝草,4,祈晴竹叶,12,0,0,0,0,0,0",@"星天之衣",\
@"妖异草,4,繁星的眼泪,12,0,0,0,0,0,0",@"繁星衣服",\
@"野兽原皮,1,0,0,0,0,0,0,0,0",@"皮裤",\
@"野兽原皮,1,0,0,0,0,0,0,0,0",@"暖场艺人长裤",\
@"麻线,2,0,0,0,0,0,0,0,0",@"亚麻短裤",\
@"麻线,2,木棉草,1,0,0,0,0,0,0",@"新手艺人长裤",\
@"麻线,2,丝草,1,0,0,0,0,0,0",@"剪柳紧身裤",\
@"麻线,2,净化之水,1,0,0,0,0,0,0",@"治愈长裤",\
@"丝草,1,海风草,1,0,0,0,0,0,0",@"丝织长袍下装",\
@"木棉草,2,草原之水,3,0,0,0,0,0,0",@"射手紧身裤",\
@"木棉草,2,丝草,1,0,0,0,0,0,0",@"修炼服下装",\
@"木棉草,2,草原之水,1,0,0,0,0,0,0",@"藏红花长袍下装",\
@"木棉草,2,埃尔托纳水仙,1,0,0,0,0,0,0",@"药师长袍下装",\
@"木棉草,2,绿苔,3,0,0,0,0,0,0",@"初级魔法战士紧身裤",\
@"木棉草,2,神奇海草,6,0,0,0,0,0,0",@"舞者喇叭裤",\
@"木棉草,3,海风草,1,0,0,0,0,0,0",@"疾风马裤",\
@"木棉草,3,花蜜,1,0,0,0,0,0,0",@"闪避之衣下装",\
@"木棉草,3,埃尔托纳水仙,1,0,0,0,0,0,0",@"魔术师紧身裤",\
@"木棉草,3,浓密毛皮,3,0,0,0,0,0,0",@"学者衣服下装",\
@"丝草,3,草原之水,2,埃尔托纳水仙,1,0,0,0,0",@"功夫长裤",\
@"丝草,3,闪避草,1,埃尔托纳水仙,1,0,0,0,0",@"斗牛士衣服下装",\
@"丝草,3,美丽蘑菇,1,领悟草,1,0,0,0,0",@"咒术师长袍下装",\
@"丝草,3,闪避草,4,蛇蜕,2,0,0,0,0",@"西部短裤",\
@"丝草,3,闪避草,2,天籁之蜜,1,0,0,0,0",@"树叶铠甲下装",\
@"丝草,4,闪避草,1,海风草,2,雨露之丝,1,0,0",@"拳法衣服下装",\
@"丝草,4,彩虹色的布片,1,天籁之蜜,2,雨露之丝,1,0,0",@"讲述者衣服下装",\
@"丝草,4,净化之水,3,绿苔,2,雨露之丝,1,0,0",@"神官法衣下装",\
@"丝草,4,美丽蘑菇,3,魔兽原皮,1,雨露之丝,1,0,0",@"魔导士衣服下装",\
@"丝草,4,彩虹色的布片,2,小块原骨,3,雨露之丝,1,0,0",@"森人围裙",\
@"闪光草,5,精灵石,3,涟漪之露,3,雨露之丝,2,0,0",@"水之羽衣下装",\
@"闪光草,5,魔兽原皮,2,沙漠水果,1,雨露之丝,2,0,0",@"奇术师裤子",\
@"闪光草,5,精灵石,1,净化之水,3,雨露之丝,2,0,0",@"神圣长袍下装",\
@"闪光草,10,浓密毛皮,40,蓝色宝珠,2,雨露之丝,10,0,0",@"真理长袍下装",\
@"闪光草,10,神奇海草,40,紫色宝珠,2,雨露之丝,10,0,0",@"大师长裤",\
@"闪光草,10,彩虹色的布片,40,黄色宝珠,2,雨露之丝,10,0,0",@"混混裤子",\
@"闪光草,12,星之碎片,18,紫色宝珠,2,雨露之丝,10,0,0",@"占星术士长袍下装",\
@"闪光草,12,蝙蝠翅膀,18,红色宝珠,2,雨露之丝,10,0,0",@"财宝外衣下装",\
@"闪光草,12,七色茧,18,蓝色宝珠,2,雨露之丝,10,0,0",@"知识长袍下装",\
@"彩虹色的布片,16,满月草,30,汗与泪的结晶,10,紫色宝珠,3,雨露之丝,12",@"月之长袍下装",\
@"闪避草,16,野兽原皮,30,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"拳圣道衣下装",\
@"浓密毛皮,16,小鳞片,30,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"原始兽外衣下装",\
@"妖异草,16,樱花花瓣,30,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"摩登兔紧身裤",\
@"妖异草,16,樱花花瓣,30,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"摩登兔荷叶裙",\
@"脏绷带,16,浓密毛皮,35,汗与泪的结晶,10,红色宝珠,3,雨露之丝,12",@"古武道衣服下装",\
@"妖异草,16,黑珍珠,8,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"王宫魔术师长袍下装",\
@"彩虹色的布片,16,蝴蝶翅膀,24,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"小丑长裤",\
@"彩虹色的布片,16,红浆果,24,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"奇迹外衣下装",\
@"浓密毛皮,16,神奇海草,30,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"古代魔术法衣下装",\
@"海风草,24,闪避草,50,汗与泪的结晶,15,绿色宝珠,4,雨露之丝,16",@"求道者道衣下装",\
@"蝙蝠翅膀,24,夜之幕,1,汗与泪的结晶,15,蓝色宝珠,4,雨露之丝,16",@"大魔导长袍下装",\
@"野兽原皮,24,魔兽原皮,12,汗与泪的结晶,15,黄色宝珠,4,雨露之丝,16",@"追击者皮衣下装",\
@"浓密毛皮,24,精灵石,2,汗与泪的结晶,15,蓝色宝珠,4,雨露之丝,16",@"偶像衣服下装",\
@"彩虹色的布片,24,樱花花瓣,50,汗与泪的结晶,15,紫色宝珠,4,雨露之丝,16",@"作曲家衣服下装",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,雨露之丝,20",@"羊之衣下装",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,雨露之丝,20",@"舞台短裤",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,雨露之丝,20",@"舞台芭蕾裙下装",\
@"幻兽原皮,3,黄金装饰铠甲下装,1,汗与泪的结晶,20,彩虹宝珠,2,雨露之丝,20",@"台风皮衣下装",\
@"妖精的棉花,32,彩虹色的布片,72,汗与泪的结晶,30,彩虹宝珠,3,雨露之丝,28",@"退魔法衣下装",\
@"妖精的棉花,32,史莱姆果冻,80,汗与泪的结晶,50,彩虹宝珠,4,雨露之丝,32",@"圣贤者长袍下装",\
@"妖精的棉花,32,镜之石,32,汗与泪的结晶,50,彩虹宝珠,4,雨露之丝,32",@"古代王族裤子",\
@"野兽原皮,1,0,0,0,0,0,0,0,0",@"皮手套",\
@"麻线,2,0,0,0,0,0,0,0,0",@"暖场艺人手环",\
@"麻线,2,0,0,0,0,0,0,0,0",@"亚麻手套",\
@"麻线,2,木棉草,1,0,0,0,0,0,0",@"新手艺人手套",\
@"麻线,2,木棉草,1,0,0,0,0,0,0",@"剪柳手环",\
@"木棉草,2,浓密毛皮,2,0,0,0,0,0,0",@"射手手套",\
@"木棉草,2,神奇海草,1,0,0,0,0,0,0",@"修炼护腕",\
@"木棉草,2,野兽原皮,1,0,0,0,0,0,0",@"藏红花手套",\
@"木棉草,2,大贝壳,2,0,0,0,0,0,0",@"初级魔法战士手套",\
@"木棉草,2,美丽蘑菇,6,0,0,0,0,0,0",@"舞者护腕",\
@"木棉草,2,野兽原皮,1,0,0,0,0,0,0",@"疾风手套",\
@"木棉草,2,浓密毛皮,1,0,0,0,0,0,0",@"魔术师手套",\
@"丝草,2,麻线,2,神奇海草,1,0,0,0,0",@"功夫护腕",\
@"丝草,2,大贝壳,2,野兽原皮,1,0,0,0,0",@"斗牛士手套",\
@"丝草,2,沙漠水果,2,野兽原皮,2,0,0,0,0",@"西部手套",\
@"丝草,2,绿苔,3,草原木头,2,0,0,0,0",@"树叶手环",\
@"丝草,3,武道精华,1,拳骨菇,2,雨露之丝,1,0,0",@"拳法腕带",\
@"丝草,3,浓密毛皮,2,天籁之蜜,2,雨露之丝,1,0,0",@"讲述者手套",\
@"丝草,3,净化之水,3,黑珍珠,1,雨露之丝,1,0,0",@"神官手套",\
@"丝草,3,美丽蘑菇,4,小块原骨,2,雨露之丝,1,0,0",@"森人手套",\
@"闪光草,4,龙的原皮,1,绿苔,3,雨露之丝,2,0,0",@"击剑士手环",\
@"闪光草,4,闪避草,1,沙漠水果,1,雨露之丝,2,0,0",@"奇术师手套",\
@"闪光草,5,领悟草,2,万年雪,3,雨露之丝,2,0,0",@"祭司手套",\
@"闪光草,8,纯白木头,10,紫色宝珠,1,雨露之丝,8,0,0",@"大师护腕",\
@"闪光草,8,红珊瑚,36,黄色宝珠,1,雨露之丝,8,0,0",@"混混手环",\
@"闪光草,10,光之石,12,绿色宝珠,1,雨露之丝,8,0,0",@"圣者手套",\
@"闪光草,10,蝙蝠翅膀,12,红色宝珠,1,雨露之丝,8,0,0",@"财宝手套",\
@"闪避草,12,武道精华,4,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"拳圣手环",\
@"浓密毛皮,12,大块原骨,25,汗与泪的结晶,5,绿色宝珠,2,雨露之丝,10",@"原始兽手套",\
@"妖异草,12,蛇蜕,25,汗与泪的结晶,5,绿色宝珠,2,雨露之丝,10",@"摩登兔手镯",\
@"脏绷带,12,武道精华,2,汗与泪的结晶,5,红色宝珠,2,雨露之丝,10",@"古武道手环",\
@"彩虹色的布片,12,野兽原皮,30,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"小丑手套",\
@"彩虹色的布片,12,柔软的羊毛,2,汗与泪的结晶,5,蓝色宝珠,2,雨露之丝,10",@"奇迹手套",\
@"浓密毛皮,12,小贝壳,30,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"古代魔术手环",\
@"海风草,18,脏绷带,40,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"求道者手套",\
@"蝙蝠翅膀,18,妖异草,40,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"大魔导手环",\
@"野兽原皮,18,龙的原皮,2,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"追击者护手",\
@"领悟草,18,史莱姆果冻,40,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"大贤者手套",\
@"浓密毛皮,18,万年雪,40,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"偶像手镯",\
@"彩虹色的布片,18,魔兽原骨,5,汗与泪的结晶,10,紫色宝珠,3,雨露之丝,12",@"作曲家手镯",\
@"妖精的棉花,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"羊之手套",\
@"幻兽原皮,2,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"领悟手套",\
@"妖精的棉花,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"舞台护腕",\
@"妖精的棉花,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"舞台护臂",\
@"妖精的棉花,20,黄金装饰护臂,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"台风手套",\
@"妖精的棉花,24,幻兽原骨,4,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"退魔手环",\
@"妖精的棉花,24,斩风羽,8,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"暗鸦护手",\
@"妖精的棉花,24,光之石,60,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"圣贤者护臂",\
@"妖精的棉花,24,星之碎片,70,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"黄龙手环",\
@"妖精的棉花,24,魔法树木,24,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"古代王族护臂",\
@"野兽原皮,1,0,0,0,0,0,0,0,0",@"皮鞋",\
@"麻线,2,0,0,0,0,0,0,0,0",@"暖场艺人长靴",\
@"麻线,2,0,0,0,0,0,0,0,0",@"亚麻鞋",\
@"麻线,2,红浆果,1,0,0,0,0,0,0",@"新手艺人长靴",\
@"麻线,2,木棉草,1,0,0,0,0,0,0",@"剪柳鞋",\
@"麻线,2,纯白木头,1,0,0,0,0,0,0",@"治愈长靴",\
@"丝草,1,麻线,1,0,0,0,0,0,0",@"丝织凉鞋",\
@"木棉草,2,野兽原皮,2,0,0,0,0,0,0",@"射手鞋",\
@"木棉草,2,野兽原皮,1,0,0,0,0,0,0",@"修炼长靴",\
@"木棉草,2,野兽原皮,1,0,0,0,0,0,0",@"藏红花长靴",\
@"木棉草,2,绿苔,1,0,0,0,0,0,0",@"药师鞋",\
@"木棉草,2,野兽原皮,2,0,0,0,0,0,0",@"初级魔法战士鞋",\
@"木棉草,2,小贝壳,6,0,0,0,0,0,0",@"舞者鞋",\
@"木棉草,2,草原木头,1,0,0,0,0,0,0",@"疾风长靴",\
@"木棉草,2,领悟草,1,0,0,0,0,0,0",@"闪避之靴",\
@"木棉草,2,领悟草,1,0,0,0,0,0,0",@"魔术师短靴",\
@"木棉草,2,魔力之土,2,0,0,0,0,0,0",@"学者脚带",\
@"丝草,2,草原木头,1,闪避草,1,0,0,0,0",@"功夫鞋",\
@"丝草,2,纯白木头,1,维纳尔贝壳,1,0,0,0,0",@"斗牛士鞋",\
@"丝草,2,沙漠水果,1,蝴蝶翅膀,1,0,0,0,0",@"咒术师鞋",\
@"丝草,2,坚硬的胡桃,2,草原木头,2,0,0,0,0",@"守护鞋",\
@"丝草,2,黄色之眼,2,魔兽原皮,2,0,0,0,0",@"西部长靴",\
@"丝草,2,野兽原皮,2,草原木头,2,0,0,0,0",@"树叶长靴",\
@"丝草,3,闪避草,1,麻线,2,雨露之丝,1,0,0",@"拳法脚带",\
@"丝草,3,大鳞片,1,天籁之蜜,2,雨露之丝,1,0,0",@"讲述者长靴",\
@"丝草,3,净化之水,3,埃尔托纳水仙,1,雨露之丝,1,0,0",@"神官鞋",\
@"丝草,3,美丽蘑菇,3,七色茧,1,雨露之丝,1,0,0",@"魔导士鞋",\
@"丝草,3,纯白木头,2,大块原骨,2,雨露之丝,1,0,0",@"森人长靴",\
@"闪光草,4,魔兽原骨,1,绿苔,3,雨露之丝,2,0,0",@"击剑士长靴",\
@"闪光草,4,红珊瑚,4,水之树木,2,雨露之丝,2,0,0",@"水之脚带",\
@"闪光草,4,小块化石,2,沙漠水果,1,雨露之丝,2,0,0",@"奇术师长靴",\
@"闪光草,4,光之石,1,万年雪,3,雨露之丝,2,0,0",@"祭司长靴",\
@"闪光草,4,红珊瑚,2,柔软的羊毛,1,雨露之丝,2,0,0",@"神圣长靴",\
@"闪光草,8,万年雪,60,蓝色宝珠,1,雨露之丝,8,0,0",@"真理鞋",\
@"闪光草,8,龙的原皮,2,紫色宝珠,1,雨露之丝,8,0,0",@"大师鞋",\
@"闪光草,8,椰子,60,黄色宝珠,1,雨露之丝,8,0,0",@"混混长靴",\
@"闪光草,10,星之碎片,12,紫色宝珠,1,雨露之丝,8,0,0",@"占星术士长靴",\
@"闪光草,10,光之石,12,绿色宝珠,1,雨露之丝,8,0,0",@"圣者长靴",\
@"闪光草,10,蝙蝠翅膀,12,红色宝珠,1,雨露之丝,8,0,0",@"财宝长靴",\
@"闪光草,10,七色茧,12,蓝色宝珠,1,雨露之丝,8,0,0",@"知识凉鞋",\
@"彩虹色的布片,12,星之碎片,25,汗与泪的结晶,5,紫色宝珠,2,雨露之丝,10",@"月之鞋",\
@"闪避草,12,蝴蝶翅膀,25,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"拳圣鞋",\
@"浓密毛皮,12,小块原骨,25,汗与泪的结晶,5,绿色宝珠,2,雨露之丝,10",@"原始兽长靴",\
@"妖异草,12,猫砂,25,汗与泪的结晶,5,绿色宝珠,2,雨露之丝,10",@"摩登兔鞋",\
@"脏绷带,12,大块原骨,30,汗与泪的结晶,5,红色宝珠,2,雨露之丝,10",@"古武道长靴",\
@"妖异草,12,大块原骨,30,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"王宫魔术师鞋",\
@"彩虹色的布片,12,红珊瑚,12,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"小丑鞋",\
@"彩虹色的布片,12,大块原骨,30,汗与泪的结晶,5,蓝色宝珠,2,雨露之丝,10",@"奇迹靴子",\
@"浓密毛皮,12,大块原骨,30,汗与泪的结晶,5,黄色宝珠,2,雨露之丝,10",@"古代魔术长靴",\
@"海风草,18,龙的原皮,2,汗与泪的结晶,10,绿色宝珠,3,雨露之丝,12",@"求道者长靴",\
@"蝙蝠翅膀,18,小贝壳,60,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"大魔导鞋",\
@"野兽原皮,18,龙的原皮,2,汗与泪的结晶,10,黄色宝珠,3,雨露之丝,12",@"追击者长靴",\
@"领悟草,18,魔兽原皮,8,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"大贤者鞋",\
@"浓密毛皮,18,大块原骨,40,汗与泪的结晶,10,蓝色宝珠,3,雨露之丝,12",@"偶像长靴",\
@"彩虹色的布片,18,猫砂,50,汗与泪的结晶,10,紫色宝珠,3,雨露之丝,12",@"作曲家脚带",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"羊之鞋",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"领悟长靴",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"舞台鞋",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"舞台长靴",\
@"妖精的棉花,20,黄金装饰鞋,1,汗与泪的结晶,15,彩虹宝珠,1,雨露之丝,16",@"台风长靴",\
@"妖精的棉花,24,魔兽原骨,24,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"退魔鞋",\
@"妖精的棉花,24,蛇蜕,60,汗与泪的结晶,25,彩虹宝珠,2,雨露之丝,24",@"暗鸦靴",\
@"妖精的棉花,24,万年雪,60,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"圣贤者鞋",\
@"妖精的棉花,24,领悟草,40,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"黄龙鞋",\
@"妖精的棉花,24,坚硬的胡桃,60,汗与泪的结晶,40,彩虹宝珠,3,雨露之丝,28",@"古代王族靴",\
@"闪避草,10,美丽蘑菇,10,雨露之丝,1,0,0,0,0",@"豪华的地毯小·绿",\
@"闪避草,15,美丽蘑菇,15,雨露之丝,1,0,0,0,0",@"豪华的地毯中·绿",\
@"闪避草,20,美丽蘑菇,20,雨露之丝,1,0,0,0,0",@"豪华的地毯大·绿",\
@"丝草,30,奥古力德化石角,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"奥伽玩偶·男",\
@"丝草,30,奥古力德化石角,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"奥伽玩偶·女",\
@"丝草,30,维纳尔贝壳,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"维迪玩偶·男",\
@"丝草,30,维纳尔贝壳,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"维迪玩偶·女",\
@"丝草,30,埃尔托纳水仙,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"埃尔夫玩偶·男",\
@"丝草,30,埃尔托纳水仙,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"埃尔夫玩偶·女",\
@"丝草,30,普库兰藏红花,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"普库里坡玩偶·男",\
@"丝草,30,普库兰藏红花,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"普库里坡玩偶·女",\
@"丝草,30,多瓦切卡油,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"多瓦夫玩偶·男",\
@"丝草,30,多瓦切卡油,10,雨露之丝,4,汗与泪的结晶,30,0,0",@"多瓦夫玩偶·女",\
@"柔软的羊毛,4,夜之幕,4,雨露之丝,3,汗与泪的结晶,10,0,0",@"国际象棋棋盘地毯·黑",\
@"蝙蝠翅膀,30,夜之幕,2,雨露之丝,4,汗与泪的结晶,20,0,0",@"多拉奇地毯",\
@"浓密毛皮,30,脏绷带,10,雨露之丝,4,汗与泪的结晶,20,0,0",@"魔萌地毯",\
@"浓密毛皮,30,樱花花瓣,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"粉红魔萌地毯",\
@"史莱姆果冻,30,史莱姆时尚花,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"史莱姆地毯",\
@"浓密毛皮,30,彩虹色的布片,30,雨露之丝,6,汗与泪的结晶,25,0,0",@"拼布图案地毯·粉",\
@"脏绷带,16,夜之幕,1,雨露之丝,3,汗与泪的结晶,10,0,0",@"黑曜地毯",\
@"闪光草,16,花蜜,16,雨露之丝,5,0,0,0,0",@"水晶地毯",\
@"闪光草,20,彩虹色的布片,20,雨露之丝,5,汗与泪的结晶,20,0,0",@"彩砖花纹地毯",\
@"闪光草,16,冷达种子,5,雨露之丝,5,0,0,0,0",@"樱桃地毯",\
@"闪光草,16,冷达种子,5,雨露之丝,5,0,0,0,0",@"豌豆地毯",\
@"夜之幕,2,星之碎片,10,雨露之丝,5,0,0,0,0",@"星空地毯·紫",\
@"闪光草,20,黑珍珠,10,雨露之丝,5,汗与泪的结晶,20,0,0",@"格纹地毯·红",\
@"彩虹色的布片,15,天籁之蜜,10,雨露之丝,5,0,0,0,0",@"音符地毯·黑",\
@"柔软的羊毛,2,净化之水,10,雨露之丝,5,0,0,0,0",@"云朵地毯",\
@"柔软的树枝,3,0,0,0,0,0,0,0,0",@"月桂树枝",\
@"柔软的树枝,3,铁矿石,2,0,0,0,0,0,0",@"别针短杖",\
@"柔软的树枝,4,花蜜,1,0,0,0,0,0,0",@"鲜花短杖",\
@"结实的树枝,3,史莱姆果冻,1,0,0,0,0,0,0",@"史莱姆短杖",\
@"结实的树枝,4,星之碎片,1,0,0,0,0,0,0",@"闪耀之杖",\
@"结实的树枝,5,浓密毛皮,1,0,0,0,0,0,0",@"魔萌短杖",\
@"结实的树枝,6,斩风羽,2,0,0,0,0,0,0",@"羽翼短杖",\
@"柔韧的树枝,4,星之碎片,1,七色茧,1,0,0,0,0",@"爱心短杖",\
@"柔韧的树枝,5,魔力之土,3,史莱姆果冻,3,0,0,0,0",@"史莱姆塔杖",\
@"柔韧的树枝,6,魔兽原骨,1,天籁之蜜,3,0,0,0,0",@"魔笛短杖",\
@"柔韧的树枝,6,幻魔石,1,七色茧,1,闪光树汁,2,0,0",@"魔力短杖",\
@"柔韧的树枝,6,浓密毛皮,3,蝙蝠翅膀,2,闪光树汁,3,0,0",@"马波雷纳杖",\
@"干净的树枝,4,花蜜,3,彩虹色的布片,1,闪光树汁,4,0,0",@"棒棒糖杖",\
@"干净的树枝,6,海风草,4,紫色之眼,1,闪光树汁,6,0,0",@"阳伞短杖",\
@"干净的树枝,8,龙的原皮,2,蓝色之眼,4,闪光树汁,8,0,0",@"龙之短杖",\
@"干净的树枝,20,绿苔,60,绿色宝珠,3,闪光树汁,16,0,0",@"世界树之杖",\
@"干净的树枝,25,天使的神酒,3,黄色宝珠,3,闪光树汁,16,0,0",@"天使杖",\
@"暗黑树木,30,蝙蝠翅膀,60,汗与泪的结晶,20,紫色宝珠,5,闪光树汁,20",@"恶魔杖",\
@"暗黑树木,35,脏绷带,60,汗与泪的结晶,20,蓝色宝珠,6,闪光树汁,20",@"哥特阳伞",\
@"纯白木头,40,美丽蘑菇,40,汗与泪的结晶,30,蓝色宝珠,10,闪光树汁,24",@"泰塔尼亚杖",\
@"魔法树木,40,黄金装饰短杖,1,汗与泪的结晶,40,彩虹宝珠,3,闪光树汁,32",@"圣王之短杖",\
@"魔法树木,50,时之水晶,5,汗与泪的结晶,60,彩虹宝珠,4,闪光树汁,44",@"光之杖",\
@"魔法树木,50,天使的神酒,8,汗与泪的结晶,90,彩虹宝珠,4,闪光树汁,50",@"梦想短杖",\
@"魔法树木,50,涟漪之露,80,汗与泪的结晶,90,彩虹宝珠,6,闪光树汁,50",@"圣人之泪",\
@"纯白木头,4,繁星的眼泪,12,0,0,0,0,0,0",@"繁星之杖",\
@"柔软的树枝,3,0,0,0,0,0,0,0,0",@"橡木法杖",\
@"柔软的树枝,3,热乎乎的石头,1,0,0,0,0,0,0",@"魔导士法杖",\
@"柔软的树枝,4,魔力之土,2,0,0,0,0,0,0",@"制裁法杖",\
@"结实的树枝,3,水之树木,1,0,0,0,0,0,0",@"雨云法杖",\
@"结实的树枝,4,魔兽原骨,1,0,0,0,0,0,0",@"封魔法杖",\
@"结实的树枝,5,涟漪之露,4,0,0,0,0,0,0",@"海鸣法杖",\
@"结实的树枝,6,精灵石,1,0,0,0,0,0,0",@"妖精法杖",\
@"柔韧的树枝,4,魔兽原角,1,魔力之土,3,0,0,0,0",@"雷鸣法杖",\
@"柔韧的树枝,5,斩风羽,2,红色宝石,1,0,0,0,0",@"比奥拉法杖",\
@"柔韧的树枝,6,魔兽原骨,1,白色珍珠,1,0,0,0,0",@"符文法杖",\
@"柔韧的树枝,6,熔岩碎片,3,炎之树木,3,闪光树汁,2,0,0",@"岩浆法杖",\
@"柔韧的树枝,6,精灵石,1,绿色宝石,1,闪光树汁,3,0,0",@"精灵法杖",\
@"干净的树枝,4,幻魔石,1,黄色宝石,1,闪光树汁,4,0,0",@"魔眼法杖",\
@"干净的树枝,6,冰之树木,3,紫色之眼,1,闪光树汁,6,0,0",@"冰之法杖",\
@"干净的树枝,8,龙的原骨,2,绿色之眼,4,闪光树汁,8,0,0",@"塞壬法杖",\
@"干净的树枝,20,净化之水,60,紫色宝珠,3,闪光树汁,16,0,0",@"弧形法杖",\
@"干净的树枝,25,史莱姆时尚花,3,绿色宝珠,3,闪光树汁,16,0,0",@"福音法杖",\
@"暗黑树木,30,净化之水,60,汗与泪的结晶,20,黄色宝珠,5,闪光树汁,20",@"贤者法杖",\
@"冰之树木,35,天使的神酒,3,汗与泪的结晶,20,绿色宝珠,6,闪光树汁,20",@"女神法杖",\
@"炎之树木,40,龙的原骨,4,汗与泪的结晶,30,红色宝珠,10,闪光树汁,24",@"龙之法杖",\
@"魔法树木,40,黄金装饰双手杖,1,汗与泪的结晶,40,彩虹宝珠,3,闪光树汁,32",@"圣王之法杖",\
@"魔法树木,50,幻兽原骨,5,汗与泪的结晶,60,彩虹宝珠,4,闪光树汁,44",@"光之法杖",\
@"魔法树木,50,七色茧,80,汗与泪的结晶,90,彩虹宝珠,4,闪光树汁,50",@"彩虹法杖",\
@"魔法树木,50,幻兽原骨,5,汗与泪的结晶,90,彩虹宝珠,6,闪光树汁,50",@"不死者魔杖",\
@"柔软的树枝,3,0,0,0,0,0,0,0,0",@"晾衣杆",\
@"柔软的树枝,3,铁矿石,1,0,0,0,0,0,0",@"天秤棍",\
@"柔软的树枝,4,闪避草,1,0,0,0,0,0,0",@"橡木棍",\
@"结实的树枝,3,领悟草,1,0,0,0,0,0,0",@"行者之棍",\
@"结实的树枝,4,草原木头,3,0,0,0,0,0,0",@"六角棍",\
@"结实的树枝,5,武道精华,1,0,0,0,0,0,0",@"演武之棍",\
@"结实的树枝,6,绿色宝石,1,0,0,0,0,0,0",@"仪式棍",\
@"柔韧的树枝,4,草原木头,2,大仙人掌,1,0,0,0,0",@"突刺棍",\
@"柔韧的树枝,5,梦境花,4,小块化石,3,0,0,0,0",@"浅眠之棍",\
@"柔韧的树枝,6,重金属,1,大块原骨,3,0,0,0,0",@"碾压之棍",\
@"柔韧的树枝,6,水之树木,3,万年雪,3,闪光树汁,2,0,0",@"落雨棍",\
@"柔韧的树枝,6,武道精华,1,蓝色宝石,1,闪光树汁,3,0,0",@"罗刹之棍",\
@"干净的树枝,4,魔兽原角,1,大块原骨,3,闪光树汁,4,0,0",@"狼牙棒",\
@"干净的树枝,6,武道精华,2,红色之眼,1,闪光树汁,6,0,0",@"夜叉之棍",\
@"干净的树枝,8,龙的原皮,2,黄色之眼,4,闪光树汁,8,0,0",@"龙棍",\
@"干净的树枝,20,光之石,30,黄色宝珠,3,闪光树汁,16,0,0",@"日轮之棍",\
@"干净的树枝,25,蛇蜕,60,绿色宝珠,3,闪光树汁,16,0,0",@"白蛇之棍",\
@"暗黑树木,30,脏绷带,60,汗与泪的结晶,20,紫色宝珠,5,闪光树汁,20",@"悲叹之棍",\
@"冰之树木,35,武道精华,6,汗与泪的结晶,20,蓝色宝珠,6,闪光树汁,20",@"修罗之棍",\
@"冰之树木,40,小鳞片,60,汗与泪的结晶,30,蓝色宝珠,10,闪光树汁,24",@"神龙棍",\
@"魔法树木,40,黄金装饰棍,1,汗与泪的结晶,40,彩虹宝珠,3,闪光树汁,32",@"圣王之棍",\
@"魔法树木,50,脏绷带,80,汗与泪的结晶,60,彩虹宝珠,4,闪光树汁,44",@"阴阳道之棍",\
@"魔法树木,50,幻兽原骨,5,汗与泪的结晶,90,彩虹宝珠,4,闪光树汁,50",@"恶魔棍",\
@"幻兽原骨,5,蝙蝠翅膀,80,汗与泪的结晶,90,彩虹宝珠,6,闪光树汁,50",@"默示棍",\
@"柔软的树枝,3,0,0,0,0,0,0,0,0",@"白木之扇",\
@"柔软的树枝,2,蝴蝶翅膀,1,0,0,0,0,0,0",@"羽扇",\
@"柔软的树枝,4,铁矿石,3,0,0,0,0,0,0",@"战斗扇",\
@"结实的树枝,3,铁矿石,3,0,0,0,0,0,0",@"铁扇",\
@"结实的树枝,4,小甲壳,2,0,0,0,0,0,0",@"龟之扇",\
@"结实的树枝,5,熔岩碎片,1,0,0,0,0,0,0",@"鸟之扇",\
@"结实的树枝,6,蝴蝶翅膀,3,0,0,0,0,0,0",@"七星扇",\
@"柔韧的树枝,4,猫砂,2,冰的结晶,1,0,0,0,0",@"猫猫扇",\
@"柔韧的树枝,5,彩虹色的布片,2,光之石,1,0,0,0,0",@"孔雀之扇",\
@"柔韧的树枝,6,蛇蜕,1,雷鸣珠,1,0,0,0,0",@"蛇之扇",\
@"柔韧的树枝,6,星之碎片,1,夜之幕,1,闪光树汁,2,0,0",@"星之扇",\
@"柔韧的树枝,6,幻魔石,1,绿色宝石,1,闪光树汁,3,0,0",@"魔法扇",\
@"干净的树枝,4,暗黑树木,3,净化之水,3,闪光树汁,4,0,0",@"魔性扇",\
@"干净的树枝,6,月之恩惠,1,黄色之眼,1,闪光树汁,6,0,0",@"月之扇",\
@"干净的树枝,8,彩虹色的布片,3,紫色之眼,4,闪光树汁,8,0,0",@"彩虹之扇",\
@"干净的树枝,20,熔岩碎片,60,红色宝珠,3,闪光树汁,16,0,0",@"太阳之扇",\
@"干净的树枝,25,斩风羽,7,紫色宝珠,3,闪光树汁,16,0,0",@"芭蕉扇",\
@"纯白木头,30,美丽蘑菇,60,汗与泪的结晶,20,黄色宝珠,5,闪光树汁,20",@"天下太平",\
@"暗黑树木,35,斩风羽,7,汗与泪的结晶,20,紫色宝珠,6,闪光树汁,20",@"必杀之扇",\
@"暗黑树木,40,魔兽原骨,8,汗与泪的结晶,30,黄色宝珠,10,闪光树汁,24",@"风林火山",\
@"魔法树木,40,黄金装饰扇,1,汗与泪的结晶,40,彩虹宝珠,3,闪光树汁,32",@"圣王之扇",\
@"魔法树木,50,彩虹色的布片,80,汗与泪的结晶,60,彩虹宝珠,4,闪光树汁,44",@"万花视界",\
@"魔法树木,50,海风草,80,汗与泪的结晶,90,彩虹宝珠,4,闪光树汁,50",@"青岚之扇",\
@"魔法树木,50,花蜜,80,汗与泪的结晶,90,彩虹宝珠,6,闪光树汁,50",@"春紫菀",\
@"冰之树木,4,祈晴竹叶,12,0,0,0,0,0,0",@"七夕扇",\
@"柔软的树枝,3,0,0,0,0,0,0,0,0",@"青竹弓",\
@"柔软的树枝,3,结实的树枝,1,0,0,0,0,0,0",@"新木弓",\
@"柔软的树枝,4,草原木头,3,0,0,0,0,0,0",@"古木之弓",\
@"结实的树枝,3,大块原骨,2,0,0,0,0,0,0",@"长弓",\
@"结实的树枝,4,脏绷带,2,0,0,0,0,0,0",@"紫檀弓",\
@"结实的树枝,5,野兽原皮,3,0,0,0,0,0,0",@"猎人之弓",\
@"结实的树枝,6,妖异草,4,0,0,0,0,0,0",@"小恶魔之弓",\
@"柔韧的树枝,4,纯白木头,4,美丽蘑菇,3,0,0,0,0",@"爱神之弓",\
@"柔韧的树枝,5,斩风羽,2,天使的神酒,1,0,0,0,0",@"风斩之弓",\
@"柔韧的树枝,6,妖异草,3,粉红珍珠,2,0,0,0,0",@"诱惑之弓",\
@"柔韧的树枝,6,精灵石,2,斩风羽,1,闪光树汁,2,0,0",@"白鸟弓",\
@"柔韧的树枝,6,光之石,4,黄色宝石,1,闪光树汁,3,0,0",@"月光之弓",\
@"干净的树枝,4,椰子,4,绿苔,4,闪光树汁,4,0,0",@"无限弓",\
@"干净的树枝,6,夜之幕,2,紫色之眼,1,闪光树汁,6,0,0",@"暗夜狙击手",\
@"干净的树枝,8,圣者之灰,2,绿色之眼,4,闪光树汁,8,0,0",@"朱雀弓",\
@"干净的树枝,20,野兽原皮,60,蓝色宝珠,3,闪光树汁,16,0,0",@"喀戎之弓",\
@"干净的树枝,25,光之石,30,蓝色宝珠,3,闪光树汁,16,0,0",@"阿尔忒弥斯之弓",\
@"暗黑树木,30,蛇蜕,60,汗与泪的结晶,20,绿色宝珠,5,闪光树汁,20",@"翼蜥之弓",\
@"冰之树木,35,脏绷带,60,汗与泪的结晶,20,蓝色宝珠,6,闪光树汁,20",@"地狱之弓",\
@"冰之树木,40,天使的神酒,4,汗与泪的结晶,30,蓝色宝珠,10,闪光树汁,24",@"天使之弓",\
@"魔法树木,40,黄金装饰弓,1,汗与泪的结晶,40,彩虹宝珠,3,闪光树汁,32",@"圣王之弓",\
@"魔法树木,50,龙的原角,20,汗与泪的结晶,60,彩虹宝珠,4,闪光树汁,44",@"奥丁之弓",\
@"魔法树木,50,龙的原骨,8,汗与泪的结晶,90,彩虹宝珠,4,闪光树汁,50",@"双头蛇",\
@"魔法树木,50,天籁之蜜,80,汗与泪的结晶,90,彩虹宝珠,6,闪光树汁,50",@"俄耳甫斯之弓"/*,\
@"草原木头,10,浓密毛皮,8,闪光树汁,1,0,0,0,0",@"豪华的椅子·绿",\
@"草原木头,14,浓密毛皮,16,闪光树汁,2,0,0,0,0",@"豪华的长椅·绿",\
@"草原木头,20,黄金碎片,2,闪光树汁,3,0,0,0,0",@"豪华的宝座·绿",\
@"草原木头,10,小贝壳,10,闪光树汁,1,0,0,0,0",@"豪华的桌子小·绿",\
@"草原木头,14,大贝壳,10,闪光树汁,2,0,0,0,0",@"豪华的桌子大·绿",\
@"草原木头,12,万年雪,12,闪光树汁,1,0,0,0,0",@"豪华的陈列柜·绿",\
@"草原木头,16,美丽蘑菇,12,闪光树汁,2,0,0,0,0",@"豪华的衣柜·绿",\
@"草原木头,10,大贝壳,10,闪光树汁,1,0,0,0,0",@"豪华的书架·绿",\
@"草原木头,10,小贝壳,20,闪光树汁,1,0,0,0,0",@"豪华的餐具架·绿",\
@"草原木头,12,红珊瑚,8,闪光树汁,1,0,0,0,0",@"豪华的厨台·绿",\
@"草原木头,12,熔岩碎片,8,闪光树汁,1,0,0,0,0",@"豪华的烤炉·绿",\
@"草原木头,20,浓密毛皮,20,闪光树汁,3,0,0,0,0",@"豪华的床·绿",\
@"草原木头,14,涟漪之露,10,闪光树汁,2,0,0,0,0",@"豪华的浴盆·绿",\
@"草原木头,10,绿苔,10,闪光树汁,1,0,0,0,0",@"豪华的屏风·绿",\
@"草原木头,16,星之碎片,10,闪光树汁,2,0,0,0,0",@"豪华的收纳柜·绿",\
@"草原木头,12,绿苔,10,闪光树汁,1,0,0,0,0",@"豪华的柜台小·绿",\
@"草原木头,16,绿苔,20,闪光树汁,2,0,0,0,0",@"豪华的柜台大·绿",\
@"草原木头,14,熔岩碎片,12,闪光树汁,2,0,0,0,0",@"豪华的暖炉·绿",\
@"草原木头,20,沙漠水果,16,闪光树汁,3,0,0,0,0",@"豪华的宴会桌·绿",\
@"纯白木头,10,坚硬的胡桃,8,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格椅子",\
@"纯白木头,14,坚硬的胡桃,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格长椅",\
@"纯白木头,10,红浆果,8,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格桌子小",\
@"纯白木头,14,红浆果,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格桌子大",\
@"纯白木头,16,美丽蘑菇,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格衣柜",\
@"纯白木头,10,坚硬的胡桃,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格书架",\
@"纯白木头,10,美丽蘑菇,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格餐具架",\
@"纯白木头,12,天籁之蜜,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格厨台",\
@"纯白木头,12,坚硬的胡桃,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格烤炉",\
@"纯白木头,20,天籁之蜜,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"点心风格床",\
@"纯白木头,14,天籁之蜜,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格浴盆",\
@"纯白木头,10,花蜜,8,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格屏风",\
@"纯白木头,16,花蜜,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格收纳柜",\
@"纯白木头,12,花蜜,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"点心风格柜台小",\
@"纯白木头,16,花蜜,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"点心风格柜台大",\
@"纯白木头,20,沙漠水果,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"点心风格宴会桌",\
@"冰之树木,10,史莱姆果冻,8,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆椅子",\
@"冰之树木,14,史莱姆果冻,16,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆长椅",\
@"冰之树木,10,史莱姆时尚花,4,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆桌子小",\
@"冰之树木,14,史莱姆时尚花,8,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆桌子大",\
@"冰之树木,16,史莱姆时尚花,12,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆衣柜",\
@"冰之树木,10,史莱姆果冻,10,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆书架",\
@"冰之树木,10,沙漠水果,16,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆餐具架",\
@"冰之树木,12,史莱姆果冻,12,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆厨台",\
@"冰之树木,12,史莱姆时尚花,8,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆烤炉",\
@"冰之树木,20,史莱姆时尚花,20,闪光树汁,5,汗与泪的结晶,20,0,0",@"史莱姆床",\
@"冰之树木,14,史莱姆果冻,8,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆浴盆",\
@"冰之树木,10,史莱姆果冻,8,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆屏风",\
@"冰之树木,16,史莱姆果冻,16,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆收纳柜",\
@"冰之树木,12,史莱姆果冻,10,闪光树汁,3,汗与泪的结晶,20,0,0",@"史莱姆柜台小",\
@"冰之树木,16,史莱姆果冻,20,闪光树汁,4,汗与泪的结晶,20,0,0",@"史莱姆柜台大",\
@"冰之树木,20,沙漠水果,16,闪光树汁,5,汗与泪的结晶,20,0,0",@"史莱姆宴会桌",\
@"暗黑树木,10,蝙蝠翅膀,8,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特椅子",\
@"暗黑树木,14,蝙蝠翅膀,16,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特长椅",\
@"暗黑树木,10,蛇蜕,10,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特桌子小",\
@"暗黑树木,14,蛇蜕,20,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特桌子大",\
@"暗黑树木,16,妖异草,20,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特衣柜",\
@"暗黑树木,10,蛇蜕,20,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特书架",\
@"暗黑树木,10,蝙蝠翅膀,16,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特餐具架",\
@"暗黑树木,12,妖异草,16,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特厨台",\
@"暗黑树木,12,熔岩碎片,20,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特烤炉",\
@"暗黑树木,20,蝙蝠翅膀,20,闪光树汁,5,汗与泪的结晶,20,0,0",@"哥特床",\
@"暗黑树木,14,涟漪之露,20,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特浴盆",\
@"暗黑树木,10,蝙蝠翅膀,10,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特屏风",\
@"暗黑树木,16,蛇蜕,16,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特收纳柜",\
@"暗黑树木,12,蛇蜕,12,闪光树汁,3,汗与泪的结晶,20,0,0",@"哥特柜台小",\
@"暗黑树木,16,蛇蜕,24,闪光树汁,4,汗与泪的结晶,20,0,0",@"哥特柜台大",\
@"暗黑树木,20,沙漠水果,16,闪光树汁,5,汗与泪的结晶,20,0,0",@"哥特宴会桌",\
@"草原木头,5,红珊瑚,5,铁制钉子,4,0,0,0,0",@"单层方块·红",\
@"草原木头,10,红珊瑚,10,铁制钉子,8,0,0,0,0",@"双层方块·红",\
@"草原木头,15,红珊瑚,15,铁制钉子,12,0,0,0,0",@"三层方块·红",\
@"草原木头,5,维纳尔贝壳,5,铁制钉子,4,0,0,0,0",@"单层方块·蓝",\
@"草原木头,10,维纳尔贝壳,10,铁制钉子,8,0,0,0,0",@"双层方块·蓝",\
@"草原木头,15,维纳尔贝壳,15,铁制钉子,12,0,0,0,0",@"三层方块·蓝",\
@"草原木头,5,绿苔,5,铁制钉子,4,0,0,0,0",@"单层方块·绿",\
@"草原木头,10,绿苔,10,铁制钉子,8,0,0,0,0",@"双层方块·绿",\
@"草原木头,15,绿苔,15,铁制钉子,12,0,0,0,0",@"三层方块·绿",\
@"红珊瑚,10,小贝壳,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形椅子·粉",\
@"红珊瑚,10,樱花花瓣,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形桌子小·粉",\
@"红珊瑚,12,研磨砂,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形柜台小·粉",\
@"红珊瑚,14,大贝壳,14,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形长椅·粉",\
@"红珊瑚,14,樱花花瓣,14,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形桌子大·粉",\
@"红珊瑚,16,研磨砂,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形柜台大·粉",\
@"红珊瑚,20,椰子,10,闪光树汁,5,汗与泪的结晶,10,0,0",@"心形宴会桌·粉",\
@"红珊瑚,10,妖异草,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形屏风·粉",\
@"红珊瑚,10,美丽蘑菇,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形书架·粉",\
@"红珊瑚,10,彩虹色的布片,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形餐具架·粉",\
@"红珊瑚,12,美丽蘑菇,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形厨台·粉",\
@"红珊瑚,12,蛤蟆油,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"心形烤炉·粉",\
@"红珊瑚,14,涟漪之露,10,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形浴盆·粉",\
@"红珊瑚,16,彩虹色的布片,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形衣柜·粉",\
@"红珊瑚,16,美丽蘑菇,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"心形收纳柜·粉",\
@"红珊瑚,20,妖异草,20,闪光树汁,5,汗与泪的结晶,10,0,0",@"心形床·粉",\
@"草原木头,10,金块,1,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫椅子·蓝",\
@"草原木头,10,蛇蜕,10,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫桌子小·蓝",\
@"草原木头,12,研磨砂,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫柜台小·蓝",\
@"草原木头,14,金块,1,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫长椅·蓝",\
@"草原木头,14,蛇蜕,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫桌子大·蓝",\
@"草原木头,16,研磨砂,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫柜台大·蓝",\
@"草原木头,20,椰子,10,闪光树汁,5,汗与泪的结晶,10,0,0",@"王宫宴会桌·蓝",\
@"草原木头,10,大块原骨,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫屏风·蓝",\
@"草原木头,10,蛇蜕,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫书架·蓝",\
@"草原木头,10,小贝壳,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫餐具架·蓝",\
@"草原木头,12,大贝壳,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫厨台·蓝",\
@"草原木头,12,热乎乎的石头,20,闪光树汁,3,汗与泪的结晶,10,0,0",@"王宫烤炉·蓝",\
@"草原木头,14,净化之水,14,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫浴盆·蓝",\
@"草原木头,16,蛇蜕,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫衣柜·蓝",\
@"草原木头,16,大鳞片,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"王宫收纳柜·蓝",\
@"草原木头,20,浓密毛皮,20,闪光树汁,5,汗与泪的结晶,10,0,0",@"王宫床·蓝",\
@"暗黑树木,16,彩虹色的布片,16,闪光树汁,6,汗与泪的结晶,25,0,0",@"拼布图案沙发·粉",\
@"暗黑树木,20,彩虹色的布片,20,闪光树汁,6,汗与泪的结晶,25,0,0",@"拼布图案桌子·粉",\
@"暗黑树木,24,彩虹色的布片,24,闪光树汁,6,汗与泪的结晶,25,0,0",@"拼布图案床·粉",\
@"冰之树木,10,热乎乎的石头,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜椅子",\
@"冰之树木,10,热乎乎的石头,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜桌子小",\
@"冰之树木,12,热乎乎的石头,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜柜台小",\
@"冰之树木,14,热乎乎的石头,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜长椅",\
@"冰之树木,14,热乎乎的石头,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜桌子大",\
@"冰之树木,16,热乎乎的石头,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜柜台大",\
@"冰之树木,20,热乎乎的石头,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"黑曜宴会桌",\
@"冰之树木,20,热乎乎的石头,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"黑曜宝座",\
@"冰之树木,10,熔岩碎片,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜屏风",\
@"冰之树木,10,熔岩碎片,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜书架",\
@"冰之树木,10,熔岩碎片,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜餐具架",\
@"冰之树木,12,熔岩碎片,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"黑曜厨台",\
@"冰之树木,12,熔岩碎片,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜烤炉",\
@"冰之树木,14,熔岩碎片,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜浴盆",\
@"冰之树木,16,熔岩碎片,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜衣柜",\
@"冰之树木,16,熔岩碎片,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"黑曜收纳柜",\
@"冰之树木,20,熔岩碎片,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"黑曜床",\
@"冰之树木,20,熔岩碎片,20,闪光树汁,4,汗与泪的结晶,10,0,0",@"黑曜暖炉",\
@"纯白木头,10,樱花花瓣,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主椅子·粉",\
@"纯白木头,10,美丽蘑菇,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主桌子小·粉",\
@"纯白木头,12,美丽蘑菇,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主柜台小·粉",\
@"纯白木头,14,樱花花瓣,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主长椅·粉",\
@"纯白木头,14,美丽蘑菇,14,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主桌子大·粉",\
@"纯白木头,16,美丽蘑菇,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主柜台大·粉",\
@"纯白木头,20,史莱姆时尚花,3,闪光树汁,4,汗与泪的结晶,10,0,0",@"公主宴会桌·粉",\
@"纯白木头,10,彩虹色的布片,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主屏风·粉",\
@"纯白木头,10,大贝壳,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主书架·粉",\
@"纯白木头,10,粉红珍珠,3,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主餐具架·粉",\
@"纯白木头,12,大贝壳,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主厨台·粉",\
@"纯白木头,12,美丽蘑菇,12,闪光树汁,2,汗与泪的结晶,10,0,0",@"公主烤炉·粉",\
@"纯白木头,14,粉红珍珠,4,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主浴盆·粉",\
@"纯白木头,16,美丽蘑菇,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主衣柜·粉",\
@"纯白木头,16,樱花花瓣,16,闪光树汁,3,汗与泪的结晶,10,0,0",@"公主收纳柜·粉",\
@"纯白木头,20,史莱姆时尚花,3,闪光树汁,4,汗与泪的结晶,10,0,0",@"公主床·粉",\
@"结实的树枝,10,热乎乎的石头,10,闪光树汁,4,0,0,0,0",@"蒸汽时代椅子",\
@"结实的树枝,10,热乎乎的石头,10,闪光树汁,4,0,0,0,0",@"蒸汽时代桌子小",\
@"结实的树枝,12,热乎乎的石头,12,闪光树汁,4,0,0,0,0",@"蒸汽时代柜台小",\
@"结实的树枝,14,热乎乎的石头,14,闪光树汁,5,0,0,0,0",@"蒸汽时代长椅",\
@"结实的树枝,14,热乎乎的石头,14,闪光树汁,5,0,0,0,0",@"蒸汽时代桌子大",\
@"结实的树枝,16,热乎乎的石头,16,闪光树汁,5,0,0,0,0",@"蒸汽时代柜台大",\
@"结实的树枝,10,熔岩碎片,10,闪光树汁,4,0,0,0,0",@"蒸汽时代屏风",\
@"结实的树枝,10,熔岩碎片,10,闪光树汁,4,0,0,0,0",@"蒸汽时代书架",\
@"结实的树枝,10,熔岩碎片,10,闪光树汁,4,0,0,0,0",@"蒸汽时代餐具架",\
@"结实的树枝,12,熔岩碎片,12,闪光树汁,4,0,0,0,0",@"蒸汽时代厨台",\
@"结实的树枝,12,熔岩碎片,12,闪光树汁,4,0,0,0,0",@"蒸汽时代烤炉",\
@"结实的树枝,14,熔岩碎片,14,闪光树汁,5,0,0,0,0",@"蒸汽时代浴盆",\
@"结实的树枝,16,熔岩碎片,16,闪光树汁,5,0,0,0,0",@"蒸汽时代衣柜",\
@"结实的树枝,16,熔岩碎片,16,闪光树汁,5,0,0,0,0",@"蒸汽时代收纳柜",\
@"结实的树枝,20,熔岩碎片,20,闪光树汁,6,0,0,0,0",@"蒸汽时代床",\
@"冰之树木,10,史莱姆果冻,10,闪光树汁,4,0,0,0,0",@"水晶椅子",\
@"冰之树木,10,史莱姆果冻,10,闪光树汁,4,0,0,0,0",@"水晶桌子小",\
@"冰之树木,12,史莱姆果冻,12,闪光树汁,4,0,0,0,0",@"水晶柜台小",\
@"冰之树木,14,史莱姆果冻,14,闪光树汁,5,0,0,0,0",@"水晶长椅",\
@"冰之树木,14,史莱姆果冻,14,闪光树汁,5,0,0,0,0",@"水晶桌子大",\
@"冰之树木,16,史莱姆果冻,16,闪光树汁,5,0,0,0,0",@"水晶柜台大",\
@"冰之树木,20,史莱姆果冻,20,闪光树汁,6,0,0,0,0",@"水晶宝座",\
@"冰之树木,10,小贝壳,10,闪光树汁,4,0,0,0,0",@"水晶屏风",\
@"冰之树木,10,小贝壳,10,闪光树汁,4,0,0,0,0",@"水晶书架",\
@"冰之树木,10,小贝壳,10,闪光树汁,4,0,0,0,0",@"水晶餐具架",\
@"冰之树木,12,小贝壳,12,闪光树汁,4,0,0,0,0",@"水晶厨台",\
@"冰之树木,12,小贝壳,12,闪光树汁,4,0,0,0,0",@"水晶烤炉",\
@"冰之树木,14,小贝壳,14,闪光树汁,5,0,0,0,0",@"水晶浴盆",\
@"冰之树木,16,小贝壳,16,闪光树汁,5,0,0,0,0",@"水晶衣柜",\
@"冰之树木,16,小贝壳,16,闪光树汁,5,0,0,0,0",@"水晶收纳柜",\
@"冰之树木,20,小贝壳,20,闪光树汁,6,0,0,0,0",@"水晶床",\
@"冰之树木,20,小贝壳,20,闪光树汁,6,0,0,0,0",@"水晶暖炉",\
@"草原木头,20,光之石,10,闪光树汁,8,0,0,0,0",@"星耀椅子·红",\
@"草原木头,20,光之石,10,闪光树汁,8,0,0,0,0",@"星耀脚踏·红",\
@"结实的树枝,10,美丽蘑菇,10,闪光树汁,2,0,0,0,0",@"红蘑菇椅子",\
@"结实的树枝,14,美丽蘑菇,12,闪光树汁,3,0,0,0,0",@"红蘑菇桌子",\
@"结实的树枝,14,美丽蘑菇,12,闪光树汁,4,0,0,0,0",@"红蘑菇床",\
@"结实的树枝,10,美丽蘑菇,10,闪光树汁,2,0,0,0,0",@"红蘑菇装饰品",\
@"炎之树木,10,红色之眼,10,闪光树汁,2,汗与泪的结晶,10,0,0",@"导演椅子·红",\
@"炎之树木,14,粉红珍珠,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"性感桌子",\
@"炎之树木,14,粉红珍珠,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"性感衣柜",\
@"炎之树木,20,粉红珍珠,16,闪光树汁,5,汗与泪的结晶,10,0,0",@"性感床",\
@"炎之树木,20,粉红珍珠,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"性感浴盆",\
@"炎之树木,18,妖异草,16,闪光树汁,4,汗与泪的结晶,10,0,0",@"性感沙发",\
@"炎之树木,14,妖异草,12,闪光树汁,3,汗与泪的结晶,10,0,0",@"性感梳妆台",\
@"暗黑树木,12,红色之眼,5,闪光树汁,2,汗与泪的结晶,20,0,0",@"彩砖椅子",\
@"暗黑树木,18,红色之眼,5,闪光树汁,3,汗与泪的结晶,20,0,0",@"彩砖桌子",\
@"暗黑树木,16,绿色之眼,5,闪光树汁,3,汗与泪的结晶,20,0,0",@"彩砖衣柜",\
@"暗黑树木,14,绿色之眼,5,闪光树汁,2,汗与泪的结晶,20,0,0",@"彩砖书架",\
@"暗黑树木,20,蓝色之眼,5,闪光树汁,4,汗与泪的结晶,20,0,0",@"彩砖床",\
@"暗黑树木,18,蓝色之眼,5,闪光树汁,3,汗与泪的结晶,20,0,0",@"彩砖沙发",\
@"暗黑树木,14,紫色之眼,5,闪光树汁,2,汗与泪的结晶,20,0,0",@"彩砖梳妆台",\
@"暗黑树木,16,紫色之眼,5,闪光树汁,3,汗与泪的结晶,20,0,0",@"彩砖收纳柜",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"西瓜椅子",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"西瓜桌子",\
@"草原木头,16,冷达种子,5,闪光树汁,5,0,0,0,0",@"苹果衣柜",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"橙子书架",\
@"草原木头,20,冷达种子,6,闪光树汁,6,0,0,0,0",@"西洋梨床",\
@"草原木头,14,冷达种子,5,闪光树汁,5,0,0,0,0",@"香蕉沙发",\
@"草原木头,14,冷达种子,5,闪光树汁,5,0,0,0,0",@"菠萝梳妆台",\
@"草原木头,16,冷达种子,5,闪光树汁,5,0,0,0,0",@"蜜瓜收纳柜",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"萝卜椅子",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"番薯桌子",\
@"草原木头,16,冷达种子,5,闪光树汁,5,0,0,0,0",@"胡萝卜衣柜",\
@"草原木头,10,冷达种子,4,闪光树汁,4,0,0,0,0",@"茄子书架",\
@"草原木头,20,冷达种子,6,闪光树汁,6,0,0,0,0",@"玉米床",\
@"草原木头,14,冷达种子,5,闪光树汁,5,0,0,0,0",@"番茄沙发",\
@"草原木头,14,冷达种子,5,闪光树汁,5,0,0,0,0",@"青椒梳妆台",\
@"草原木头,16,冷达种子,5,闪光树汁,5,0,0,0,0",@"洋葱收纳柜",\
@"草原木头,4,繁星的眼泪,12,0,0,0,0,0,0",@"带蚊帐的被褥·黄",\
@"暗黑树木,6,星之碎片,8,闪光树汁,4,0,0,0,0",@"星空椅子·紫",\
@"暗黑树木,8,星之碎片,8,闪光树汁,4,0,0,0,0",@"星空小桌·紫",\
@"暗黑树木,10,星之碎片,10,闪光树汁,5,0,0,0,0",@"星空衣柜·紫",\
@"暗黑树木,8,星之碎片,8,闪光树汁,4,0,0,0,0",@"星空书架·紫",\
@"暗黑树木,12,星之碎片,12,闪光树汁,6,0,0,0,0",@"星空床·紫",\
@"暗黑树木,10,星之碎片,10,闪光树汁,5,0,0,0,0",@"星空沙发·紫",\
@"暗黑树木,6,星之碎片,10,闪光树汁,5,0,0,0,0",@"星空梳妆台·紫",\
@"暗黑树木,8,星之碎片,10,闪光树汁,5,0,0,0,0",@"星空收纳柜·紫",\
@"草原木头,12,白色珍珠,8,闪光树汁,4,汗与泪的结晶,10,0,0",@"格纹椅子·红",\
@"草原木头,16,白色珍珠,8,闪光树汁,4,汗与泪的结晶,10,0,0",@"格纹桌子·红",\
@"草原木头,20,白色珍珠,12,闪光树汁,6,汗与泪的结晶,15,0,0",@"格纹床·红",\
@"暗黑树木,6,天籁之蜜,8,闪光树汁,4,0,0,0,0",@"音符椅子·黑",\
@"暗黑树木,10,天籁之蜜,10,闪光树汁,5,0,0,0,0",@"音符长椅·黑",\
@"暗黑树木,8,天籁之蜜,8,闪光树汁,4,0,0,0,0",@"音符桌子·黑",\
@"暗黑树木,10,天籁之蜜,10,闪光树汁,5,0,0,0,0",@"音符衣柜·黑",\
@"暗黑树木,8,天籁之蜜,8,闪光树汁,4,0,0,0,0",@"音符书架·黑",\
@"暗黑树木,12,天籁之蜜,12,闪光树汁,6,0,0,0,0",@"音符床·黑",\
@"暗黑树木,8,天籁之蜜,10,闪光树汁,5,0,0,0,0",@"音符收纳柜·黑",\
@"纯白木头,3,净化之水,8,闪光树汁,4,0,0,0,0",@"云朵椅子",\
@"纯白木头,4,净化之水,8,闪光树汁,4,0,0,0,0",@"云朵桌子",\
@"纯白木头,5,净化之水,10,闪光树汁,5,0,0,0,0",@"云朵衣柜",\
@"纯白木头,4,净化之水,8,闪光树汁,4,0,0,0,0",@"云朵书架",\
@"纯白木头,6,净化之水,12,闪光树汁,6,0,0,0,0",@"云朵床",\
@"纯白木头,5,净化之水,10,闪光树汁,5,0,0,0,0",@"云朵沙发",\
@"纯白木头,3,净化之水,10,闪光树汁,5,0,0,0,0",@"云朵梳妆台",\
@"纯白木头,4,净化之水,10,闪光树汁,5,0,0,0,0",@"云朵收纳柜",\
@"史莱姆时尚花,6,花蜜,10,闪光树汁,6,汗与泪的结晶,20,0,0",@"花货车·鲜艳",\
@"柔韧的树枝,4,祈晴竹叶,12,0,0,0,0,0,0",@"鲜艳的七夕竹饰",\
@"干净的树枝,4,祈晴竹叶,12,0,0,0,0,0,0",@"七夕飘带·花",\
@"结实的树枝,4,繁星的眼泪,12,0,0,0,0,0,0",@"丝瓜架",\
@"结实的树枝,4,蛇蜕,4,妖精粉,5,0,0,0,0",@"结实的钓竿",\
@"干净的树枝,6,蝴蝶翅膀,6,汗与泪的结晶,1,闪光树汁,1,0,0",@"漂亮的钓竿",\
@"炎之树木,8,熔岩碎片,8,鲨鱼皮,1,汗与泪的结晶,2,闪光树汁,2",@"炎之钓竿",\
@"冰之树木,8,冰的结晶,8,鲨鱼皮,1,汗与泪的结晶,2,闪光树汁,2",@"冰之钓竿",\
@"暗黑树木,8,脏绷带,8,鲨鱼皮,1,汗与泪的结晶,2,闪光树汁,2",@"暗之钓竿",\
@"炎之树木,24,金属碎片,1,鲨鱼皮,4,汗与泪的结晶,4,闪光树汁,4",@"炎之钓竿改",\
@"冰之树木,24,金属碎片,1,鲨鱼皮,4,汗与泪的结晶,4,闪光树汁,4",@"冰之钓竿改",\
@"暗黑树木,24,金属碎片,1,鲨鱼皮,4,汗与泪的结晶,4,闪光树汁,4",@"暗之钓竿改",\
@"柔软的肉,3,巨型洋葱,2,美味食用油,3,0,0,0,0",@"灵巧肉包",\
@"柔软的肉,4,浑圆土豆,3,浓醇酱汁,5,美味食用油,5,0,0",@"力量肉排",\
@"柔软的肉,4,松软小麦,3,浓醇酱汁,5,美味食用油,6,0,0",@"会心汉堡",\
@"柔软的肉,4,新鲜的蛋,3,闪避草,10,美味食用油,6,0,0",@"闪避蛋包饭",\
@"霜降肉,2,清脆莴苣,6,吓人番茄,3,微辣胡椒,3,美味食用油,12",@"杂技汉堡",\
@"霜降肉,1,清脆莴苣,3,吓人番茄,2,微辣胡椒,2,美味食用油,6",@"杂技汉堡·小",\
@"霜降肉,2,新鲜的蛋,6,吓人番茄,3,浓醇酱汁,3,美味食用油,12",@"爱情蛋包饭",\
@"霜降肉,1,新鲜的蛋,3,吓人番茄,2,浓醇酱汁,2,美味食用油,6",@"爱情蛋包饭·小",\
@"霜降肉,3,巨型洋葱,6,吓人番茄,4,微辣胡椒,4,美味食用油,16",@"战斗牛排",\
@"霜降肉,2,巨型洋葱,3,吓人番茄,2,微辣胡椒,2,美味食用油,8",@"战斗牛排·小",\
@"切块鱼肉,3,浑圆土豆,2,美味食用油,3,0,0,0,0",@"治愈浓汤",\
@"切块鱼肉,4,清脆莴苣,3,美味食用油,4,0,0,0,0",@"守护者沙拉",\
@"切块鱼肉,4,清脆莴苣,3,松软小麦,3,美味食用油,5,0,0",@"魔法三明治",\
@"顶级鱼腩,2,松软小麦,6,吓人番茄,3,顶级食盐,3,美味食用油,12",@"治愈煎鱼",\
@"顶级鱼腩,1,松软小麦,3,吓人番茄,2,顶级食盐,2,美味食用油,6",@"治愈煎鱼·小",\
@"顶级鱼腩,3,清脆莴苣,6,吓人番茄,4,微辣胡椒,4,美味食用油,16",@"魔法汤",\
@"顶级鱼腩,2,清脆莴苣,3,吓人番茄,2,微辣胡椒,2,美味食用油,8",@"魔法汤·小",\
@"顶级鱼腩,3,巨型洋葱,6,吓人番茄,4,浓醇酱汁,4,美味食用油,16",@"奇迹三明治",\
@"顶级鱼腩,2,巨型洋葱,3,吓人番茄,2,浓醇酱汁,2,美味食用油,8",@"奇迹三明治·小",\
@"顶级鱼腩,3,浑圆土豆,6,吓人番茄,4,顶级食盐,4,美味食用油,16",@"土豆泥",\
@"顶级鱼腩,2,浑圆土豆,3,吓人番茄,2,顶级食盐,2,美味食用油,8",@"土豆泥·小",\
@"顶级鱼腩,3,新鲜的蛋,6,吓人番茄,4,顶级食盐,4,美味食用油,16",@"奢华烤菜",\
@"顶级鱼腩,2,新鲜的蛋,3,吓人番茄,2,顶级食盐,2,美味食用油,8",@"奢华烤菜·小",\
@"柔软的肉,3,稻花,2,美味食用油,2,0,0,0,0",@"体力米饭",\
@"切块鱼肉,3,松软小麦,2,美味食用油,2,0,0,0,0",@"能量意面",\
@"柔软的肉,4,浑圆土豆,3,稻花,3,美味食用油,6,0,0",@"超大碗盖饭",\
@"顶级鱼腩,2,松软小麦,6,吓人番茄,3,浓醇酱汁,3,美味食用油,12",@"平衡意面",\
@"顶级鱼腩,1,松软小麦,3,吓人番茄,2,浓醇酱汁,2,美味食用油,6",@"平衡意面·小",\
@"霜降肉,3,稻花,6,吓人番茄,4,微辣胡椒,4,美味食用油,16",@"香料咖喱",\
@"霜降肉,2,稻花,3,吓人番茄,2,微辣胡椒,2,美味食用油,8",@"香料咖喱·小",\
@"顶级鱼腩,3,稻花,6,吓人番茄,4,浓醇酱汁,4,美味食用油,16",@"足量烩饭",\
@"顶级鱼腩,2,稻花,3,吓人番茄,2,浓醇酱汁,2,美味食用油,8",@"足量烩饭·小",\
@"新鲜的蛋,3,美味的奶,1,美味食用油,1,0,0,0,0",@"快速蛋糕",\
@"新鲜的蛋,3,花蜜,1,美味食用油,1,0,0,0,0",@"华丽的曲奇",\
@"新鲜的蛋,10,红浆果,10,顶级食盐,3,美味食用油,8,0,0",@"烈焰蛋挞",\
@"新鲜的蛋,5,红浆果,5,顶级食盐,2,美味食用油,4,0,0",@"烈焰蛋挞·小",\
@"新鲜的蛋,10,冰的结晶,10,顶级食盐,3,美味食用油,8,0,0",@"寒冰蛋挞",\
@"新鲜的蛋,5,冰的结晶,5,顶级食盐,2,美味食用油,4,0,0",@"寒冰蛋挞·小",\
@"美味的奶,10,天使的神酒,1,顶级食盐,3,美味食用油,8,0,0",@"光明蛋挞",\
@"美味的奶,5,净化之水,5,顶级食盐,2,美味食用油,4,0,0",@"光明蛋挞·小",\
@"美味的奶,10,坚硬的胡桃,10,顶级食盐,3,美味食用油,8,0,0",@"黑暗蛋挞",\
@"美味的奶,5,坚硬的胡桃,5,顶级食盐,2,美味食用油,4,0,0",@"黑暗蛋挞·小",\
@"美味的奶,10,闪避草,10,顶级食盐,3,美味食用油,8,0,0",@"风暴蛋挞",\
@"美味的奶,5,闪避草,5,顶级食盐,2,美味食用油,4,0,0",@"风暴蛋挞·小",\
@"顶级鱼腩,2,美味的奶,6,吓人番茄,3,顶级食盐,3,美味食用油,12",@"明星点心",\
@"顶级鱼腩,1,美味的奶,3,吓人番茄,2,顶级食盐,2,美味食用油,6",@"明星点心·小",\
@"稻花,4,繁星的眼泪,4,美味食用油,1,0,0,0,0",@"赔罪竹叶团子"*/

//素材列表
#define MATERIAL_ITEM               @[@"素材列表"]
#define MATERIAL_ITEM_NAMES			@[@[@"七色茧",\
@"万年雪",\
@"丝草",\
@"光之石",\
@"冰之树木",\
@"冰的结晶",\
@"冷达种子",\
@"净化之水",\
@"切块鱼肉",\
@"利爪",\
@"利齿",\
@"刺海胆",\
@"史莱姆时尚花",\
@"史莱姆果冻",\
@"吓人番茄",\
@"圣者之灰",\
@"坚硬的胡桃",\
@"埃尔托纳水仙",\
@"多瓦切卡油",\
@"夜之幕",\
@"夜色万寿菊",\
@"大仙人掌",\
@"大块化石",\
@"大块原骨",\
@"大甲壳",\
@"大贝壳",\
@"大鳞片",\
@"天使的神酒",\
@"天籁之蜜",\
@"奥古力德化石角",\
@"妖异草",\
@"妖精的棉花",\
@"妖精的火种",\
@"妖精粉",\
@"小块化石",\
@"小块原骨",\
@"小甲壳",\
@"小贝壳",\
@"小鳞片",\
@"巧克力色郁金香",\
@"巨型洋葱",\
@"干净的树枝",\
@"幻兽原皮",\
@"幻兽原骨",\
@"幻魔石",\
@"彩虹宝珠",\
@"彩虹色的布片",\
@"微辣胡椒",\
@"拳骨菇",\
@"斩风羽",\
@"新鲜的蛋",\
@"时之水晶",\
@"星之碎片",\
@"普库兰藏红花",\
@"暗黑树木",\
@"木棉草",\
@"松软小麦",\
@"柔软的树枝",\
@"柔软的羊毛",\
@"柔软的肉",\
@"柔韧的树枝",\
@"椰子",\
@"樱花花瓣",\
@"橙色铃兰",\
@"武道精华",\
@"毒毒淤泥",\
@"水之树木",\
@"水蓝色万寿菊",\
@"汗与泪的结晶",\
@"沙漠水果",\
@"浑圆土豆",\
@"浓密毛皮",\
@"浓醇酱汁",\
@"海风草",\
@"涟漪之露",\
@"淡紫色铃兰",\
@"清脆莴苣",\
@"灰蓝色万寿菊",\
@"炎之树木",\
@"热乎乎的石头",\
@"焦糖色郁金香",\
@"熔岩碎片",\
@"牛粪",\
@"猫砂",\
@"白色珍珠",\
@"白金矿石",\
@"研磨砂",\
@"祈晴竹叶",\
@"神奇泥浆",\
@"神奇海草",\
@"稻花",\
@"粉红珍珠",\
@"精灵石",\
@"紫色之眼",\
@"紫色宝珠",\
@"繁星的眼泪",\
@"红浆果",\
@"红珊瑚",\
@"红色之眼",\
@"红色宝珠",\
@"红色宝石",\
@"纯白木头",\
@"结实的树枝",\
@"维纳尔贝壳",\
@"绿色之眼",\
@"绿色宝珠",\
@"绿色宝石",\
@"绿苔",\
@"美丽蘑菇",\
@"美味的奶",\
@"美味食用油",\
@"翡翠绿百合",\
@"脏绷带",\
@"腌菜石",\
@"花蜜",\
@"草原之水",\
@"草原木头",\
@"蓝色之眼",\
@"蓝色宝珠",\
@"蓝色宝石",\
@"蛇蜕",\
@"蛤蟆油",\
@"蝙蝠翅膀",\
@"蝴蝶翅膀",\
@"赤光结晶",\
@"转生之辉石",\
@"重金属",\
@"野兽原皮",\
@"金块",\
@"金属碎片",\
@"铁制钉子",\
@"铁矿石",\
@"铜矿石",\
@"银矿石",\
@"镜之石",\
@"闪光树汁",\
@"闪光草",\
@"闪避草",\
@"雨露之丝",\
@"雷鸣珠",\
@"雾灰色铃兰",\
@"霜降肉",\
@"顶级食盐",\
@"顶级鱼腩",\
@"领悟草",\
@"马粪",\
@"魔兽原皮",\
@"魔兽原角",\
@"魔兽原骨",\
@"魔力之土",\
@"魔法树木",\
@"鲨鱼皮",\
@"麻线",\
@"黄色之眼",\
@"黄色宝珠",\
@"黄色宝石",\
@"黄金石",\
@"黄金碎片",\
@"黄金装饰单手剑",\
@"黄金装饰双手剑",\
@"黄金装饰双手杖",\
@"黄金装饰回旋镖",\
@"黄金装饰头盔",\
@"黄金装饰弓",\
@"黄金装饰扇",\
@"黄金装饰护臂",\
@"黄金装饰斧",\
@"黄金装饰棍",\
@"黄金装饰爪",\
@"黄金装饰盾",\
@"黄金装饰矛",\
@"黄金装饰短剑",\
@"黄金装饰短杖",\
@"黄金装饰铠甲上装",\
@"黄金装饰铠甲下装",\
@"黄金装饰锤",\
@"黄金装饰鞋",\
@"黄金装饰鞭",\
@"黑珍珠",\
@"龙的原皮",\
@"龙的原角",\
@"龙的原骨"]]
#define MATERIAL_ITEM_IMAGES		@[@[@"Icon-七色茧.png",\
@"Icon-万年雪.png",\
@"Icon-丝草.png",\
@"Icon-光之石.png",\
@"Icon-冰之树木.png",\
@"Icon-冰的结晶.png",\
@"Icon-冷达种子.png",\
@"Icon-净化之水.png",\
@"Icon-切块鱼肉.png",\
@"Icon-利爪.png",\
@"Icon-利齿.png",\
@"Icon-刺海胆.png",\
@"Icon-史莱姆时尚花.png",\
@"Icon-史莱姆果冻.png",\
@"Icon-吓人番茄.png",\
@"Icon-圣者之灰.png",\
@"Icon-坚硬的胡桃.png",\
@"Icon-埃尔托纳水仙.png",\
@"Icon-多瓦切卡油.png",\
@"Icon-夜之幕.png",\
@"Icon-夜色万寿菊.png",\
@"Icon-大仙人掌.png",\
@"Icon-大块化石.png",\
@"Icon-大块原骨.png",\
@"Icon-大甲壳.png",\
@"Icon-大贝壳.png",\
@"Icon-大鳞片.png",\
@"Icon-天使的神酒.png",\
@"Icon-天籁之蜜.png",\
@"Icon-奥古力德化石角.png",\
@"Icon-妖异草.png",\
@"Icon-妖精的棉花.png",\
@"Icon-妖精的火种.png",\
@"Icon-妖精粉.png",\
@"Icon-小块化石.png",\
@"Icon-小块原骨.png",\
@"Icon-小甲壳.png",\
@"Icon-小贝壳.png",\
@"Icon-小鳞片.png",\
@"Icon-巧克力色郁金香.png",\
@"Icon-巨型洋葱.png",\
@"Icon-干净的树枝.png",\
@"Icon-幻兽原皮.png",\
@"Icon-幻兽原骨.png",\
@"Icon-幻魔石.png",\
@"Icon-彩虹宝珠.png",\
@"Icon-彩虹色的布片.png",\
@"Icon-微辣胡椒.png",\
@"Icon-拳骨菇.png",\
@"Icon-斩风羽.png",\
@"Icon-新鲜的蛋.png",\
@"Icon-时之水晶.png",\
@"Icon-星之碎片.png",\
@"Icon-普库兰藏红花.png",\
@"Icon-暗黑树木.png",\
@"Icon-木棉草.png",\
@"Icon-松软小麦.png",\
@"Icon-柔软的树枝.png",\
@"Icon-柔软的羊毛.png",\
@"Icon-柔软的肉.png",\
@"Icon-柔韧的树枝.png",\
@"Icon-椰子.png",\
@"Icon-樱花花瓣.png",\
@"Icon-橙色铃兰.png",\
@"Icon-武道精华.png",\
@"Icon-毒毒淤泥.png",\
@"Icon-水之树木.png",\
@"Icon-水蓝色万寿菊.png",\
@"Icon-汗与泪的结晶.png",\
@"Icon-沙漠水果.png",\
@"Icon-浑圆土豆.png",\
@"Icon-浓密毛皮.png",\
@"Icon-浓醇酱汁.png",\
@"Icon-海风草.png",\
@"Icon-涟漪之露.png",\
@"Icon-淡紫色铃兰.png",\
@"Icon-清脆莴苣.png",\
@"Icon-灰蓝色万寿菊.png",\
@"Icon-炎之树木.png",\
@"Icon-热乎乎的石头.png",\
@"Icon-焦糖色郁金香.png",\
@"Icon-熔岩碎片.png",\
@"Icon-牛粪.png",\
@"Icon-猫砂.png",\
@"Icon-白色珍珠.png",\
@"Icon-白金矿石.png",\
@"Icon-研磨砂.png",\
@"Icon-祈晴竹叶.png",\
@"Icon-神奇泥浆.png",\
@"Icon-神奇海草.png",\
@"Icon-稻花.png",\
@"Icon-粉红珍珠.png",\
@"Icon-精灵石.png",\
@"Icon-紫色之眼.png",\
@"Icon-紫色宝珠.png",\
@"Icon-繁星的眼泪.png",\
@"Icon-红浆果.png",\
@"Icon-红珊瑚.png",\
@"Icon-红色之眼.png",\
@"Icon-红色宝珠.png",\
@"Icon-红色宝石.png",\
@"Icon-纯白木头.png",\
@"Icon-结实的树枝.png",\
@"Icon-维纳尔贝壳.png",\
@"Icon-绿色之眼.png",\
@"Icon-绿色宝珠.png",\
@"Icon-绿色宝石.png",\
@"Icon-绿苔.png",\
@"Icon-美丽蘑菇.png",\
@"Icon-美味的奶.png",\
@"Icon-美味食用油.png",\
@"Icon-翡翠绿百合.png",\
@"Icon-脏绷带.png",\
@"Icon-腌菜石.png",\
@"Icon-花蜜.png",\
@"Icon-草原之水.png",\
@"Icon-草原木头.png",\
@"Icon-蓝色之眼.png",\
@"Icon-蓝色宝珠.png",\
@"Icon-蓝色宝石.png",\
@"Icon-蛇蜕.png",\
@"Icon-蛤蟆油.png",\
@"Icon-蝙蝠翅膀.png",\
@"Icon-蝴蝶翅膀.png",\
@"Icon-赤光结晶.png",\
@"Icon-转生之辉石.png",\
@"Icon-重金属.png",\
@"Icon-野兽原皮.png",\
@"Icon-金块.png",\
@"Icon-金属碎片.png",\
@"Icon-铁制钉子.png",\
@"Icon-铁矿石.png",\
@"Icon-铜矿石.png",\
@"Icon-银矿石.png",\
@"Icon-镜之石.png",\
@"Icon-闪光树汁.png",\
@"Icon-闪光草.png",\
@"Icon-闪避草.png",\
@"Icon-雨露之丝.png",\
@"Icon-雷鸣珠.png",\
@"Icon-雾灰色铃兰.png",\
@"Icon-霜降肉.png",\
@"Icon-顶级食盐.png",\
@"Icon-顶级鱼腩.png",\
@"Icon-领悟草.png",\
@"Icon-马粪.png",\
@"Icon-魔兽原皮.png",\
@"Icon-魔兽原角.png",\
@"Icon-魔兽原骨.png",\
@"Icon-魔力之土.png",\
@"Icon-魔法树木.png",\
@"Icon-鲨鱼皮.png",\
@"Icon-麻线.png",\
@"Icon-黄色之眼.png",\
@"Icon-黄色宝珠.png",\
@"Icon-黄色宝石.png",\
@"Icon-黄金石.png",\
@"Icon-黄金碎片.png",\
@"Icon-黄金装饰单手剑.png",\
@"Icon-黄金装饰双手剑.png",\
@"Icon-黄金装饰双手杖.png",\
@"Icon-黄金装饰回旋镖.png",\
@"Icon-黄金装饰头盔.png",\
@"Icon-黄金装饰弓.png",\
@"Icon-黄金装饰扇.png",\
@"Icon-黄金装饰护臂.png",\
@"Icon-黄金装饰斧.png",\
@"Icon-黄金装饰棍.png",\
@"Icon-黄金装饰爪.png",\
@"Icon-黄金装饰盾.png",\
@"Icon-黄金装饰矛.png",\
@"Icon-黄金装饰短剑.png",\
@"Icon-黄金装饰短杖.png",\
@"Icon-黄金装饰铠甲上装.png",\
@"Icon-黄金装饰铠甲下装.png",\
@"Icon-黄金装饰锤.png",\
@"Icon-黄金装饰鞋.png",\
@"Icon-黄金装饰鞭.png",\
@"Icon-黑珍珠.png",\
@"Icon-龙的原皮.png",\
@"Icon-龙的原角.png",\
@"Icon-龙的原骨.png"]]

#endif /* Macros_h */
